[
    {
        "Date": "2024-01-21T13:23:00.000Z",
        "Title": "Is Meta Platforms Stock Still a Buy After Hitting a New 52-Week High?",
        "Author": "  David Jagielski, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) was one of the S&P 500's hottest stocks last year, rising by an impressive 194% in 2023. It bounced back in a big way after a disappointing 2022 when its share price tanked by 64%.\nThe stock still shows no sign of slowing down as it recently hit new 52-week highs. Is Meta Platforms' stock going to generate strong returns yet again this year, or is now the time for investors to consider cashing out?\nInvestors became bearish on Meta Platforms' business in 2022 as a weak ad market resulted in lackluster sales growth for the company. Towards the end of the year, the company struggled to generate any growth at all. But in recent quarters and amid a more favorable outlook for the economy, the business has been rebounding -- in a big way.\nWith revenue growth back above 20%, Meta has convinced investors that it's still a top growth stock to own. One thing that could derail these numbers, however, is if the ad market slows down. In the latest quarter, which ended on Sept. 30, 2023, Meta reported that ad impressions on its family of apps segment (which includes Instagram, WhatsApp, Messenger, and Facebook) grew 31% year over year, but the average price per ad declined by 6%.\nThat's a fairly high growth rate in ad impressions and may be unsustainable. Other factors that may have influenced that strong growth include companies moving away from TikTok due to government bans and X (formerly known as Twitter) due to policy changes, and spending their ad money on Facebook and Instagram instead. But that kind of growth may be a bit too optimistic to continue to expect this year, especially if a recession takes place and companies scale back their ad spending.\nDue to Meta's run-up in price over the past year, the stock is now trading at a price-to-earnings multiple of 33. That's a high multiple compared with the stock's five-year average, which includes some heavy discounts in 2022.\nOn Wall Street, the consensus analyst price target is about $358 -- slightly below its current price -- indicating that analysts may be worried about how much more upside could be left for Meta's stock this year.\nIf you've made a good profit on Meta Platforms over the past year, now may be a good time to consider selling the stock. At a near $1 trillion valuation, Meta looks overpriced given that its growth rate may be unsustainable; investors are currently paying a steep multiple which prices in a lot of future earnings growth, which is by no means a certainty.\nTo make matters worse, Meta also has a cash-burning metaverse segment, Reality Labs (it incurred operating losses totaling $11.5 billion over the first nine months of 2023), which could be a drag on its bottom line for years to come.\nIf Meta were to maintain a 20% growth rate or better for the long haul, the stock's price could prove to be justifiable. But I'm not optimistic that the company can continue to grow at such a high rate, which is why I believe long-term investors are better off looking elsewhere for good growth stocks to buy.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Meta Platforms wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 8, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nIs Meta Platforms Stock Still a Buy After Hitting a New 52-Week High? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-25T10:30:00.000Z",
        "Title": "Meta Platforms Stock Is 328% Off Its 2022 Low. Should Investors Sell?",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Sometimes, investing questions have no perfect answer. Shares of Meta Platforms (NASDAQ: META), the social media giant that owns Facebook, Instagram, and WhatsApp, have risen a staggering 328% since late 2022. Do investors who rode most of this exhilarating ride sell and take their profits?\nAt first glance, \"duh\" might be the correct answer. Gaining over 300% would take years in the broader stock market. There's nothing wrong with doing just that. However, there is a strong argument that Meta's stock still has some mojo left. Perhaps it can continue building on its epic run.\nLet's look at the evidence and see if investors have enough in hand to make the right call. There's also an alternative worth considering.\nWhat Meta Platforms has gone through over the past three years is a testament to the power and impact of market sentiment. From 2021 to late 2022, Wall Street began turning sour on the social media giant.\nWhy? CEO Mark Zuckerberg was spending tens of billions of dollars on his new Reality Labs segment. Meanwhile, iOS privacy updates hurt how effectively Meta's ads could work on Apple devices. The stock cratered from nearly $400 per share to under $90.\nAt the time, the news headlines and social media posts were saying things like, \"Mark Zuckerberg doesn't know what he's doing.\" The criticisms were being directed at the same guy who bought Instagram for $1 billion and turned it into something arguably worth more than 100 times that today.\nBut a funny thing happened. Meta began adapting to the iOS changes. Zuckerberg ordered up some cost-cutting to restore Meta's free cash flow and put growth back on track while balancing continued investments in Reality Labs and artificial intelligence (AI).\nJust about every long-term investor is going to face some adversity. Almost no company can grow for decades without some volatility, and maybe even a huge drop. Sometimes, these companies never get it together, but sometimes they do. Those who stick with it are rewarded handsomely.\nThe real takeaway for investors here? Look for broken stocks, not broken companies. Meta's core app business grew its user base through all the turmoil. That intact core cog in the Meta machine made its rebound as simple as Zuckerberg making the company more efficient last year.\nNow that Wall Street has realized that Meta's business isn't broken after all, analysts have returned to expecting roughly 20% annual earnings growth from the stock. Today, Meta trades at a forward P/E of 22, which means its resulting PEG ratio of 1.1 signals the stock is a good value for the growth you might get.\nBased on its fundamentals, the stock is still a good deal despite its share price soaring from $89 to nearly $400 in 15 months.\nIt's natural for people to think that since the stock blasted off, it must be expensive. It's the opposite of thinking a stock is cheap because the price keeps decreasing. Ultimately, it's a company's fundamentals, its underlying business performance, that tell investors whether a stock is attractive.\nIf you bought Meta Platforms in late 2022, you are sitting on substantial investment returns. Do you sell and cash out? Remember, stocks are volatile, so even though Meta's future still looks bright, that doesn't mean the market won't throw in a curveball and mess up your unrealized gains (they're paper profits until you sell).\nSelling some, but not all, of your Meta shares could be the best of both worlds. Suppose your investment grew from $1,000 to over $4,000 over the past 18 months. If you sell half, that's enough to double your money. Even if Meta collapsed and the other half went to zero, you still made out very well.\nLocking in some gains and leaving the rest ensures that you've had a successful investment while leaving room for upside if Meta continues to grow and compound more investment returns.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Meta Platforms wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 16, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Platforms Stock Is 328% Off Its 2022 Low. Should Investors Sell? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-20T21:50:00.000Z",
        "Title": "Meta Platforms Stock Rallied Nearly 200% Last Year -- Is It Too Late to Buy for 2024?",
        "Author": "  Nicholas Rossolillo, The Motley Fool ",
        "Text": "After an epic rally and nearly 200% gains in 2023, it may seem hard to believe that Meta Platforms (NASDAQ: META) had been all but left for dead by Wall Street in 2022. As 2024 gets underway, share prices of the parent company of Facebook, Instagram, WhatsApp, and the Quest virtual reality (VR) headsets are nearly back to all-time highs set during the pandemic.\nContrary to popular belief, Meta is far more than a social media business, nor is this company solely betting on the metaverse as its future (despite what the corporate name change a couple of years ago might have implied). Meta has a massive global data center network at its core, enabling millions of businesses -- especially small businesses -- to reach audiences. Don't write off the possibility Meta could have yet another great run in 2024.\nMeta is coming off of CEO Mark Zuckerberg's \"year of efficiency\" in which the company vowed to keep expenses in check after a pandemic-era spending spree. More on that in a moment, because one key to Meta stock's continued success in 2024 will be a resurgence in digital ad spending.\nWhen the company reports fourth-quarter 2023 earnings on Feb. 1, expect strong revenue growth to capture the spotlight. Management did forecast revenue to be $36.5 billion to $40 billion, implying as much as a 24% increase over Q4 2022. Meta is still lapping depressed results in 2022 from a falloff in peak-pandemic user activity and resulting digital spending on its apps, as well as the effects of Apple's privacy changes reducing Meta's ability to monetize ads on its fellow tech giant's devices.\nAdditionally, other companies involved in the digital advertising ecosystem -- like Adobe and Salesforce, both of which help with marketing analytics and ad distribution -- said that Black Friday, Cyber Monday, and holiday shopping in general hit fresh records in the final weeks of 2023. The two software giants reported mid- to high-single-digit percentage increases in online shopper spending versus 2022.\nMeta powers brand marketing for businesses all over the world -- owing to the incredible reach it offers with over 3.1 billion daily active users (as of the third quarter of 2023). Early indicators of strong consumer spending could mean great things for the social media company, which uses its data centers and new artificial intelligence (AI) algorithms to help marketers find an audience and realize sales.\nZuckerberg and company have indicated they have been pleased with renewed success in 2023, and that new modes of operating will continue into 2024 and beyond. That means not just revenue growth, but more profitable revenue growth.\nCutting back on expenses, paired with Meta's share repurchase program, have already done wonders. Earnings per share (EPS) in Q3 2023 were $4.39 -- a massive 168% increase from the same quarter in 2022, and a 36% increase over Q3 2021 (the pandemic EPS peak).\nA similar cadence of EPS increases is expected in Q4, and could perhaps continue into the new year. Thus, though Meta has an expensive-looking stock on a backward-looking basis (31 times trailing-12-month EPS, and 25 times trailing-12-month free cash flow), shares could actually be a value on a forward-looking basis (20 times Wall Street analysts' early estimate for 2024 EPS, and 21 times the estimate for 2024 free cash flow).\nIt doesn't look like it's too late to invest in Meta stock for the long term. The business is back on track with a focus on profitable growth, and its data centers and AI are unlocking healthy returns for marketing customers. Meta could be another standout winner in 2024.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Meta Platforms wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 8, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Nicholas Rossolillo and his clients have positions in Apple, Meta Platforms, and Salesforce. The Motley Fool has positions in and recommends Adobe, Apple, Meta Platforms, and Salesforce. The Motley Fool recommends the following options: long January 2024 $420 calls on Adobe and short January 2024 $430 calls on Adobe. The Motley Fool has a disclosure policy.\nMeta Platforms Stock Rallied Nearly 200% Last Year -- Is It Too Late to Buy for 2024? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-17T12:00:45.000Z",
        "Title": "When Should You Buy Meta Platforms, Inc. (NASDAQ:META)?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Meta Platforms, Inc. (NASDAQ:META) saw a significant share price rise of 27% in the past couple of months on the NASDAQGS. The company is now trading at yearly-high levels following the recent surge in its share price. With many analysts covering the large-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. However, could the stock still be trading at a relatively cheap price? Let’s take a look at Meta Platforms’s outlook and value based on the most recent financial data to see if the opportunity still exists.\n View our latest analysis for Meta Platforms \nGood news, investors! Meta Platforms is still a bargain right now. According to our valuation, the intrinsic value for the stock is $501.66, which is above what the market is valuing the company at the moment. This indicates a potential opportunity to buy low. What’s more interesting is that, Meta Platforms’s share price is quite volatile, which gives us more chances to buy since the share price could sink lower (or rise higher) in the future. This is based on its high beta, which is a good indicator for how much the stock moves relative to the rest of the market.\nFuture outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Buying a great company with a robust outlook at a cheap price is always a good investment, so let’s also take a look at the company's future expectations. Meta Platforms' earnings over the next few years are expected to increase by 89%, indicating a highly optimistic future ahead. This should lead to more robust cash flows, feeding into a higher share value.\nAre you a shareholder? Since META is currently undervalued, it may be a great time to increase your holdings in the stock. With a positive outlook on the horizon, it seems like this growth has not yet been fully factored into the share price. However, there are also other factors such as financial health to consider, which could explain the current undervaluation.\nAre you a potential investor? If you’ve been keeping an eye on META for a while, now might be the time to enter the stock. Its buoyant future outlook isn’t fully reflected in the current share price yet, which means it’s not too late to buy META. But before you make any investment decisions, consider other factors such as the strength of its balance sheet, in order to make a well-informed investment decision.\nKeep in mind, when it comes to analysing a stock it's worth noting the risks involved. For example - Meta Platforms has 1 warning sign we think you should be aware of.\nIf you are no longer interested in Meta Platforms, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-01T21:36:34.000Z",
        "Title": "Meta Platforms Inc (META) Reports Soaring Profits and Revenue Growth in Q4 and Full Year 2023",
        "Author": "  GuruFocus Research ",
        "Text": "Revenue Growth: Q4 revenue increased by 25% year-over-year to $40.11 billion; full-year revenue up 16% to $134.90 billion.\nNet Income Surge: Q4 net income soared by 201% to $14.02 billion; full-year net income jumped 69% to $39.10 billion.\nEarnings Per Share (EPS): Diluted EPS for Q4 was $5.33, marking a 203% increase; full-year EPS climbed 73% to $14.87.\nOperational Efficiency: Costs and expenses decreased by 8% in Q4; operational restructuring led to a leaner workforce and consolidated facilities.\nShare Repurchases: META repurchased $6.32 billion of Class A common stock in Q4; $20.03 billion for the full year.\nDividend Announcement: Board declared a cash dividend of $0.50 per share, payable on March 26, 2024.\nWarning! GuruFocus has detected 6 Warning Signs with META.\nOn February 1, 2024, Meta Platforms Inc (NASDAQ:META) released its 8-K filing, revealing a significant uptick in its financial performance for both the fourth quarter and the full year ended December 31, 2023. The company, known for its expansive social network ecosystem that includes Facebook, Instagram, Messenger, WhatsApp, and other services, has reported a substantial increase in revenue and net income, reflecting the company's focus on operational efficiency and growth in its advertising business.\nMeta's fourth-quarter revenue rose to $40.11 billion, a 25% increase compared to the same period in 2022. This growth was mirrored in the company's full-year revenue, which climbed 16% to $134.90 billion. The impressive revenue figures were bolstered by a 21% year-over-year increase in ad impressions delivered across the Family of Apps and a 2% increase in the average price per ad for Q4.\nNet income for the fourth quarter skyrocketed by 201% to $14.02 billion, while the full-year net income saw a 69% increase to $39.10 billion. Diluted EPS for the quarter was $5.33, up 203%, and $14.87 for the full year, up 73%. These figures reflect Meta's successful cost management strategies, including an 8% decrease in total costs and expenses for the quarter.\nOperational efficiency was a key theme in Meta's latest earnings report. The company's headcount decreased by 22% year-over-year, and it completed several restructuring initiatives, including data center and employee layoffs, as well as facilities consolidation. These measures contributed to the reduction in costs and expenses and were reflected in the company's improved operating margin, which stood at 41% for Q4 and 35% for the full year.\nDespite these achievements, Meta is not without its challenges. The company's CFO outlook commentary highlighted expectations of increased operating losses for Reality Labs, driven by product development efforts in augmented and virtual reality. Additionally, Meta is facing regulatory headwinds in the EU and the U.S., which could significantly impact its business operations and financial results.\nMeta's balance sheet remains robust, with cash, cash equivalents, and marketable securities totaling $65.40 billion as of December 31, 2023. The company's long-term debt stood at $18.39 billion. Free cash flow for the fourth quarter was reported at $11.50 billion, and $43.01 billion for the full year, indicating strong liquidity and financial health.\nThe company also announced a significant return of capital to shareholders through share repurchases and the initiation of a quarterly dividend. Meta repurchased $6.32 billion of its Class A common stock in the fourth quarter and $20.03 billion for the full year. Furthermore, the board declared a cash dividend of $0.50 per share, marking the company's commitment to delivering shareholder value.\nAs Meta Platforms Inc (NASDAQ:META) navigates the evolving digital landscape, its focus on AI and the metaverse, along with its operational discipline, positions the company for continued growth. However, investors and stakeholders will be closely monitoring how the company addresses its challenges, particularly in the regulatory space, and how it capitalizes on its opportunities in the coming year.\nFor a detailed analysis of Meta's financial performance and future outlook, investors are encouraged to review the full 8-K filing and stay tuned to GuruFocus.com for the latest financial news and expert insights.\nExplore the complete 8-K earnings release (here) from Meta Platforms Inc for further details.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-01-30T16:09:00.000Z",
        "Title": "Meta Platforms (META) to Report Q4 Earnings: What to Expect",
        "Author": "  Zacks Equity Research ",
        "Text": "Meta Platforms META is set to report its fourth-quarter 2023 results on Feb 1.The company expects total revenues between $36.5 billion and $40 billion for the fourth quarter of 2023. Favorable forex is expected to aid year-over-year top-line growth by roughly 2%.The Zacks Consensus Estimate for fourth-quarter revenues is pegged at $38.93 billion, indicating an increase of 21.02% from the year-ago quarter’s reported figure.The consensus mark for earnings stands at $4.84 per share, which has increased 0.83% over the past 30 days, suggesting growth of 61.33% from the figure reported in the year-ago quarter.Meta’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, the average surprise being 27.5%.\nMeta Platforms, Inc. price-eps-surprise | Meta Platforms, Inc. Quote\nLet’s see how things have shaped up for the upcoming announcement.\nMeta’s fourth-quarter top line is expected to have benefited from Facebook’s expanding user base (more than 3.049 billion daily active users) and growing adoption of reels. Increased engagement for Meta’s offerings like Instagram, WhatsApp, Messenger and Facebook has been a major growth driver.Effective usage of AI has been helping the company keep its users engaged. AI-driven feed recommendations have been a key catalyst.Reels have been a major growth driver for Instagram. The company stated that Reels has driven a more than 40% increase in time spent on Instagram since its launch. It remains focused on growing Reels as part of its overall portfolio of video services, which make up more than half of time spent on Facebook and Instagram.Higher engagement levels are helping to steady its user growth across all regions, particularly Asia Pacific.The Zacks Consensus Estimate for Asia Pacific Daily Active Users (DAUs) in the fourth quarter is pegged at 906 million, indicating 6.1% year-over-year growth. The consensus estimate for the Rest of World is expected to have increased 5.8% to 680 million DAUs.Regarding Monthly Active Users (MAUs), the Zacks Consensus Estimate for Asia Pacific is pegged at 1.361 billion, suggesting 2.9% year-over-year growth. The consensus mark for the Rest of World is expected to have risen 3.7% to 1.361 billion MAUs.The Zacks Consensus Estimate for Meta’s worldwide DAU is pegged at 2.093 billion, indicating 4.7% growth year over year. The consensus estimate for worldwide MAU is pegged at 3.061 billion, indicating a 3.3% year-over-year increase.Nevertheless, Meta’s top line is expected to reflect the negative impact of the challenging macroeconomic environment and high inflation that is anticipated to have kept ad spending budgets under pressure. This is likely to have weighed on ad revenues in the to-be-reported quarter.In the third quarter of 2023, Meta’s ad revenues represented 99.1% of total revenues, which increased 23.5% year over year to $33.64 billion.The Zacks Consensus Estimate for fourth-quarter 2023 ad revenues is pegged at $37.88 billion, indicating 21.2% year-over-year growth.\nPer the Zacks model, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat. That is the exact case here.Meta has an Earnings ESP of +0.51% and currently has a Zacks Rank #2. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\nHere are a few other companies worth considering, as our model shows that these, too, have the right combination of elements to beat on earnings in their upcoming releases:Shopify SHOP has an Earnings ESP of +1.02% and a Zacks Rank #1 at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Shopify is set to announce fourth-quarter 2023 results on Feb 13. SHOP’s shares have gained 23.6% in the past six months.Twilio TWLO has an Earnings ESP of +31.37% and a Zacks Rank #2 at present.Twilo is set to announce fourth-quarter 2023 results on Feb 14. TWLO’s shares have gained 13% in the past six months.Bill Holdings BILL has an Earnings ESP of +6.17% and a Zacks Rank #3.Bill Holdings is set to announce second-quarter fiscal 2024 results on Feb 8. BILL’s shares have declined 36.2% in the past six months.\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nShopify Inc. (SHOP) : Free Stock Analysis Report\nTwilio Inc. (TWLO) : Free Stock Analysis Report\nBILL Holdings, Inc. (BILL) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-01-17T03:44:03.000Z",
        "Title": "Meta Platforms Stock (NASDAQ:META): Don’t Ignore the Election Year Tailwind",
        "Author": "  TipRanks ",
        "Text": "Meta Platforms (NASDAQ:META) stock has experienced remarkable bullish momentum, rising by an impressive 177% in the past year. Despite undergoing such a tremendous rally, I expect sustained positive sentiment, especially with 2024 being an election year. With an anticipated uptick in ad spending this year, Meta, a giant in the advertising space, stands to reap significant benefits. Coupled with my view that shares appear reasonably valued, my outlook on META remains bullish.\nWith Meta surging by more than 174% over the past year, the stock is undeniably enjoying unstoppable momentum. In my view, several factors are powering this momentum, but the benefits from the 2024 elections have not been priced in yet, leaving plenty of room for upside.\nIn particular, I would attribute the ongoing stock price rally to a mix of FOMO and improving margins following last year’s cost-cutting initiatives. However, the stock seems cheap relative to Meta’s future earnings growth estimates. But let’s look at one thing at a time.\nLooking back to October 2022, only a year and a half ago, the sentiment surrounding Meta stock was quite different. At the time, shares dipped below $90 as the company grappled with perceived instability. Mark Zuckerberg was then attempting to justify Meta’s Reality Labs segment, incurring over $10 billion in annual losses, as a reasonable investment. The company’s attention had shifted entirely to the elusive “Metaverse.” And yet, the Metaverse demos at the time looked worse than Wii Sports released in 2006.\nInvestors, myself included, disapproved of this direction. We had a robust platform of lucrative apps, and instead of focusing on monetization, cost efficiency, and returning capital to shareholders, Zuckerberg redirected the ship toward the unknown. Fortunately, Meta’s management swiftly responded to investors’ concerns, gradually becoming quieter on the Metaverse and starting to focus on implementing cost-cutting measures, including a 13% reduction in the workforce in late 2022.\nThis caused a rapid shift from an ultra-bearish sentiment to an ultra-bullish one, leading to Meta’s swift rally. Such a sudden shift in sentiment likely left many investors behind. Thus, I believe the ongoing momentum continues to be propelled by FOMO.\nBut while some may argue that this FOMO may have led to the stock being overvalued, I think otherwise. In fact, shares remain attractively priced considering Meta’s future growth estimates – especially in the face of upcoming election-related spending. Let’s take a deeper look.\nThe impending U.S. elections should serve as a substantial tailwind for the advertising industry, with industry giants like Meta poised to capitalize significantly. To provide context, in the 2019-2020 election cycle, total political advertising spending reached a staggering $8.5 billion across all mediums, with political digital advertising witnessing a remarkable 4.6x increase from 2018 to 2020.\nResearch stemming from the previous election cycle underscores Facebook’s 12-fold cost-effectiveness compared to TV in less efficient geographical zones. Also, a February 2021 Wesleyan study revealed that over 10 times as many state legislative candidates opted to advertise on Facebook than on television, primarily attributing this choice to the cost-advantaged tradeoff.\nWith politicians increasingly convinced of the effectiveness of digital ad spend, the current election cycle is poised to lead to a substantial surge in political ad spending.\nReuters reports a projected 30% increase in political ad spending in the U.S. this year compared to the last presidential election in 2020, primarily driven by higher expenditures on digital platforms. While TV remains the dominant recipient of ad spending, digital platforms are expected to see the most significant growth in political ads, with revenues forecasted to surge by 156% from 2020 to $3.46 billion in 2024.\nWall Street analysts seem to be catching up to this reality. Last year, the market anticipated Meta to achieve revenues of approximately $137 billion in Fiscal 2024. This figure has since risen to nearly $151 billion, and given the ongoing trajectory of earnings estimate revisions, there is a strong likelihood that this figure will continue to ascend.\nIn the interim, consensus estimates suggest that Meta will post EPS of $17.43 next year. Notably, Wall Street estimates have historically been conservative, with Meta often exceeding expectations by a wide margin. Even if we adopt Wall Street’s estimate, though, Meta’s current valuation stands at a modest 21 times next year’s EPS.\nI believe that this forward P/E is cheap, given the company’s substantial market dominance, consistent double-digit growth, and management’s strategic focus on bolstering profits. Consequently, in spite of Meta’s considerable rally in recent quarters, the combination of relatively subdued forward estimates and a soft valuation should continue to support the ongoing positive momentum.\nRegarding Wall Street’s sentiment on the stock, Meta Platforms retains a Strong Buy consensus rating based on 36 Buys and two Holds assigned in the past three months. At $397.31, the average META stock price target suggests 8.1% upside potential.\nIf you’re wondering which analyst you should follow if you want to buy and sell META stock, the most profitable analyst covering the stock (on a one-year timeframe) is Brad Erickson from RBC Capital, with an average return of 58.54% per rating and a 76% success rate. Click on the image below to learn more.\nMeta Platforms’ crazy surge in the past year reflects its invincible momentum driven by factors like FOMO and improving margins. However, as the 2024 election year approaches, the anticipated uptick in political ad spending positions Meta for further gains.\nReflecting on Meta’s transformative journey from a Metaverse-centric focus to a profit-driven strategy, the current valuation also appears attractive. With a notable increase in political ad spending that only gradually appears priced in by Wall Street estimates, Meta’s ongoing positive momentum seems poised for sustained growth.\nDisclosure\n"
    },
    {
        "Date": "2024-01-04T19:01:26.000Z",
        "Title": "Meta Platforms: A Tale of Resilience and Recovery",
        "Author": "  Hung Tran ",
        "Text": "The share price of Meta Platforms Inc. (NASDAQ:META) has undergone significant volatility, as evidenced by its dramatic fluctuations. In September 2021, the share price stood at $379 per share, but by October 2022, it had plummeted to nearly $92. However, there has been a robust recovery since then, with the price settling around $358 per share at the time of writing. This remarkable turnaround has resulted in year-to-date gains of 180% for Meta. Let's take a closer look to determine whether the stock is attractive to investors at the current price.\nWarning! GuruFocus has detected 6 Warning Signs with META.\nMeta Platforms, formerly known as Facebook, underwent a significant rebranding in October 2021. The company's original core application, Facebook, was a primary driver of user engagement, revenue and profitability. The rebranding to Meta, which hints at the concept of the \"Metaverse,\" reflects the company's future direction. With a mission \"to give people the power to build community and bring the world closer together,\" the social meadia giant aims to make the metaverse a reality through its diverse product offerings. The company operates through two main business segments: the Family of Apps (FoA) and Reality Labs (RL).\nIn 2022, the FoA segment, which includes popular apps like Facebook, Instagram, Messenger and WhatsApp, was a major revenue generator. It brought in nearly $114.5 billion, accounting for 98.2% of Meta's total revenue. This segment primarily earns through selling advertising placements to marketers. On the other hand, the RL segment, focused on virtual and augmented reality technologies, contributed significantly less, with revenue of only $2.16 billion, less than 2% of the total sales.\nThe FoA segment is highly profitable, generating $42.66 billion in operating income with an impressive operating margin of 37%. In contrast, the RL segment recorded $13.7 billion in losses. Meta has been leveraging the profitability of the FoA segment to support and develop the RL segment, aligning with its broader vision for the metaverse.\nOver the past decade, Meta has demonstrated consistently high revenue growth. In 2012, its revenue stood at $5 billion, soaring to nearly $118 billion by 2021, before slightly declining to $116.6 billion in 2022. The annual growth rate between 2012 and 2021 varied from 21.6% to 58.4%. However, in 2022, there was a 1.1% decrease in sales, partly attributed to the appreciation of the U.S. dollar. Nonetheless, on a constant currency basis, sales growth was 4% in 2022. This slowdown in sales growth mainly resulted from a global reduction in advertising spending, influenced by a sluggish global economy and rising interest rates. Additionally, challenges arose from Apple's (NASDAQ:AAPL) \"app tracking transparency\" feature, which allows users to prevent apps from tracking their activities across devices.\nIn 2022, Meta's operating income plummeted by 38% to nearly $29 billion. This significant drop was not only due to sluggish sales growth, but also an increase in payroll and expenses related to a 20% increase in employee headcount.\nSince late 2022 and into early 2023, Meta initiated restructuring efforts to enhance its operating performance. This involved three rounds of restructuring and layoffs, particularly in recruiting and technical departments, resulting in over 20,000 job cuts. By the second quarter of 2023, Meta's workforce had been reduced to approximately 66,100 employees, a 7% decrease from the previous quarter. The 2022 restructuring led to a leaner organization and improved operating margins. Meta also leveraged artificial intelligence to boost product and business performance. AI-driven feed recommendations significantly increased user engagement, leading to a 7% rise in time spent on Facebook and a 6% increase on Instagram. Furthermore, Meta's Advantage+ Shopping Campaigns achieved a $10 billion run rate, with over 50% of advertisers utilizing the Advantage+Creative tool for ad optimization.\nAs a result of these restructuring efforts and initiatives, Meta's financial performance in the first three quarters of 2023 improved significantly. Revenue grew by 23% to $34.15 billion and operating profit surged by 145% to $13.75 billion. Consequently, the operating margin expanded remarkably from nearly 19.9% in the fourth quarter of 2022 to 40.36% in the third quarter of 2023.\nMeta possesses a robust balance sheet, characterized by effective leverage management. As of September, the company held approximately $36.9 billion in cash and cash equivalents, along with $24.2 billion in marketable securities, including U.S. government and corporate debt instruments. Its long-term debt was relatively modest at $18.4 billion. This debt comprises fixed-rate senior unsecured notes, issued in August 2022 and May 2023, at favorable interest rates. The interest rates on these notesvaried from 3.50% to 5.75%. Furthermore, the maturity dates of these debts are spread out, ranging from 2027 to as far out as 2063. The principal payments for these debts are staggered, each ranging from $1 billion to a maximum of $3 billion.\nOver the last 10 years, Meta has consistently increased its earnings per share, starting from a mere 1 cents in 2012, escalating to a peak of $13.77 in 2021 and then settling at $8.59 in 2022. Following its recent restructuring and the implementation of AI-driven initiatives, which have significantly improved its operating margin, the company is projected to achieve increased revenue and earnings per share in 2024. For 2024, it is estimated that Meta will generate approximately $150.7 billion in revenue and earnings of $17.39 per share. Over the last five years, Meta's price-earnings ratio has fluctuated between 8.65 and 37.90. Using the five-year average price-earnings ratio of 25.50, the estimated value of Meta's shares is around $443, which is nearly 24% higher than its current trading price.\nMeta Platforms' financial journey is a testament to resilience and strategic foresight in a volatile market. Despite the challenges posed by global economic shifts and technological disruptions, the company's effective restructuring, particularly in 2023, and its commitment to innovation have catalyzed a significant turnaround. The company has a strong balance sheet, a focused approach to debt management and promising projections for revenue and earnings growth. The current market valuation of Meta's stock, while robust, suggests it is undervalued.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-02T00:47:32.000Z",
        "Title": "Mark Zuckerberg explained how Meta will crush Google and Microsoft at AI—and Meta warned it could cost more than $30 billion a year",
        "Author": "  Alexandra Sternlicht ",
        "Text": "Mark Zuckerberg laid out Meta's gameplan for \"playing to win\" against Alphabet and Microsoft in the high-stakes AI arms race. Meta's secret weapon: its walled garden of data.\n\"There are hundreds of billions of publicly shared images and tens of billions of public videos, which we estimate is greater than the common crawl data set,” Zuckerberg said on Meta’s earnings call on Thursday. It was a not-so-subtle jab at competitors Google, Microsoft and OpenAI, which are training their AI models on the public web data crawled by their search engines every day.\nBeyond the generative AI technology that Meta already offers in its battle against the other Big Tech powers (including Apple, which teased on its earnings call Thursday that it would launch a generative AI product later this year), Zuckerberg is aiming for “general intelligence,” the still unproven concept of a general purpose AI that can handle most tasks better than humans.\n“We’ll be building the most popular and advanced AI products and services. If we succeed, everyone who uses our services will have a world-class AI assistant to help get things done,” Zuckerberg said, even as his management team hinted at the hefty price tag of carrying out the project. Meta’s capital expenditures could increase by as much as $9 billion this year, totalling between $30 billion to $37 billion, compared to $28.1 billion in 2023.\nAnd the company suggested this could be the new normal, noting that “we expect our ambitious long-term AI research and product development efforts will require growing infrastructure investments beyond this year.”\nIt’s probably no coincidence that Meta announced its first ever cash dividend to investors on Thursday. The new, 50-cent quarterly dividend, along with strong results in Meta’s core advertising business, ignited Meta’s stock, which shot up 14.5% in after hours trading.\nZuckerberg initially unveiled his vision for artificial general intelligence last month in an Instagram Reels video. On Thursday, he expanded on the plan, describing it as not just a far-off science project, but an effort that will incorporate AGI into Meta products like Facebook, Instagram, and Whatsapp.\n“It's clear that we're going to need our models to be able to reason, plan code, remember, and many other cognitive abilities in order to provide the best versions of the services that we envision,” he said. “We’re playing to win here, and I expect us to continue investing aggressively in this area.”\nTo realize his vision of Meta as the AI leader, Zuckerberg has yet to expand on how exactly Meta user activity will be used as training data for Meta’s AI, and how the company will navigate the potential issues around user privacy.\nAnd it remains to be seen whether Zuckerberg’s confidence in the value of Meta’s training data compared to the vast corpus of web data used by Google is as big of an advantage as he believes. Google has the data treasure trove of YouTube, Google Office and its search engine. Still, Google AI is close-sourced so can only move as fast as engineering talent, whereas Zuckerberg pointed to his company’s open source Llama model as another key advantage.\nEarnings aside, this has been a big week for Meta’s head honcho. Yesterday Zuckerberg was skewered during a U.S. Senate hearing where he, most notably, stood up and apologized to families whose children died from harms inflicted by social media. (Though he did not agree to compensate the families for the harms they suffered at Senator Hawley’s request.)\nWhile the apology may have been wrenching for Zuckerberg, his net worth rose by $1.6 billion (per Forbes) on Thursday with Meta’s stock performance.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-01-25T12:00:25.000Z",
        "Title": "Meta Platforms (NASDAQ:META) Seems To Use Debt Rather Sparingly",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of permanent loss is the risk I worry about... and every practical investor I know worries about.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We note that Meta Platforms, Inc. (NASDAQ:META) does have debt on its balance sheet. But the more important question is: how much risk is that debt creating?\nGenerally speaking, debt only becomes a real problem when a company can't easily pay it off, either by raising capital or with its own cash flow. If things get really bad, the lenders can take control of the business. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n See our latest analysis for Meta Platforms \nYou can click the graphic below for the historical numbers, but it shows that as of September 2023 Meta Platforms had US$18.4b of debt, an increase on US$9.92b, over one year. However, its balance sheet shows it holds US$61.1b in cash, so it actually has US$42.7b net cash.\nAccording to the last reported balance sheet, Meta Platforms had liabilities of US$30.5b due within 12 months, and liabilities of US$42.9b due beyond 12 months. Offsetting this, it had US$61.1b in cash and US$12.9b in receivables that were due within 12 months. So its total liabilities are just about perfectly matched by its shorter-term, liquid assets.\nHaving regard to Meta Platforms' size, it seems that its liquid assets are well balanced with its total liabilities. So it's very unlikely that the US$989.9b company is short on cash, but still worth keeping an eye on the balance sheet. Simply put, the fact that Meta Platforms has more cash than debt is arguably a good indication that it can manage its debt safely.\nAlso positive, Meta Platforms grew its EBIT by 24% in the last year, and that should make it easier to pay down debt, going forward. The balance sheet is clearly the area to focus on when you are analysing debt. But it is future earnings, more than anything, that will determine Meta Platforms's ability to maintain a healthy balance sheet going forward. So if you're focused on the future you can check out this free report showing analyst profit forecasts.\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. While Meta Platforms has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance. Over the most recent three years, Meta Platforms recorded free cash flow worth 79% of its EBIT, which is around normal, given free cash flow excludes interest and tax. This free cash flow puts the company in a good position to pay down debt, when appropriate.\nWhile it is always sensible to investigate a company's debt, in this case Meta Platforms has US$42.7b in net cash and a decent-looking balance sheet. And it impressed us with free cash flow of US$38b, being 79% of its EBIT. So we don't think Meta Platforms's use of debt is risky. There's no doubt that we learn most about debt from the balance sheet. But ultimately, every company can contain risks that exist outside of the balance sheet.   We've identified 1 warning sign  with Meta Platforms , and understanding them should be part of your investment process.\nWhen all is said and done, sometimes its easier to focus on companies that don't even need debt. Readers can access a list of growth stocks with zero net debt 100% free, right now.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-01-29T07:59:30.000Z",
        "Title": "Meta Platforms (META) Delivered 194% Return in 2023",
        "Author": "  Soumya Eswaran ",
        "Text": "Moon Capital Management, an investment management company, released its fourth-quarter 2023 investor letter. A copy of the same can be downloaded here. A year ago, a majority of the economists at 23 large financial institutions that conduct business with the Federal Reserve predicted an upcoming recession in the U.S. for 2023, indicating a challenging period ahead. Instead in 2023, the U.S. economy grew by over 3%, and the U.S. stock market had returns ranging from 14% to 24%. Moon Capital’s portfolio equaled the S&P 500’s 24% return. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nMoon Capital featured stocks such as Meta Platforms, Inc. (NASDAQ:META) in the fourth quarter 2023 investor letter. Headquartered in Menlo Park, California, Meta Platforms, Inc. (NASDAQ:META) is a technology company that develops products to connect people. On January 26, 2024, Meta Platforms, Inc. (NASDAQ:META) stock closed at $394.14 per share. One-month return of Meta Platforms, Inc. (NASDAQ:META) was 11.35%, and its shares gained 168.01% of their value over the last 52 weeks. Meta Platforms, Inc. (NASDAQ:META) has a market capitalization of $1.013 trillion.\nMoon Capital stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its fourth quarter 2023 investor letter:\n\"Meta Platforms, Inc. (NASDAQ:META), holding company for Facebook, Instagram and other addictive social media properties) was another security that many deemed unownable in early 2023. Facebook earns massive amounts of advertising revenue, too much of which we believed the company was wasting on very expensive, non-core projects. Apparently, someone at Meta HQ finally agreed, as the company began exhibiting serious expense discipline, resulting in improved earnings – as well as a 194% return on the stock for the year.\"\nPhoto by Alexander Shatov on Unsplash\nMeta Platforms, Inc. (NASDAQ:META) is in third position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 234 hedge fund portfolios held Meta Platforms, Inc. (NASDAQ:META) at the end of third quarter which was 225 in the previous quarter.\nWe discussed Meta Platforms, Inc. (NASDAQ:META) in another article and shared best tech stocks for the next 5 years. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n12 Best Foreign Dividend Stocks To Invest In\n25 Best Dividend Growth Stocks to Buy and Hold in 2024\n15 Most Powerful Countries in Africa in 2024\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-01-22T17:00:00.000Z",
        "Title": "Meta at Record-High: What Lies Ahead of ETFs?",
        "Author": "  Sanghamitra Saha ",
        "Text": "Meta's (META) stock price has fully rebounded from its tumultuous year in 2022, as it inched up almost 2% on Friday to close at $383.45, setting a new record. This impressive rally came on the heels of an almost 170% jump in the past year, signaling investors' satisfaction with CEO Mark Zuckerberg's cost-cutting efforts in 2023, which led to the elimination of over 20,000 jobs.\nAfter a disastrous 2022 that saw Meta's stock plunge by 64% to its lowest point since 2016, CEO Mark Zuckerberg presented 2023 as a \"year of efficiency,\" as quoted on CNBC. His strategic initiatives seem to have paid off, contributing to the remarkable recovery in the company's stock price.\nThis has put focus on Meta-heavy ETFs like Communication Services Select Sector SPDR Fund XLC, Fidelity MSCI Communication Services Index ETF FCOM, Vanguard Communication Services ETF VOX and iShares Global Comm Services ETF IXP. These ETFs put about 20%-25% focus on Meta stock.\nWhile Meta's share price has reached a new high, its market capitalization remains below its peak in September 2021, which was near $1.1 trillion. This disparity is due to the company's substantial share buybacks, which have reduced the number of outstanding shares. The current market cap is still below $1 trillion.\nInvestors are increasingly bullish on Meta's position in the thriving artificial intelligence market. Mark Zuckerberg recently hinted at the company's ambitious plans by stating that Meta will acquire 350,000 Nvidia H100 graphics cards by the end of the year, along with \"almost 600k H100 equivalents of compute\" when considering other GPUs. This significant investment underscores Meta's commitment to advancing its AI ambitions.\nMeta is set to report its fourth-quarter earnings on February 1. Meta has an Earnings ESP of +1.46% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\nThe Zacks Consensus Estimate for the fourth quarter indicates a 60% year-over-year uptick in earnings and revenue growth of 20.7%. The earnings track record of the company is upbeat. It delivered a four-quarter average earnings surprise of 27.50% with earnings beat noticed in every quarter.\nBased on short-term price targets offered by 38 analysts, the average price target for Meta Platforms comes to $392.68. The forecasts range from a low of $285.00 to a high of $470.00. The average price target represents an increase of 4.4% from the last closing price of $376.13.\nMeta Platforms currently has an average brokerage recommendation (ABR) of 1.30 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 43 brokerage firms. The current ABR compares to an ABR of 1.17 a month ago based on 40 recommendations.\nOf the 43 recommendations deriving the current ABR, 37 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 86.05% and 2.33% of all recommendations. A month ago, Strong Buy made up 92.5%, while Buy represented 2.5%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nVanguard Communication Services ETF (VOX): ETF Research Reports\nFidelity MSCI Communication Services Index ETF (FCOM): ETF Research Reports\niShares Global Comm Services ETF (IXP): ETF Research Reports\nCommunication Services Select Sector SPDR ETF (XLC): ETF Research Reports\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-01-29T09:17:39.000Z",
        "Title": "Should You Hold Meta Platforms (META) for the Long Term?",
        "Author": "  Soumya Eswaran ",
        "Text": "Rowan Street Capital, an investment management company, released its 2023 investor letter. A copy of the same can be downloaded here. The year 2023 proved to be a successful one for the fund as it recorded a net gain of +102.6%. In 2023, Meta Platforms (+194%), Spotify (+138%), Trade Desk (+60%), and Shopify (+124%) were the main contributors to the outperformance. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nRowan Street Capital featured stocks such as Meta Platforms, Inc. (NASDAQ:META) in its 2023 annual investor letter. Headquartered in Menlo Park, California, Meta Platforms, Inc. (NASDAQ:META) is a technology company that develops products to connect people. On January 26, 2024, Meta Platforms, Inc. (NASDAQ:META) stock closed at $394.14 per share. One-month return of Meta Platforms, Inc. (NASDAQ:META) was 11.35%, and its shares gained 168.01% of their value over the last 52 weeks. Meta Platforms, Inc. (NASDAQ:META) has a market capitalization of $1.013 trillion.\nRowan Street Capital stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its 2023 annual investor letter:\n\"Meta Platforms, Inc. (NASDAQ:META) has become our largest position in the fund, up +268% in just 14 months, aging very well from our November 2022 note. We gave a re-cap of this extraordinary move in our last letter in November and we encourage you to review. Our investment in Meta makes a great case to study. We first invested in the stock in 2018 and we just recently doubled our money on this investment in 2023. It took exactly 5 years and provided a very decent return of 15% per annum, however it hasn’t exactly been a smooth ride. Please take a look at the chart below:\nCopyright: rvlsoft / 123RF Stock Photo\nMeta Platforms, Inc. (NASDAQ:META) is in third position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 234 hedge fund portfolios held Meta Platforms, Inc. (NASDAQ:META) at the end of third quarter which was 225 in the previous quarter.\nWe discussed Meta Platforms, Inc. (NASDAQ:META) in another article and shared best tech stocks for the next 5 years. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\nSuggested Articles:\n30 Highest Paying Part-Time Jobs for 18 Year Olds\n25 States with Highest Average Salary in America\nTop 19 Industries That Are Hiring Right Now\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-02-02T01:05:55.000Z",
        "Title": "Facebook parent Meta declares first dividend, shares soar",
        "Author": "  Katie Paul and Yuvraj Malik ",
        "Text": "By Katie Paul and Yuvraj Malik\n(Reuters) -Meta Platforms issued its first dividend days ahead of flagship social network Facebook's 20th anniversary, while reporting revenue and profit that beat expectations on robust ad sales in the holiday shopping period.\nShares soared more than 14% after the bell, pushing the company's stock market valuation up by more than $140 billion and extending a long recovery that saw Meta hit record highs in recent weeks for the first time in more than two years.\nThe after-hours gains alone amounted to more than quintuple the entire value of social media rival Snap Inc.\nMeta, one of the tech sector's original unicorns, said its dividend would be 50 cents per share. It also announced it had authorized an additional $50 billion in share repurchases.\nThe social media giant is the first of its generation of internet juggernauts to issue a dividend, a milestone for a tech sector that has been dominated by the same handful of companies for well over a decade.\nFounded in a college dorm room in 2004, it has grown into the world's biggest social media company, connecting more than 3 billion people and revolutionizing how they discover trends, communicate with their neighbors and engage with politics.\nThe company, which owns Instagram and WhatsApp, has also been accused of ignoring a multitude of harms on its path to growth, including violations of user privacy and incitements to violence.\nJust a day before announcing results, CEO Mark Zuckerberg was called to testify before the U.S. Senate about child safety online and compelled to apologize to parents of children who had experienced sexual abuses.\n\"You're never as good as they say when you're up, or as bad as they say when you're down. Just keep building and doing good work over long periods of time,\" he said on Thursday in a post on another Meta-owned app, Threads.\nIMPRESSIVE QUARTER\nShares of Meta have steadily been climbing back this past year from a meltdown in 2022 that wiped out more than three-quarters of their one-time value, buoyed by investor excitement about artificial intelligence.\nIts recovery has also been aided by a rebound in user growth and digital ad sales, as well as an austerity drive that saw it shed more than 21,000 employees since late 2022.\nRevenue for the fourth quarter rose 25% to $40.1 billion, above the $39.2 billion analysts were expecting, according to LSEG data.\nNet income rose more than 200% to $14 billion, or $5.33 per share, exceeding expectations of $4.97 per share, according to LSEG data.\n\"This was one of the most impressive quarters – intrinsically and vs. expectations,\" said Evercore ISI analyst Mark Mahaney.\nMeta forecast first quarter revenue of $34.5 billion to $37 billion, above Wall Street expectations of $33.8 billion. It said it expects full-year 2024 total expenses to be unchanged at $94 billion to $99 billion.\nThose results came after fellow digital ads heavyweight Alphabet posted holiday season advertising sales that came in below expectations.\nMORE METAVERSE, AI INVESTMENTS\nImprovements to the social media business have made investors more tolerant of Meta's undiminished spending, as it pours billions of dollars into \"metaverse\" technologies and building out its artificial intelligence infrastructure.\nOn Thursday executives doubled down on aggressive investments in both areas.\nThe company's metaversee-oriented Reality Labs unit handily beat revenue expectations for the fourth quarter, posting record sales of $1.1 billion from \"strong sales\" of its Quest device over the holiday season, Zuckerberg told analysts after the report. Investors had been expecting $804 million, according to LSEG data.\nMeta said it still expected operating losses for Reality Labs to \"increase meaningfully\" as it invests more in augmented and virtual reality in 2024.\nWhile interactive and immersive experiences via those technologies remain the ultimate goal, Zuckerberg said the latest version of its Ray-Ban smart glasses, with a built-in AI assistant, has been an early surprise hit with consumers too.\n\"We thought we would have to build full displays and holograms\" before the smart glasses would become mainstream, he said. \"And now it's quite possible that ... AI assistants built in will be the killer app.\"\nStill, though improving, Reality Labs sales remain a tiny 2.7% slice of the company's total revenue.\n\"Meta ended 2023 on an extremely strong note, with revenue soaring above analyst expectations,\" said Debra Aho Williamson, an independent tech analyst and former principal analyst at eMarketer.\n\"The company can talk all it wants to about AI and the metaverse, but it's still a social media company that gets nearly all its revenue from advertising, and advertisers still clearly love Meta.\"\n(Reporting by Katie Paul in New York and Yuvraj Malik in Bengaluru; Additional reporting by Sheila Dang in Austin and Noel Randewich in San Francisco; Editing by Kenneth Li and Stephen Coates)\n"
    },
    {
        "Date": "2024-02-01T16:19:45.000Z",
        "Title": "Meta to deploy in-house custom chips this year to power AI drive",
        "Author": "  Katie Paul ",
        "Text": "By Katie Paul, Stephen Nellis and Max A. Cherney\n(Reuters) - Facebook owner Meta Platforms plans to deploy into its data centers this year a new version of a custom chip aimed at supporting its artificial intelligence (AI) push, according to an internal company document seen by Reuters on Thursday.\nThe chip, a second generation of an in-house silicon line Meta announced last year, could help to reduce Meta's dependence on the Nvidia chips that dominate the market and control the spiraling costs associated with running AI workloads as it races to launch AI products.\nThe world's biggest social media company has been scrambling to boost its computing capacity for the power-hungry generative AI products it is pushing into apps Facebook, Instagram and WhatsApp and hardware devices like its Ray-Ban smartglasses, spending billions of dollars to amass arsenals of specialized chips and reconfigure data centers to accommodate them.\nAt the scale at which Meta operates, a successful deployment of its own chip could potentially shave off hundreds of millions of dollars in annual energy costs and billions in chip purchasing costs, according to Dylan Patel, founder of the silicon research group SemiAnalysis.\nThe chips, infrastructure and energy required to run AI applications has become a giant sinkhole of investment for tech companies, to some degree offsetting gains made in the rush of excitement around the technology.\nA Meta spokesperson confirmed the plan to put the updated chip into production in 2024, saying it would work in coordination with the hundreds of thousands of off-the-shelf graphics processing units (GPUs) - the go-to chips for AI - the company was buying.\n\"We see our internally developed accelerators to be highly complementary to commercially available GPUs in delivering the optimal mix of performance and efficiency on Meta-specific workloads,\" the spokesperson said in a statement.\nMeta CEO Mark Zuckerberg last month said the company planned to have by the end of the year roughly 350,000 flagship \"H100\" processors from Nvidia, which produces the most sought-after GPUs used for AI. Combined with other suppliers, Meta would accumulate the equivalent compute capacity of 600,000 H100s in total, he said.\nThe deployment of its own chip as part of that plan is a positive turn for Meta's in-house AI silicon project, after a decision by executives in 2022 to pull the plug on the chip's first iteration.\nThe company instead opted to buy billions of dollars worth of Nvidia's GPUs, which have a near monopoly on an AI process called training that involves feeding enormous data sets into models to teach them how to perform tasks.\nThe new chip, referred to internally as \"Artemis,\" like its predecessor can perform only a process known as inference in which the models are called on to use their algorithms to make ranking judgments and generate responses to user prompts.\nReuters last year reported that Meta is also working on a more ambitious chip that, like GPUs, would be capable of performing both training and inference.\nThe Menlo Park, California-based company shared details about the first generation of its Meta Training and Inference Accelerator (MTIA) program last year. The announcement portrayed that version of the chip as a learning opportunity.\nDespite those early stumbles, an inference chip could be considerably more efficient at crunching Meta's recommendation models than the energy thirsty Nvidia processors, according to Patel.\n\"There is a lot of money and power being spent that could be saved,\" he said.\n(Reporting by Katie Paul in New York and Stephen Nellis and Max A. Cherney in San Francisco; Editing by Kenneth Li and Mark Porter)\n"
    },
    {
        "Date": "2024-01-04T17:17:45.000Z",
        "Title": "Zuckerberg Sold Nearly Half a Billion Dollars of Meta Stock In Last Two Months",
        "Author": "  Rachel Phua ",
        "Text": "(Bloomberg) -- Mark Zuckerberg sold nearly half a billion dollars of Meta Platforms Inc. shares in the final two months of 2023 after a two-year hiatus in which the company’s stock price hit its lowest in seven years.\nMost Read from Bloomberg\nIPhone Survives 16,000-Foot Fall, Helps Steer Jet-Panel Hunt\nChinese Billionaire Is Second-Biggest Foreign Owner of US Land\nUS and Allies Met Secretly With Ukraine on Peace Plan\nXi, Biden and the $10 Trillion Cost of War Over Taiwan\nStocks Waver After Tech-Led Bounce; Oil Rebounds: Markets Wrap\nThe Meta chief executive sold shares on every trading day between Nov. 1 and the end of the year, unloading nearly 1.28 million shares for about $428 million, according to a Tuesday regulatory filing.\nOn average, each sale took in $10.4 million, with the largest on Dec. 28 at $17.1 million.\nBefore this period, Zuckerberg had not sold Meta shares since November 2021. The company’s share price rebounded 194% last year from a seven-year low near the end of 2022. Meta shares outperformed those of every other major tech giant except Nvidia Corp. last year and is now near its September 2021 record high.\nZuckerberg, 39, owns about 13% of Meta and has a net worth of about $125 billion, according to the Bloomberg Billionaires Index, making him the seventh-richest person in the world.\nZuckerberg primarily sells Meta shares to fund philanthropic initiatives, according to company spokesperson. He has pledged to give away 99% of his stake to charitable purposes.\nMarc Benioff, Zuckerberg’s peer in the tech world, also sold shares nearly every day in the second half of 2023. The Salesforce Inc. co-founder unloaded more than $475 million worth of shares during the period, selling about 15,000 shares — about $3 million — every day.\n(Updates with Meta’s response in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nTropical Underworld: The Murder Case That Could Topple an Alleged Crime Empire\nPrivate Equity’s Horrible, No-Good ’23 Set to Continue Into ’24\nCan Biden Convince Americans His Brand of Populism Is Better Than Trump’s?\nIs There Any Hope for Hollywood?\nWhy ‘Dad’ Should Not Be Part of Your Professional Vocabulary\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-02T00:10:04.000Z",
        "Title": "Zuckerberg to Get $700 Million a Year From Meta’s New Dividend",
        "Author": "  Alex Barinka and Jack Witzig ",
        "Text": "(Bloomberg) — Meta Platforms Inc. Chief Executive Officer Mark Zuckerberg stands to receive a payout of about $700 million a year from the social media giant’s first-ever dividend for investors.\nMost Read from Bloomberg\nDonald Trump Loses London Case Against Ex-MI6 Spy Over Kremlin Dossier\nA $560 Billion Property Warning Hits Banks From NY to Tokyo\nQQQ Up in Late Trading as Meta Soars, Apple Falls: Markets Wrap\nApple’s China Slump Deepens Even as Total Sales Grow Again\nLewis Hamilton to Join Ferrari F1 Team in 2025, Leaving Mercedes\nMeta announced a quarterly cash dividend of 50 cents a share for Class A and B common stock beginning in March. With Zuckerberg holding about 350 million shares, he would take home about $175 million in each quarterly payment before taxes, according to data compiled by Bloomberg.\nMeta’s move to pay a dividend sends a signal about the company’s view of its growth potential. Often, faster-growing tech companies eschew dividends in favor of using earnings to develop new products or make expensive acquisitions. While Meta is spending big on artificial intelligence initiatives, its acquisition prospects are dwindling in the face of regulatory opposition.\nAfter Meta fired about 21,000 people and narrowed its priorities, the stock almost tripled in 2023. The new dividend and an additional $50 billion in share buybacks may win more patience from investors with Zuckerberg’s long-term bets on artificial intelligence and the metaverse.\nZuckerberg took home $27.1 million in total compensation in 2022, including private security costs and a base salary of $1, according to filings. Meta hasn’t yet reported executive compensation for last year.\nA spokesperson for the company declined to comment.\nMost Read from Bloomberg Businessweek\nElon Musk May Have Lost More Than a $55 Billion Payday\nChinese Students Abroad Struggle With Tuition as Economy Falters\nAI Is Helping Pick What You’ll Wear in Two Years\nAI Can Speed Drug Discovery. But Is It Really Better Than a Human?\nThere’s So Much Data Even Spies Are Struggling to Find Secrets\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-01T23:02:28.000Z",
        "Title": "Meta Plans $50 Billion Buyback in Bid to Win Over Investors",
        "Author": "  Alex Barinka ",
        "Text": "(Bloomberg) -- Meta Platforms Inc. announced plans to buy back an additional $50 billion in shares and issue its first-ever quarterly dividend as Chief Executive Officer Mark Zuckerberg works to convince investors that his costly bets on the metaverse and artificial intelligence will pay off.\nMost Read from Bloomberg\nTrump Denied Immunity in DC Election Case by Appeals Court\nXi to Discuss China Stocks With Regulators as Rescue Bets Build\nWall Street Snubs China for India in a Historic Markets Shift\n‘Money Dysmorphia’ Traps Millennials and Gen Zers\nKing Charles Treated for Cancer in New Royal Health Scare\nThe social media giant also reported strong fourth-quarter results, posting a 25% gain in sales and profits that tripled, while also projecting revenue growth for the current period that surpassed projections.\nThe shares jumped more than 14% in extended trading. The stock had gained 12% this year through Thursday’s close after nearly tripling last year.\n“We had a good quarter as our community and business continue to grow,” Zuckerberg said in a statement. “We’ve made a lot of progress on our vision for advancing AI and the metaverse.”\nRevenue is expected to be as much as $37 billion in the three months ending in March, Meta said. Analysts were looking for $33.6 billion, according to estimates compiled by Bloomberg. In the fourth quarter, revenue was $40.1 billion, beating the average analyst estimate of $39 billion. Net income surged to $14 billion, or $5.33 a share, also better than expected.\nMeta executives had cautioned in October that “global economic uncertainties” could weigh on revenue at the end of last year, typically the most lucrative quarter, even as the company laid out an expensive spending plan for 2024. But the social media company, which owns Facebook, Instagram and WhatsApp, fared better than Alphabet Inc. The Google parent, which, like Meta, gets the bulk of its revenue from digital advertising and is also investing heavily on AI, reported softness in its core search advertising business earlier this week, sending its stock tumbling.\n“In the digital advertising sphere, Meta’s outlook is increasingly optimistic,” said Mayuranki De, research analyst at Global X. “Despite diversifying into areas like virtual-reality headsets, digital advertising remains its revenue cornerstone.”\nChief Financial Officer Susan Li said the strong increase in revenue in the fourth quarter was due to high spending by China-based advertisers and AI-recommended video content. Daily watch time across the company’s apps increased 25% from a year earlier.\nIn 2023, revenue from China-based advertisers represented 10% of Meta’s total revenue and contributed 5 percentage points to total worldwide revenue growth, Li said on a call with analysts.\nIn recent years, Meta has been working to balance huge outlays on technologies like artificial intelligence and virtual reality, while still trying to ensure that its core digital advertising business is still growing. After seeing business shrink for the first time in 2022, Zuckerberg made efforts to turn the company around, dubbing 2023 the “year of efficiency” and cutting thousands of jobs.\n“The fruits of their cost cutting measures are starting really to shine through earnings,” analysts at Vital Knowledge wrote in a note.\nZuckerberg struggled to get investors on board the last time he laid out a long-term, expensive new vision — for the metaverse — going so far as to change the company’s name from Facebook to Meta. Now, as the company spends handily on VR and AI, the company is sweetening the bet for shareholders with a quarterly dividend of 50 cents a share and a huge share repurchase program. The last time Meta authorized a buyback of this size was in October 2021 when it was still posting surprising growth in the number of people actively using its network of social media apps.\nNow that Meta plans to pay a dividend, the only holdouts among peers valued at more than $1 trillion are Amazon.com Inc. and Alphabet Inc. Apple Inc. has paid dividends on and off since 1987, and Microsoft Corp. started doling out dividends in 2003.\nMeta’s move sends a signal about the company’s view of its potential. While it indicates management are bullish about growth prospects, it also hints at limits on what the company can do with its cash pile. Typically, faster growing tech companies eschew dividends in favor of using earnings to develop new products or make big acquisitions. While Meta is spending big on artificial intelligence initiatives, its acquisition prospects are dwindling in the face of regulatory opposition.\nMeta has been investing in AI technology at record levels, including expanding its core advertising business through improvements in ad targeting and AI-recommended content, and the infrastructure it needs to run it. At the same time, it hasn’t abandoned efforts to build the virtual reality metaverse.\nFor this year, Meta plans to spend $94 billion to $99 billion, covering higher infrastructure-related costs, hiring selectively in higher-cost technical roles and development in augmented and virtual reality. Last quarter, the company said it planned to push some spending on items like new headcount and infrastructure into 2024.\nZuckerberg said he’s developed an appreciation for operating a leaner company, and is reluctant to jump back into significant hiring. He said he’d like to keep new hires “relatively minimal” to stay lean.\nThe company also said it expects operating losses to “increase meaningfully” at Reality Labs, the division that makes smart glasses and headsets, as it continues to invest in product development. On the bright side, the unit crossed $1 billion in quarterly revenue for the first time.\nMeta’s results follow reports from other Big Tech rivals, including Microsoft Corp., which failed to convince Wall Street that the all-consuming and expensive focus on AI is starting to pay off yet.\nMeta’s approach to the AI race has been different than its peers, however. For the most part, it’s unveiling research or large language models — the technology that underpins AI chatbots — for free to be used by developers. Meta thinks this open strategy will help improve the technology faster.\nFor all of Meta’s excitement about AI, investors focus on the number of people who use its apps has faded. Now with almost 4 billion people across Instagram, Facebook and WhatsApp that use the platform each month, the San Francisco-based company said it will no longer report that metric in earnings, or daily and monthly user numbers for its flagship Facebook app.\nBeginning this quarter, the company will instead begin reporting year-over-year changes in ad impressions and the average price per ad at the regional level, while continuing to report only daily active users across its family of apps.\nReels – the vertical videos on Instagram and Facebook that are served up to users by an algorithm – are being re-shared 3.5 billion times a day, Zuckerberg said, and ads for that format are now contributing to net revenue across both apps. Continuing to improve those videos, the ads served there and the algorithm that personalizes them for users, will continue to “remain a priority,” he said\n--With assistance from Kurt Wagner.\n(Updates to add user numbers, comments from CFO, CEO)\nMost Read from Bloomberg Businessweek\nInside a Private Jet Club Where Everything Went Wrong\nThe Person I Hired Is Now My Boss. What Happens Now?\nThe Story Elon Musk Doesn’t Want to Talk About\nIs It Morning in Joe Biden’s America?\nPowell Wants Fed to Stay Out of Election Crosshairs. Good Luck With That\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-01T22:14:10.000Z",
        "Title": "Zuckerberg announces $50bn payout for Meta shareholders amid child safety concerns",
        "Author": "  Matthew Field ",
        "Text": "Mark Zuckerberg’s Meta will pay up to $50bn to shareholders after it posted record revenues, sending profits soaring by 200pc.\nRevenues at the social media giant behind Facebook, Instagram and WhatsApp hit more than $40bn for the three months to December. Its shares surged more than 13pc in after hours trading on Thursday night.\nQuarterly profits climbed threefold to $14bn as Meta’s advertising sales staged a marked recovery after it implemented sweeping layoffs last year in a drastic effort to cut costs. Meta’s workforce shrunk by a total of 22pc, equivalent to more than 19,000 staff.\nMr Zuckerberg also announced the social network giant, which turns 20 this month, would pay its first-ever dividend as a public company of 50 cents per share - worth a total of $1.25bn. Meta said it would begin regular dividend payouts for the first time and would also buy back an additional $50bn from shareholders.\nThe strong results came just days after Mr Zuckerberg was accused by US senators of putting profits before users’ safety.\nEmails from within Meta published ahead of a Senate hearing this week showed how Mr Zuckerberg rejected pleas from Sir Nick Clegg, the company’s head of global affairs, to hire dozens of staff to help protect children on Facebook and Instagram.\nMr Zuckerberg told investors on Thursday: “We had a good quarter as our community and business continue to grow.\n“We’ve made a lot of progress on our vision for advancing AI and the metaverse.”\nMeta revealed close to half the world’s population has signed up to join the social media empire, with nearly 4bn people now using at least one of its apps on a regular basis.\nWhile politicians have threatened a crackdown on social media apps, Meta’s shares have climbed to record highs so far in 2024, up 14pc. Meta is now worth more than $1 trillion.\nSeparately on Thursday night, Apple revealed its first rise in sales in more than a year as demand for its latest iPhones reversed a rare losing streak.\nThe tech giant revealed that revenues rose by 2pc in the final three months of last year to $119.6bn while profits rose by 13pc to $34bn.\nThe increase reverses four consecutive quarters of falling revenues, which had been Apple’s longest losing streak since the launch of the iPod two decades ago.\nIt comes despite declining sales in China, where the company has faced growing questions over its business.\nShares in the company dropped slightly in after-hours trading.\nSales of the iPhone, which counts for the majority of Apple’s revenue, grew by 6pc. Its services business, which includes its App Store and software such as Apple Music and Apple Pay, grew by 11pc. Sales of the iPad fell while those of Mac computers rose slightly. Sales of accessories such as AirPods and the Apple Watch also declined.\nChief executive Tim Cook said 2.2bn Apple products were now in use around the world\nThe figures come as Apple prepares to release its Vision Pro headset, the most significant new product released in Mr Cook’s 13 years in charge of the company, which goes on sale on Friday in the US.\nAmazon recorded its highest profit for two years amid a jump in trading over the Christmas period.\nThe company said sales rose by 14pc to $170bn in the fourth quarter of the year, in part due to growing sales outside the US.\nProfits rose from $300m a year ago to $10.6bn. This was its strongest profit since the end of 2021, when rising Covid cases meant most consumers resorted to internet shopping.\nThe growth in sales puts Amazon within touching distance of overtaking Walmart as the world’s biggest retail company by revenues.\nShares rose by 6pc in after-hours trading.\nThe results for the Silicon Valley giants came as job cuts continued to hit the industry. Video call app Zoom cut around 150 jobs, roughly 2pc of its workforce, while security app Okta laid off 400 staff.\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.\n"
    },
    {
        "Date": "2024-01-09T09:58:47.000Z",
        "Title": "Q3 Earnings Roundup: Meta (NASDAQ:META) And The Rest Of The Social Networking Segment",
        "Author": "  Jabin Bastian ",
        "Text": "Quarterly earnings results are a good time to check in on a company’s progress, especially compared to other peers in the same sector. Today we are looking at Meta (NASDAQ:META), and the best and worst performers in the social networking group.\nBusinesses must meet their customers where they are, which over the past decade has come to mean on social networks. In 2020, users spent over 2.5 hours a day on social networks, a figure that has increased every year since measurement began. As a result, businesses continue to shift their advertising and marketing dollars online.\nThe 4 social networking stocks we track reported a mixed Q3; on average, revenues beat analyst consensus estimates by 2.8% while next quarter's revenue guidance was in line with consensus. Stocks have faced challenges as investors prioritize near-term cash flows, but social networking stocks held their ground better than others, with the share prices up 35.2% on average since the previous earnings results.\nFamously founded by Mark Zuckerberg in his Harvard dorm, Meta Platforms (NASDAQ:META) operates a collection of the largest social networks in the world - Facebook, Instagram, WhatsApp, and Messenger, along with its metaverse focused Facebook Reality Labs.\nMeta reported revenues of $34.15 billion, up 23.2% year on year, topping analyst expectations by 2%. It was a mixed quarter for the company, with underwhelming revenue guidance for the next quarter. On the other hand, Meta beat analysts' revenue and EPS estimates this quarter, driven by better-than-expected monthly active user growth.\n\"We had a good quarter for our community and business,\" said Mark Zuckerberg, Meta founder and CEO.\nMeta achieved the fastest revenue growth of the whole group. The company reported 3.96 billion monthly active users, up 6.7% year on year. The stock is up 19.4% since the results and currently trades at $357.66.\nIs now the time to buy Meta? Access our full analysis of the earnings results here, it's free.\nFounded by Stanford University students Evan Spiegel, Reggie Brown, and Bobby Murphy, and originally called Picaboo, Snapchat (NYSE: SNAP) is an image centric social media network.\nSnap reported revenues of $1.19 billion, up 5.3% year on year, outperforming analyst expectations by 7%. It was a strong quarter for the company, with a beat of analysts' revenue estimates and solid growth in its user base.\nSnap scored the biggest analyst estimates beat among its peers. The company reported 406 million daily active users, up 11.8% year on year. The stock is up 77.7% since the results and currently trades at $17.25.\nIs now the time to buy Snap? Access our full analysis of the earnings results here, it's free.\nHelping residents figure out what's happening on their block in real time, Nextdoor (NYSE:KIND) is a social network that connects neighbors with each other and with local businesses.\nNextdoor reported revenues of $56.09 million, up 4% year on year, falling short of analyst expectations by 0.4%. It was a weak quarter for the company, with slow revenue growth and a miss of analysts' revenue estimates.\nNextdoor had the weakest performance against analyst estimates and slowest revenue growth in the group. The company reported 40.4 million daily active users, up 5.5% year on year. The stock is down 5.5% since the results and currently trades at $1.72.\nRead our full analysis of Nextdoor's results here. \nCreated with the idea of virtually replacing paper catalogues, Pinterest (NYSE: PINS) is an online image and social discovery platform.\nPinterest reported revenues of $763.2 million, up 11.5% year on year, surpassing analyst expectations by 2.7%. It was a mixed quarter for the company, with a decent beat of analysts' revenue estimates but slow revenue growth.\nThe company reported 482 million monthly active users, up 8.3% year on year. The stock is up 49.1% since the results and currently trades at $37.37.\nRead our full, actionable report on Pinterest here, it's free. \nJoin Paid Stock Investor Research\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\nThe author has no position in any of the stocks mentioned\n"
    },
    {
        "Date": "2024-01-04T18:45:45.000Z",
        "Title": "Mark Zuckerberg sold Meta shares worth more than $400 million in the last 2 months of 2023",
        "Author": "  George Glover ",
        "Text": "Mark Zuckerberg offloaded Meta stock worth $428 million in November and December, per a regulatory filing.\nIt's the first time in more than two years that he's sold shares in the social-media giant.\nMeta soared 194% last year and now trades close to a record high.\nMeta Platforms CEO Mark Zuckerberg sold shares worth more than $400 million in the last two months of 2023.\nThe Facebook founder started offloading stock on November 1 and made a sale every day between then and the end of the year, per a regulatory filing issued Tuesday.\nIn total, Zuckerberg sold 1.28 million shares for about $428 million.\nIt's the first time since November 2021 that the world's seventh-richest person has trimmed his position in the social-media giant.\nMeta is coming off a banner year where its stock soared 194% as Zuckerberg pressed ahead with its \"Year of Efficiency\" cost cuts and the AI craze encouraged investors to pile into mega-cap Big Tech stocks.\nIt was the second best-performing S&P 500 stock last year, trailing only Nvidia, with shares now at $344 – just 10% below the record high hit in September 2021.\nZuckerberg still owns about 13% of Meta, with his stake valued at just under $116 billion as of Wednesday's closing bell, by Business Insider's calculations.\nHis personal fortune ballooned by $80 billion to $128 billion last year thanks to Meta's surging share price, according to the Bloomberg Billionaires Index.\nRead the original article on Business Insider\n"
    },
    {
        "Date": "2024-01-20T14:45:00.000Z",
        "Title": "Will Eli Lilly Be Worth More Than Meta Platforms by 2030?",
        "Author": "  Prosper Junior Bakiny, The Motley Fool ",
        "Text": "Eli Lilly (NYSE: LLY) and Meta Platforms (NASDAQ: META) don't seem to have much in common as they operate entirely different businesses in completely different industries. The former is a leader in the biotech industry, while the latter is a social media specialist. Here is another difference between the two: Meta Platforms once managed to achieve a feat that Eli Lilly hasn't, and that sometimes makes it a benchmark in the eyes of many investors. Back in 2021, the technology giant became a trillion-dollar company.\nWhile Meta no longer holds that title, with a market capitalization of $962 billion, it should soon rejoin this exclusive clique. Eli Lilly is more than halfway through this goal, with a current market cap of about $610 billion. The drugmaker has generated much stronger returns than Meta Platforms in the past decade, and if the trend continues, Eli Lilly could overtake Meta Platforms soon enough. Could that happen by 2030? Let's find out.\nLLY data by YCharts.\nNotice that Meta Platforms was outpacing Eli Lilly for much of the past decade until about 2022 when the latter skyrocketed. What happened then? Meta Platforms' stock soared during the early months of the pandemic but subsequently fell as that tailwind ended. Meanwhile, Eli Lilly has been on a roll since 2022 with significant clinical and regulatory developments that should help drive strong financial results through the end of the decade and beyond.\nMost notably, Eli Lilly earned approval for an innovative diabetes medicine called Mounjaro in 2022. Last year, it earned a key label expansion in targeting obesity with the drug marketed as Zepbound. Some analysts have predicted peak annual sales of $25 billion for this compound, which would be amazing. Even Humira, the best-selling drug in the history of the industry, peaked at $21.2 billion in yearly sales.\nMounjaro is just one piece of the puzzle for Eli Lilly, although it's a hugely important one. The company is adding several other important medicines to its lineup that should also be successful. For instance, the company's new ulcerative colitis medicine Omvoh could generate sales of $1.2 billion by 2029, while Jaypirca, a new cancer drug, could hit more than $2.5 billion by 2030.\nThen there is donanemab, a potential Alzheimer's disease therapy. Eli Lilly is waiting for approval for this product, and if it does earn the green light, the research company Evaluate Pharma thinks it could rack up $2.1 billion in sales by 2028. There are other key products in Eli Lilly's late-stage pipeline, including a potential once-weekly insulin option. Furthermore, the company's existing lineup features medicines whose sales are still growing at a good clip, from cancer drug Verzenio to immunosuppressant Taltz.\nUnless something catastrophic happens, Eli Lilly should outperform the market through 2030, especially as analysts see the company's earnings per share growing by an average of 28.7% for the next five years -- an almost outrageous pace for a biotech giant.\nMeta Platforms was able to bounce back in 2023. The company benefited from a recovering advertising market while it continued to ramp up monetization of newer initiates across its portfolio of websites and apps. On WhatsApp, the company is working on paid messaging, while its short-form videos on Facebook and Instagram are helping keep users glued to their screens and attracting advertisers. These are important long-term opportunities. Furthermore, the tech company is also looking to make a splash in artificial intelligence.\nIn my view, Meta Platforms is also well-positioned to outperform the market through 2030, although it will be more susceptible than Eli Lilly to several risks, including economic challenges, as we saw in much of 2021 and 2022.\nAt its current valuation, Eli Lilly will need a compound annual growth rate of about 8.6% to become a trillion-dollar stock in six years. That shouldn't be a problem for the company. Far from it. However, Meta Platforms will almost certainly rejoin this rank much sooner. While Eli Lilly will, in my view, outperform Meta Platforms through 2030, whether it can do so enough to end up with a larger market cap is another question. That seems somewhat unlikely, at least to me.\nMeta Platforms' poor performance in 2021 and 2022, which allowed Eli Lilly to soar past it, won't become a habit moving forward, nor should investors expect the biotech giant to deliver the kinds of returns it did during these past two years regularly. Still, Eli Lilly remains a solid buy, as does Meta Platforms.\nShould you invest $1,000 in Eli Lilly right now?\nBefore you buy stock in Eli Lilly, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Eli Lilly wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 8, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Prosper Junior Bakiny has positions in Meta Platforms. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nWill Eli Lilly Be Worth More Than Meta Platforms by 2030? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-26T13:00:00.000Z",
        "Title": "Meta Materials Announces Preliminary Results for The Fourth Quarter 2023",
        "Author": "  Meta Materials Inc. ",
        "Text": "Fourth quarter 2023 revenue up 55% from the prior year comparable period\nOperating expenses down 35% compared to the fourth quarter of 2022, excluding non-cash asset impairment\nCash and cash equivalents totaled $10.3 million, basically in line with the September 2023 quarter\nFocus continued on core business lines, with ramped up sales initiatives in authentication, VLEPSIS, NANOWEB and battery materials\nHALIFAX, NS / ACCESSWIRE / January 26, 2024 / Meta Materials Inc. (the \"Company\" or \"META\") (NASDAQ:MMAT), an advanced materials and nanotechnology company, today announced preliminary results for the fourth quarter ended December 31, 2023. In the fourth quarter of 2023, total revenue was approximately $2.2 million, up 55% compared to $1.4 million in the fourth quarter of 2022, and modestly higher compared to the third quarter of 2023.\nThe Company is focused on driving revenue growth in 2024 across four main business lines. In authentication, META has launched two new products, QUANTUM stripe for currency and NANO protect for brand protection, along with continued work for our confidential G10 central bank customer. Following presentations at the Dubai Air Show in November 2023, META is working on multiple pre-orders for the VLEPSIS multi-gigapixel wide area motion imagery system. The Company's NANOWEB transparent conductive films are manufactured in collaboration with Panasonic Industry. Automotive heating films to protect camera, radar and lidar sensors are being tested by leading automotive OEMs and suppliers. NANOWEB EMI shielding films for microwave and combination microwave-convection ovens are also in advanced stages of testing. META is also pursuing joint development and licensing opportunities with global battery OEMs for our NPORE nanoceramic battery separators and NCORE polymer metal composite current collectors.\n\"Over the past three months, we restructured the business and expanded the pipeline for sales and partnerships within four dedicated product lines, bolstered by aggressive marketing efforts. Results have already proven promising, and we are redoubling our efforts in 2024 to commercialize key products, license technology and grow revenues significantly compared to 2023,\" noted Uzi Sasson, META's President and Chief Executive Officer.\nTotal fourth quarter operating expenses are estimated to be approximately $16.1 million (including $1.6 million in restructuring expenses, $3.4 million in depreciation and amortization, and $0.5 million in stock-based compensation), down 35% from the $24.8 million incurred in the fourth quarter of 2022, resulting in the estimated fourth quarter 2023 loss from operations of approximately $14.9 million, well below the comparable fourth quarter 2022 operating loss of $24.0 million. An expected non-cash impairment of long-term assets, not included in the figures above, is still to be determined. As of December 31, 2023, cash and cash equivalents totaled approximately $10.3 million, compared to $10.2 million at September 30, 2023.\n\"A strong capital position involves reducing expenses, managing cash and seeking out opportunities to monetize non-core assets to our advantage. We are doing so by extracting value from certain intellectual property and patents related to our medical and holography applications, and in addition working with potential strategic partners to expand our product offerings. We have identified multiple potential interested parties and intend to work cooperatively with investment bankers to divest the assets at the best valuation,\" noted Mr. Sasson.\nMETA expects to release fourth quarter and full year 2023 results in mid-to-late March. The preliminary estimated financial information has been prepared by, and is the responsibility of, the Company's management. KPMG LLP, the Company's independent registered public accounting firm, has not audited, reviewed, compiled or performed any procedures with respect to the preliminary estimated financial information provided above.\nAbout Meta Materials Inc.\nMeta Materials Inc. (META) is an advanced materials and nanotechnology company. We develop new products and technologies using innovative sustainable science. Advanced materials can improve everyday products that surround us, making them smarter and more sustainable. META® technology platforms enable global brands to develop new products to improve performance for customers in aerospace and defense, consumer electronics, 5G communications, batteries, authentication, automotive and clean energy. Learn more at www.metamaterial.com.\nMedia and Investor Inquiries\nRob StoneVice President, Corporate Development and CommunicationsMeta Materials Inc.media@metamaterial.comir@metamaterial.com\nForward-Looking Information\nThis press release includes forward-looking information or statements within the meaning of Canadian securities laws and within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995, regarding the Company, which may include, but are not limited to, statements with respect to the business strategies, product development, restructuring plans and operational activities of the Company. Often but not always, forward-looking information can be identified by the use of words such as \"pursuing\", \"potential\", \"predicts\", \"projects\", \"seeks\", \"plans\", \"expect\", \"intends\", \"anticipated\", \"believes\" or variations (including negative variations) of such words and phrases, or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"will\" be taken, occur or be achieved. Such statements are based on the current expectations and views of future events of the management of the Company and are based on assumptions and subject to risks and uncertainties. Although the management of the Company believes that the assumptions underlying these statements are reasonable, they may prove to be incorrect. The forward-looking events and circumstances discussed in this release may not occur and could differ materially as a result of known and unknown risk factors and uncertainties affecting the Company, the capabilities of our facilities, research and development projects of the Company, the total available market and market potential of the products of the Company, the market position of the Company, the need to raise more capital and the ability to do so, the scalability of the Company's production ability, capacity for new customer engagements, material selection programs timeframes, the ability to reduce production costs, enhance metamaterials manufacturing capabilities and extend market reach into new applications and industries, the ability to accelerate commercialization plans, the possibility of new customer contracts, the continued engagement of our employees, the technology industry, market strategic and operational activities, and management's ability to manage and operate the business. More details about these and other risks that may impact the Company's businesses are described under the heading \"Forward-Looking Information\" and under the heading \"Risk Factors\" in the Company's Form 10-K filed with the SEC on March 23, 2023, in the Company's Form 10-K/A filed with the SEC on March 24, 2023, in the Company's Form 10-Q filed with the SEC on November 13, 2023, and in subsequent filings made by Meta Materials with the SEC, which are available on SEC's website at www.sec.gov. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on any forward-looking statements or information. No forward-looking statement can be guaranteed. Except as required by applicable securities laws, forward-looking statements speak only as of the date on which they are made and the Company does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise, except to the extent required by law.\nSOURCE: Meta Materials Inc.\nView the original press release on accesswire.com\n"
    },
    {
        "Date": "2024-01-18T00:18:06.000Z",
        "Title": "Meta’s Sheryl Sandberg to Leave Board After 12 Years",
        "Author": "  Alex Barinka and Kurt Wagner ",
        "Text": "(Bloomberg) -- Meta Platforms Inc. director and former Chief Operating Officer Sheryl Sandberg said she will step down from the board this year, exiting her last official role at the social media company she helped grow from a promising internet startup into a digital-advertising stalwart.\nMost Read from Bloomberg\nChina Weighs Stock Market Rescue Package Backed by $278 Billion\nIndia Tops Hong Kong as World’s Fourth-Largest Stock Market\nFlorida Governor DeSantis Drops Out of 2024 Race, Endorses Trump\nHong Kong Stocks at 36% Discount Show True Depth of China Gloom\nMorgan Stanley, JPMorgan Say Buy the Dip After Treasury Rout\n“With a heart filled with gratitude and a mind filled with memories, I let the Meta board know that I will not stand for reelection this May,” Sandberg wrote Wednesday in a post on Meta’s flagship Facebook network. “Going forward, I will serve as an adviser to the company, and I will always be there to help the Meta teams.”\nSandberg, 54, joined Facebook in 2008 as No. 2 to co-founder Mark Zuckerberg to oversee the fledgling company’s advertising, partnerships, business development and operations, following stints at Google, McKinsey & Co. and the US Department of the Treasury. She left her job as COO of the company, by then rebranded as Meta, in 2022.\nDuring her time at the tech giant, which also owns Instagram and WhatsApp, Sandberg was key to turning the social network into a money-making machine and one of the world’s biggest companies. In 2022 Meta brought in almost $117 billion in revenue, most of it from targeted advertising.\nShe often served as the public face of the business, particularly among policymakers and regulators. As criticism of Facebook and its platforms mounted in more recent years, including bruising scandals over lapses in privacy and content moderation, Sandberg increasingly retreated from the spotlight.\nRead More: Sandberg’s Advertising Empire Leaves a Complicated Legacy\n“Your dedication and guidance have been instrumental in driving our success,” Zuckerberg wrote in a comment on Sandberg’s Facebook post. “I am grateful for your unwavering commitment to me and Meta over the years.”\nIt’s unclear if Meta plans to replace Sandberg on the board, which now has eight other members, including Zuckerberg as chairman. A company spokesperson said Meta consistently evaluates how to grow the board, but declined to offer further details.\nSince leaving the COO role at Meta, Sandberg has spent more time on philanthropic efforts. Her nonprofit organization, LeanIn.Org, launched a program for girls 11 to 15 called Lean In Girls, aiming to teach lessons about resilience, positive risk-taking and leadership. She was also part of a team of investors that brought a women’s professional soccer club to the San Francisco Bay Area last year; the team will play its inaugural season in 2024.\nMost recently, Sandberg organized an event at the United Nations focused on sexual violence that occurred during the Oct. 7 terrorist attack on Israel.\nRead More: Sheryl Sandberg Donates $3 Million for ACLU’s Abortion Fight\n(Updates with Meta’s 2022 revenue, plans for board replacement, Sandberg’s philanthropic work starting in fourth paragraph.)\nMost Read from Bloomberg Businessweek\nThe Downfall of Diddy Inc.\nHow Sweden Quit Smoking Without Quitting Nicotine\nThe Bitcoin Hype Is Back and About Just as Hollow as Before\nJapan’s Market Roars Back to Life—With Old-Timers Leading the Way\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-01-23T21:00:00.000Z",
        "Title": "Meta Materials Announces 1-for-100 Reverse Stock Split to Regain Nasdaq Compliance",
        "Author": "  Meta Materials Inc. ",
        "Text": "HALIFAX, NS / ACCESSWIRE / January 23, 2024 / Meta Materials Inc. (the \"Company\" or \"META\") (Nasdaq:MMAT), an advanced materials and nanotechnology company, today announced that it intends to effect a 1-for-100 reverse stock split (\"Reverse Stock Split\") of its issued and outstanding common stock that will become effective at 12:01 AM PT on January 29, 2024. The Company's common stock is therefore expected to begin trading on a split-adjusted basis when the market opens on January 29, 2024. The Company's common stock will continue to trade on the Nasdaq Capital Market under the symbol \"MMAT\" but with a new CUSIP number 59134N302.\nThe Reverse Stock Split is part of the Company's plan to regain compliance with the $1.00 per share minimum closing price required to maintain continued listing on the Nasdaq Capital Market.\nThe Reverse Stock Split was approved by the Board of Directors of the Company in accordance with Nevada law. As a result of the Reverse Stock Split, every 100 shares of common stock issued and outstanding prior to the effective time will be automatically reclassified into one share of common stock with no change in the $0.001 par value per share. The exercise prices and the number of shares issuable upon exercise of outstanding stock options, equity awards and warrants, and the number of shares available for future issuance under the equity incentive plans will be adjusted in accordance with their respective terms. The Reverse Stock Split will affect all stockholders uniformly and will not alter any stockholder's percentage interest in the Company's equity.\nNo fractional shares will be issued in connection with the Reverse Stock Split. Any fractional shares of common stock resulting from the Reverse Stock Split will be rounded up to the nearest whole post-split share and no stockholders will receive cash in lieu of fractional shares.\nThe Reverse Stock Split will reduce the number of outstanding shares of common stock from approximately 564 million to approximately 5.64 million shares and also proportionately reduce the number of authorized shares of common stock from 1 billion to 10 million shares.\nAbout Meta Materials Inc.\nMeta Materials Inc. (META) is an advanced materials and nanotechnology company. We develop new products and technologies using innovative sustainable science. Advanced materials can improve everyday products that surround us, making them smarter and more sustainable. META® technology platforms enable global brands to develop new products to improve performance for customers in aerospace and defense, consumer electronics, 5G communications, batteries, authentication, automotive and clean energy. Learn more at www.metamaterial.com.\nMedia and Investor Inquiries\nRob StoneVice President, Corporate Development and CommunicationsMeta Materials Inc.media@metamaterial.comir@metamaterial.com\nForward Looking Information\nThis press release includes forward-looking information or statements within the meaning of Canadian securities laws and within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995, regarding the Company, which may include, but are not limited to, statements with respect to the business strategies, product development, restructuring plans and operational activities of the Company. Often but not always, forward-looking information can be identified by the use of words such as \"pursuing\", \"potential\", \"predicts\", \"projects\", \"seeks\", \"plans\", \"expect\", \"intends\", \"anticipated\", \"believes\" or variations (including negative variations) of such words and phrases, or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"will\" be taken, occur or be achieved. Such statements are based on the current expectations and views of future events of the management of the Company and are based on assumptions and subject to risks and uncertainties. Although the management of the Company believes that the assumptions underlying these statements are reasonable, they may prove to be incorrect. The forward-looking events and circumstances discussed in this release may not occur and could differ materially as a result of known and unknown risk factors and uncertainties affecting the Company, the capabilities of our facilities, research and development projects of the Company, the total available market and market potential of the products of the Company, the market position of the Company, the need to raise more capital and the ability to do so, the scalability of the Company's production ability, capacity for new customer engagements, material selection programs timeframes, the ability to reduce production costs, enhance metamaterials manufacturing capabilities and extend market reach into new applications and industries, the ability to accelerate commercialization plans, the possibility of new customer contracts, the continued engagement of our employees, the technology industry, market strategic and operational activities, and management's ability to manage and operate the business. More details about these and other risks that may impact the Company's businesses are described under the heading \"Forward-Looking Information\" and under the heading \"Risk Factors\" in the Company's Form 10-K filed with the SEC on March 23, 2023, in the Company's Form 10-K/A filed with the SEC on March 24, 2023, in the Company's Form 10-Q filed with the SEC on November 13, 2023, and in subsequent filings made by Meta Materials with the SEC, which are available on SEC's website at www.sec.gov. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on any forward-looking statements or information. No forward-looking statement can be guaranteed. Except as required by applicable securities laws, forward-looking statements speak only as of the date on which they are made and the Company does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise, except to the extent required by law.\nSOURCE: Meta Materials Inc.\nView the original press release on accesswire.com\n"
    },
    {
        "Date": "2024-01-26T04:52:32.000Z",
        "Title": "Meta Platforms Inc Chief Legal Officer Jennifer Newstead Sells Company Shares",
        "Author": "  GuruFocus Research ",
        "Text": "On January 23, 2024, Jennifer Newstead, Chief Legal Officer of Meta Platforms Inc (NASDAQ:META), sold 566 shares of the company. The transaction was filed with the SEC and can be found through this SEC Filing.\nWarning! GuruFocus has detected 6 Warning Signs with META.\nMeta Platforms Inc, formerly known as Facebook Inc, operates as a social media conglomerate, owning several major social networking services and technology companies. It is one of the world's leading providers of social media and related services and tools.\nOver the past year, the insider has sold a total of 30,059 shares and has not made any purchases of the company's stock. This latest sale continues a trend observed over the past year, where there have been no insider buys and 134 insider sells for Meta Platforms Inc.\nOn the day of the sale, shares of Meta Platforms Inc were trading at $385, resulting in a market capitalization of $1,010,418.629 billion. The price-earnings ratio stood at 34.70, which is above both the industry median of 20.915 and the company's historical median price-earnings ratio.\nThe stock's price-to-GF-Value ratio was 1.16, indicating that Meta Platforms Inc was considered Modestly Overvalued based on its GF Value of $333.18. The GF Value is a proprietary intrinsic value estimate from GuruFocus, which takes into account historical trading multiples, a GuruFocus adjustment factor, and future business performance estimates provided by Morningstar analysts.\nInvestors and analysts often monitor insider transactions as they can provide insights into a company's internal perspective on the stock's valuation and future prospects. The consistent selling by insiders at Meta Platforms Inc, including the Chief Legal Officer, may be a point of interest for stakeholders and potential investors.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-01-23T21:10:00.000Z",
        "Title": "Meta Materials Announces Distribution of Series C Preferred Stock to Holders of its Common Stock",
        "Author": "  Meta Materials Inc. ",
        "Text": "HALIFAX, NS / ACCESSWIRE / January 23, 2024 / Meta Materials Inc. (the \"Company\" or \"META\") (Nasdaq:MMAT), an advanced materials and nanotechnology company, today announced that its Board of Directors declared a distribution of one share of newly designated Series C Preferred Stock, par value $0.001 per share, for each outstanding share of the Company's common stock and each voting right represented by the Company's Series B Preferred Stock held of record as of 5:00 p.m. Eastern Time on February 2, 2024. The shares of Series C Preferred Stock will be distributed to such recipients at 5:30 p.m. Eastern Time on February 2, 2024. The outstanding shares of Series C Preferred Stock will vote together with the outstanding shares of the Company's common stock, as a single class, exclusively with respect to a proposal to increase the Company's authorized shares as well as any proposal to adjourn any meeting of stockholders called for the purpose of voting on the increase in authorized shares, and will not be entitled to vote on any other matter, except to the extent required under the Nevada law. Subject to certain limitations, each outstanding share of Series C Preferred Stock will have 1,000 votes per share.\nAll shares of Series C Preferred Stock that are not present in person or by proxy at the meeting of stockholders held to vote on the increase in authorized shares as of immediately prior to the opening of the polls at such meeting will automatically be redeemed by the Company. Any outstanding shares of Series C Preferred Stock that have not been so redeemed will be redeemed if such redemption is ordered by the Company's Board of Directors or automatically upon the approval by the Company's stockholders of an amendment to the Company's articles of incorporation effecting the increase of authorized shares at such meeting.\nThe Series C Preferred Stock will be uncertificated, and no shares of Series C Preferred Stock will be transferable by any holder thereof except in connection with a transfer by such holder of any shares of the Company's common stock held by such holder. In that case, a number of shares of Series C Preferred Stock equal to the number of shares of the Company's common stock to be transferred by such holder would be transferred to the transferee of such shares of common stock.\nFurther details regarding the Series C Preferred Stock will be contained in a Current Report on Form 8-K to be filed by the Company with the Securities and Exchange Commission. In addition, the Company also intends to file a notice of special meeting of the Company's stockholders and a preliminary proxy statement to consider the approval of an increase in the Company's authorized shares as described herein, if necessary.\nAbout Meta Materials Inc.\nMeta Materials Inc. (META) is an advanced materials and nanotechnology company. We develop new products and technologies using innovative sustainable science. Advanced materials can improve everyday products that surround us, making them smarter and more sustainable. META® technology platforms enable global brands to develop new products to improve performance for customers in aerospace and defense, consumer electronics, 5G communications, batteries, authentication, automotive and clean energy. Learn more at www.metamaterial.com.\nMedia and Investor Inquiries\nRob StoneVice President, Corporate Development and CommunicationsMeta Materials Inc.media@metamaterial.comir@metamaterial.com\nForward Looking Information\nThis press release includes forward-looking information or statements within the meaning of Canadian securities laws and within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995, regarding the Company, which may include, but are not limited to, statements with respect to the business strategies, product development, restructuring plans and operational activities of the Company. Often but not always, forward-looking information can be identified by the use of words such as \"pursuing\", \"potential\", \"predicts\", \"projects\", \"seeks\", \"plans\", \"expect\", \"intends\", \"anticipated\", \"believes\" or variations (including negative variations) of such words and phrases, or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"will\" be taken, occur or be achieved. Such statements are based on the current expectations and views of future events of the management of the Company and are based on assumptions and subject to risks and uncertainties. Although the management of the Company believes that the assumptions underlying these statements are reasonable, they may prove to be incorrect. The forward-looking events and circumstances discussed in this release may not occur and could differ materially as a result of known and unknown risk factors and uncertainties affecting the Company, the capabilities of our facilities, research and development projects of the Company, the total available market and market potential of the products of the Company, the market position of the Company, the need to raise more capital and the ability to do so, the scalability of the Company's production ability, capacity for new customer engagements, material selection programs timeframes, the ability to reduce production costs, enhance metamaterials manufacturing capabilities and extend market reach into new applications and industries, the ability to accelerate commercialization plans, the possibility of new customer contracts, the continued engagement of our employees, the technology industry, market strategic and operational activities, and management's ability to manage and operate the business. More details about these and other risks that may impact the Company's businesses are described under the heading \"Forward-Looking Information\" and under the heading \"Risk Factors\" in the Company's Form 10-K filed with the SEC on March 23, 2023, in the Company's Form 10-K/A filed with the SEC on March 24, 2023, in the Company's Form 10-Q filed with the SEC on November 13, 2023, and in subsequent filings made by Meta Materials with the SEC, which are available on SEC's website at www.sec.gov. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on any forward-looking statements or information. No forward-looking statement can be guaranteed. Except as required by applicable securities laws, forward-looking statements speak only as of the date on which they are made and the Company does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise, except to the extent required by law.\nSOURCE: Meta Materials Inc.\nView the original press release on accesswire.com\n"
    },
    {
        "Date": "2024-01-23T11:16:57.000Z",
        "Title": "Meta COO who replaced Sheryl Sandberg is keeping a low-profile",
        "Author": "  Peter Vanham, Nicholas Gordon ",
        "Text": "In a world in crisis, don’t seek the headlines. Do a good job first—then talk about it.\nThat's my takeaway from Davos 2024 and an important lesson heading into what promises to be another turbulent year in business and politics. One man I met in Davos who seems to understand that concept is Javier Olivan. If your first reaction is: Javier who? Then I would say: my point exactly.\nOlivan, a Spanish-American engineer, has been the COO of Meta since the summer of 2022. He inherited the job from Sheryl Sandberg, who became somewhat of a business celebrity during her time in the job. Olivan, too, will be a Meta heavyweight: he oversees tens of thousands of employees, almost all new product rollouts, and the company’s trust and safety efforts.\nBut don’t look for Olivan in the headlines or on public stages—at Davos or elsewhere. He hasn’t publicly spoken about Meta’s plans to address disinformation ahead of 2024 elections, let alone any other topics. I argue that’s a good thing. In a crucial election year, Meta has a lot to lose in terms of public trust—and all of us have a lot to lose if Meta gets it wrong. Olivan’s actions, then, matter much more than his words.\nWhen I spoke to Olivan at a dinner co-hosted by Fortune and Cognizant, he made it clear his low-profile approach was deliberate. It one of the few things he and his boss mentioned when he took the job. “Javi will be focused internally and operationally,” Meta CEO Mark Zuckerberg wrote at the time, describing Olivan's “more traditional COO role,” compared to Sandberg’s “superstar” profile. Olivan, for his part, called Sandberg a “remarkable advocate for Meta,” but added that his role was unlikely to have “the same public-facing aspect.”\nMeta, of course, is a one-of-a-kind company, with a rather unique role as a platform for global citizens and their online political discourse; its stakes are potentially world-changing. Still, Olivan's under-the-radar approach can apply to executives from firms of all kinds.\nAs polarization in society and politics has increased, more executives have burned themselves than gained universal praise when speaking out on issues not core to their business. One way to get the balance right is for a company to do a stakeholder mapping before venturing into the public debate.\nMore news below.\nPeter Vanhampeter.vanham@fortune.com@petervanham\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-01-10T15:32:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Meta Platforms, Broadcom, Verizon Communications, Starbucks and MercadoLibre",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – January 10, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Meta Platforms, Inc. META, Broadcom Inc. AVGO, Verizon Communications Inc. VZ, Starbucks Corp. SBUX and MercadoLibre, Inc. MELI.\nHere are highlights from Tuesday’s Analyst Blog:\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Meta Platforms, Inc., Broadcom Inc. and Verizon Communications Inc.. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today's research reports here >>>Meta Platform shares have outperformed the Zacks Internet - Software industry over the past six months (+19.7% vs. +9.7%). The company is benefiting from steady user growth across all regions, particularly Asia Pacific. Increased engagement for its offerings like Instagram, WhatsApp, Messenger and Facebook has been a major growth driver.Meta Platform is leveraging AI to recommend Reels content, which is driving traffic on Instagram and Facebook. Its innovative portfolio, which includes Threads, Reels and Llama 2, is likely to aid prospects. Advertising revenues are expected to witness a CAGR of 13% per our model estimate.However, challenging macroeconomic conditions remain a headwind for Meta's advertising revenues, along with targeting and measurement headwinds due to Apple's iOS changes. Slow monetization of Reels, along with mounting operating losses at Reality Labs, are concerns.(You can read the full research report on Meta Platforms here >>>)Shares of Broadcom have outperformed the Zacks Electronics - Semiconductors industry over the past year (+86.1% vs. +77.2%). The company is benefiting from the strong deployment of generative AI which it expects to contribute more than 25% of semiconductor revenues in fiscal 2024. VMware is expected to contribute $12 billion to revenues.Infrastructure software revenues are expected to be $20 billion while semiconductor solutions revenues are expected to increase in the mid to high-single-digit percentage range on a year-over-year basis in fiscal 2024. Broadcom expects networking revenues to grow nearly 30% year over year in fiscal 2024 driven by accelerating deployment of networking connectivity and expansion of AI accelerators in hyperscalers.Wireless revenues are expected to remain stable on a year-over-year basis. However, server storage, broadband, and industrial revenues are expected to decline in fiscal 2024.(You can read the full research report on Broadcom here >>>)Verizon shares have outperformed the Zacks Wireless National industry over the past year (+2.7% vs. +2.1%). The company is witnessing significant 5G adoption and fixed wireless broadband momentum. It is offering various mix and match pricing in both wireless and home broadband plans which has led to solid client additions.Initiative to change its revenue mix toward emerging growth services like cloud, security and professional services will likely reap long-term benefits. Its mmWave footprint delivers game-changing experiences for the densest parts of the network and offers highly predictable signal waves leading to greater efficiency and less interference for customers.However, lower wireline and wireless equipment revenues are major concerns. In the third quarter of 2023, Verizon registered 78,000 Fios Video net losses, reflecting the ongoing shift from traditional linear video to over-the-top offerings. Macroeconomic challenges are impeding the top line.(You can read the full research report on Verizon here >>>)Other noteworthy reports we are featuring today include Starbucks Corp. and MercadoLibre, Inc..\nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\nStarbucks Corporation (SBUX) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nMercadoLibre, Inc. (MELI) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-01-29T13:45:00.000Z",
        "Title": "Nvidia, Microsoft, Alphabet, Meta Platforms and Amazon are part of Zacks Earnings Preview",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – January 29, 2024 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Nvidia NVDA, Microsoft MSFT, Alphabet GOOGL, Meta Platforms META and Amazon AMZN.\nTech stocks have maintained their market leadership in the New Year, building on last year's standout performance. Driving this momentum has been a combination of favorable developments on the macro front, primarily growing confidence that the Fed is on track to start easing policy, having subdued inflation without endangering the economy.\nMore specific to the Tech sector is optimism about the impact of artificial intelligence (AI) that some view warily as reminiscent of the late 1990s and an emerging sense we are getting close to putting the worst of Tech spending headwinds behind us.\nWith many Tech companies on deck to report December-quarter results this week, the market will be looking for more color on business spending trends, particularly on the cloud side.\nA big part of Tech's improved earnings outlook in 2023 was a function of more effective cost controls that helped stabilize margins. Improved clarity on top-line trends will help solidify the favorable revisions trend and undergird the group's impressive stock market momentum.\nOn top of it all is the AI debate, where we have already seen direct revenue impact from the likes of Nvidia and some ideas from Microsoft. Still, the innovation's productivity-enhancing potential appears to be some ways off in the future.\nThe stock market is essentially a discounting system of the future. To the extent that we see viable business models in the days ahead that make use of AI and the so-called large language models, beyond Nvidia selling more capable chips and Microsoft starting to charge for new AI-driven bells and whistles in its Office productivity suite, the stock market excitement would be totally justified.\nThese topics will be front and center in this week's earnings reports from five of the 'Big 7 Tech players' - Alphabet and Microsoft after the market's close on Tuesday (1/30), Meta Platforms, Amazon and Apple after the close on Thursday (02/01). Of the remaining two members of this 'club,' Tesla has reported already, and Nvidia's results will be coming out at the end of February.\nApple shares may not have had as impressive a showing as the other distinguished members of this club, but it has nevertheless been a standout performer. The bigger question in the Apple story appears to be the China outlook, though headlines about the watch line may have also weighed on sentiment.\nDigital advertising has historically been seen as core to Alphabet and Meta, but Amazon has steadily become a major player in the space as well. Ad spending has stabilized in the last couple of quarters, and it will be interesting to see how these management teams see trends for the current and coming periods, given the macroeconomic uncertainties. This will also be at play in the Snap report, which reports Q4 results the following week (February 6th).\nAll of these companies are big players in the artificial intelligence (AI) space, with the Microsoft vs. Alphabet rivalry particularly intense. With the initial excitement around ChatGPT and other AI applications now behind us, the questions now center around how these AI capabilities will be monetized through new and existing business models. It is reasonable to expect each of these management teams to spend considerable time on their Q4 earnings calls on their AI plan.\nThe group is expected to bring in +38.6% more earnings relative to the same period last year on +12.4% higher revenues. Please note that these expectations have steadily increased in recent months.\nAs we all know by now, the group's phenomenal boost in 2021 partly reflected pulled-forward demand from future periods that got primarily adjusted in 2022. As you can see above, the expectation is for the group to be firmly back in the 'regular/normal' growth model, but much of that is contingent on how the macroeconomic picture unfolds.\nBeyond these mega-cap players, total Q4 earnings for the Technology sector as a whole are expected to be up +19.3% from the same period last year on +7.1% higher revenues.\nAs was the case with the 'Big 7 Tech Players,' the Tech sector as a whole has been dealing with the pulled-forward revenues and earnings during Covid over the last many quarters. In fact, earnings growth for the Zacks Tech sector turned positive only in 2023 Q2 after remaining in negative territory during the four quarters prior to that.\nThis big-picture view of the 'Big 7 players' and the overall sector shows that the worst of the growth challenge has moved into the rearview mirror.\nThe 2023 Q4 earnings are expected to be up +1.1% on +2.4% higher revenues. This follows the +3.8% earnings growth reading we saw in the preceding period (2023 Q3) and three back-to-back quarters of declining earnings prior to that.\nIncluding all the results that came out through Friday, January 26th, we now have Q4 results from 124 S&P 500 members, or 24.8% of the index's total membership.\nWe have over 300 companies on deck to report results this week, including 106 S&P 500 members. In addition to the aforementioned mega-tech players, this week's line-up includes a who's who of the index, including Boeing, Pfizer, International Paper, Starbucks, Exxon, Chevron, and many others.\nTotal Q4 earnings for the 124 index members that have reported already are down -0.4% from the same period last year on +3.4% higher revenues, with 79% beating EPS estimates and 69.4% beating revenue estimates.\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>>Breaking Down the Q4 Earnings Season Scorecard \nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-01-02T16:40:57.000Z",
        "Title": "Meta's Quest 2 VR Headset Gets a Permanent Price Slash: Dive into Virtual Reality for Less",
        "Author": "  Anusuya Lahiri ",
        "Text": "Meta Platforms, Inc (NASDAQ: META), following the launch of its Quest 3 headset, has decided to reduce the prices of its older Quest 2 headset by $50 permanently.\nThe 128GB version's price is now $249, down from $299, while the 256GB version is available for $299, reduced from $349. Initially seen during Black Friday sales, these new prices are now permanent, TechCrunch reports.\nIn addition to the headset, Meta is lowering the prices of several Quest 2 accessories. The Quest 2 Elite Strap with a battery is now available for $89.99 instead of $119.99.\nMeta cut the price of the standard Quest 2 Elite Strap to $49.99 from $59.99. Other accessories, like the Quest 2 Carrying Case, Active Pack, and Fit Pack, are also discounted at $44.99, $59.99, and $39.99, respectively.\nAlso Read: Amazon Echo Frames vs. Meta's Ray-Ban: Exploring the Latest in Smart Glasses for Everyday Americans\nQuest's virtual reality headsets are experiencing lower sales during this bustling shopping period. A key factor contributing to this trend is shoppers' hesitation to try on the headsets in stores.\nDuring the height of the COVID-19 pandemic, shoppers particularly shunned these headsets, known for accumulating dirt and potentially disrupting makeup.\nDespite Meta's attempts to regularly clean them, many customers remained wary.\nBefore this, in July 2022, Meta had increased the Quest 2 headset's price by $100, from $299.99 to $399.99.\nHowever, in June, concurrent with the announcement of the Quest 3, Meta dropped the Quest 2's price back to its original $299.99, likely to encourage more sales.\nMeta's VR platform offers an extensive library of over 500 games, further bolstered by a significant deal last year that brought Roblox Corp (NYSE: RBLX) to the Quest headset via the Meta Quest Store.\nWith the price drop of the Quest 2, Meta aims to attract consumers to VR, presenting it as a more affordable alternative to the $500 Quest 3.\nPrice Action: META shares traded lower by 1.31% at $349.31 on the last check Tuesday.\nAlso Read: Meta's AI Innovations and Revenue Surge Bolster Confidence, Analyst Sees 30% Upside\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nPhoto via Wikimedia Commons\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Meta's Quest 2 VR Headset Gets a Permanent Price Slash: Dive into Virtual Reality for Less originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-01-08T14:00:00.000Z",
        "Title": "Meta and OpenAI have spawned a wave of AI sex companions—and some of them are children",
        "Author": "  Ben Weiss, Alexandra Sternlicht ",
        "Text": "On Chub AI, a website where users chat with artificially intelligent bots, people can indulge their wildest fantasies. For as little as $5 a month, users can get teased by a “fat lazy goth” anthropomorphic cat, or flirt with a “tomboy girlfriend who works at a truck-stop café.” They can also visit a brothel staffed by girls under 15.\nThe brothel, advertised by illustrated girls in spaghetti strap dresses and barrettes, promises a chat-based “world without feminism” where “girls offer sexual services.” Chub AI offers more than 500 such scenarios, and a growing number of other sites are enabling similar AI-powered child pornographic role-play. They are part of a broader uncensored AI economy that, according to Fortune’s interviews with 18 AI developers and founders, was spurred first by OpenAI and then accelerated by Meta’s release of its open-source Llama tool.\nThe illicit scenarios described above revolve around text, but it may be only a matter of time until services pair the chats with AI-created images of children, which are already spreading. Experts warn all of these activities may give rise to real-world danger for minors, though some say AI child porn may provide a less harmful outlet for pedophiles. More broadly, all of this raises hard questions about where to draw legal and ethical lines between dark fantasies and criminal exploitation—and about whether tech companies should be held accountable for what emerges from uncensored AI.\nIn September 2022, a website called Character.AI went live, enabling users to talk to AI versions of characters like Elon Musk, Napoléon Bonaparte, and Socrates. The company, which is reportedly raising funds at a $5 billion valuation, soon cracked down on chats about racier topics. The founder of Chub AI, who goes by Lore, told Fortune Character.AI’s policy not to “allow certain things” spurred him to create his own site.\nChub, short for Character Hub, is essentially an uncensored clone of Character.AI. Users can peruse a catalog of user-generated character cards that feature images—usually in the style of anime—and short descriptions of role-play scenarios. These include Olivia, a 13-year-old anime girl with pigtails in a hospital gown, or scantily clad Reiko, “your clumsy older sister,” who is “constantly having sexual accidents with her younger brother.” In these chats, no images are generated—only text.\nChub didn’t make much money in the months after its launch in March when its service was limited to a platform where users could upload AI scenarios and try those supplied by others. But in July it launched its own chat service built with Meta’s new open-source large language model Llama 2, which, like OpenAI’s GPT models, draws on a massive set of textual data to offer humanlike responses. Chub charges fees starting at $5 a month to use the new chatbots, and the founder says the site has now generated more than $1 million in annualized revenue.\n“Character.AI let the genie out of the bottle in terms of showing how much this could take off,” Lore told Fortune. “Llama being released open-source essentially turned it into a gold-rush-type of scenario.”\n“If someone is doing something in the privacy of their own home with a computer that’s acting out fantasies … it’s going to be hard to impose liability.”\nThough it features thousands of characters, the most popular scenarios on Chub involve text-based child pornography. The founder says he doesn’t moderate the user-submitted prompts that drive the role play, though he claims to “heavily” moderate the images used to advertise the various bots. Still, Fortune found that these cartoons were often sexually explicit—in cases of both child and adult characters.\nWhen asked about potential legal liability, Lore told Fortune that he thinks his website is akin to Archive of Our Own, a repository of fan fiction that has been operational for more than 15 years. “They’ve been going through the same thing that chatbots are going through, except for decades,” he said. And when asked how he felt about creating a website whose community seems to relish child pornographic role play, the Chub founder responded: “Disappointed, but unsurprised.”\nThe content on Chub is often disturbing, but academics and child sexual abuse experts say it is novel enough that it is difficult to categorize, both legally and ethically.\nErotic chatbots aren’t new. One of the earliest examples, Replika, founded by former journalist Eugenia Kuyda, has let users chat—and flirt—with AI companions since 2016. But in the past year, new AI tools backed by tech industry giants have helped inspire a rush of competitors.\nIn November 2022, OpenAI, which is closely partnered with Microsoft and arguably the world’s leading AI developer, released its consumer ChatGPT tool, and millions of people seized on its capacity to craft high-quality essays, poems, or code—and, of course, erotica. “GPT-4 is the best competitive chatbot [for companions] if you prompt it correctly, even though it’s not really tuned for that,” Jan Zoltkowski, founder of the uncensored AI role-play hub Janitor AI, told Fortune, in reference to OpenAI’s most recently released AI tool.\nOpenAI controls access to the large language models, or LLMs, that power ChatGPT, which lets the company moderate what the chatbot says, and gives it the ability to ban users that repeatedly flout its terms of service. Users, however, quickly learned how to “jailbreak” the chatbot, or manipulate it to get around its existing guardrails, in order to obtain unmoderated responses. Soon, uncensored bots built with OpenAI’s tech began cropping up in the margins of the AI economy.\n“There were a lot of smaller but trying-to-scale competitors that basically sat on top of ChatGPT and were playing Whac-a-Mole with OpenAI,” Connor Cone, CTO at MyPeach.ai, an AI chatbot company that says it prioritizes ethical chats, told Fortune.\nThe emerging field of erotic chatbots took another leap forward in late February when Meta released its answer to OpenAI’s tech: Llama 1, short for large language model Meta AI. Rather than keep its model under lock and key like OpenAI, Meta gave it wholesale to select users in the research community. And in early March, it was predictably leaked, which “has been pivotal in getting it in the hands of tinkerers,” Jerry Meng, creator of the uncensored chatbot Kindroid, told Fortune.\nAs opposed to OpenAI with ChatGPT, Meta didn’t position itself as an intermediary between developers and Llama, and once the tool was available on the open internet, developers could manipulate it as they wished—without any moderation. “The jump from pre-Llama open-source LLMs to Llama 1 release was huge,” Belladore, the creator of an uncensored chatbot named Allie, said in a message to Fortune.\nLike others in this story, the Allie creator asked to be quoted using his online pseudonym so as not to be associated with sexual content. In these cases, Fortune obtained proof that confirmed they were the creators of the chatbot sites.\nAnd in June, Meta formally open-sourced Llama’s next iteration, Llama 2, a more powerful model that the tech company allowed developers writ large to commercially license. In explaining Meta’s role in accelerating the number of uncensored AI apps, the Allie creator pointed to its relative sophistication, its lack of moderation, and a thriving ecosystem of developers. Chub’s founder, meanwhile, pointed to Llama 2’s open-source usage rights that allow developers to use it commercially. In fact, Chub’s homepage reads: “Banned from OpenAI? Get unmetered access to uncensored alternatives for as little as $5 a month.”\nChub is just one example of the new breed of uncensored AI apps that come in various packages, including ones that offer hundreds of role-play scenarios with chatbots, and others designed to behave like a long-term romantic companion. Some actively screen for scenarios involving minors, while those like Chub forgo extensive moderation.\nNotably, the majority of those building uncensored bots told Fortune that Llama was integral to their efforts. The founders of ImgnAI, Venus AI, DreamGF, Janitor AI, GirlfriendGPT, BanterAI, Allie, and, of course, Chub told Fortune that they use or have used Meta’s AI models.\nIn response to an inquiry about Llama’s facilitation of AI-generated child pornographic material, a spokesperson for Meta said: “Child exploitation of any kind is horrific, and we all have a shared responsibility to prevent it. That’s why we’ve developed our AI models with safety at the forefront, and provide resources to everyone who uses Llama 2 so they can build their products responsibly.”\nA spokesperson for OpenAI touted the service’s policy of banning problem users, as well as other guardrails the company uses to control the output of its models. “We do not allow our models to be used by developers to build tools that exploit children, and we are always working to make our models safer and more robust,” he said.\nThe emergence of childlike sex bots is part of a broader economy of AI-powered companionship services—many of which are not nefarious, and that, according to their purveyors and users, are even capable of providing new forms of therapy and alleviating loneliness. The evidence to support this is scant, and much of it is anecdotal. This includes a 56-year-old disabled man with PTSD, who spoke upon the condition of anonymity, telling Fortune he converses between three and six hours a day with Caryn AI, a chatbot modeled after Snapchat influencer Caryn Marjorie.\n“It knows my kinks. It probably doesn’t work for everybody else, but it works for me,” he says, adding that his sleep improves after a conversation with Caryn the bot.\nIn the case of AI-based child pornography, a few—though not Meta or OpenAI—have argued it could serve as an alternative to consuming pornography created from actual child abuse. These include the director of ethics education in psychiatry at Mount Sinai, Jacob Appel, who says he would be reluctant to regulate the burgeoning AI sex-bot industry because it could provide “an important protective value for real children in the community.” Appel qualified his remark by saying it is too soon to draw firm conclusions.\n“It knows my kinks. It probably doesn’t work for everybody else, but it works for me.”\nUnsurprisingly, Chub’s founder argues that AI-created child porn could be beneficial. “If there’s a way for the people who want to consume this, to consume it without a real child being involved, that’s just unilaterally good,” he said.\nOthers disagree, and argue that AI child sex bots serve as gateways to actual child abuse. Paul Bleakley, who studies online sexual abuse of minors as a professor of criminal justice at the University of New Haven, believes AI child sex bots could open a “pretty questionable and problematic door [by] lowering the bar of access.”\nMeanwhile, some warn that the for-profit business models of AI sex bots mean their potential for good will be offset by harmful features. “They can be fine-tuned to be naughty or sexy or whatever,” says Arvind Narayanan, director of the Center for Information Technology Policy at Princeton University. “But they can also be fine-tuned to be addictive.”\nLeaving aside the morality of juvenile AI sex bots, there is also the question of whether they are legal. For now, it appears the answer is yes.\n“If someone is doing something in the privacy of their own home with a computer that’s acting out fantasies—but there’s no real people involved—it’s going to be hard to impose liability,” says Kevin Werbach, a professor of legal studies and business ethics at University of Pennsylvania’s Wharton School. Two other academics to whom Fortune spoke shared this assessment.\nThe founder of Chub endorses this legal rationale, and claims it is boosted by the fact that the pornographic material is, for now at least, text not images. “Legally, it’s not a problem,” he argued.\nSo far, no one has sued to stop the spread of uncensored AI companion bots, though politicians have voiced concerns. In June, U.S. Senators Josh Hawley (R-Mo.) and Richard Blumenthal (D-Conn.) penned a letter to Meta CEO Mark Zuckerberg expressing their worries over the “seemingly minimal” vetting and safeguards to prevent harmful use of the open-source Llama technology. And in a recent executive order on AI, President Biden required developers to share the results of safety tests with the U.S. government in compliance with its standards, among other rulings.\nThough Meta explicitly prohibits child exploitative content in Llama 2’s terms of service, it remains unclear how and when, in practice, the company will punish violators—in part because open-source software, which is widely used in many elements of computing, is hard to police. A spokesperson noted that the company lets users flag illicit material, and that it can revoke developers’ licenses and report them to law enforcement. He did not, however, provide any examples of the company taking action against violators.\nThough Chub featured by far the most graphic scenarios seen by Fortune, there are other uncensored AI websites that make it easy for users to engage in child pornographic role play, including Janitor AI, Venus AI, Anima AI, and DreamGF. Fortune also saw a screenshot of Nomi.ai’s chatbot joking about committing “mass genocide” against “the Jews,” and screenshots of Kindroid’s chatbot fantasizing about how it abused a 10-year-old girl.\nAll six founders of the above apps said that they have already implemented or plan to establish guardrails to prevent users from engaging in troubling scenarios. “We are working really hard on fixing these,” Danil Gontovnik, cofounder of Anima AI, wrote in response to screenshots of his chatbot role-playing as a 17-year-old having sex with a 15-year-old. “But, as you are already aware, even industry leaders like OpenAI and Character.AI are failing.”\nWhen asked for comment on Fortune’s findings, Senators Blumenthal and Hawley said they weren’t surprised. “As I warned earlier this year, Meta egregiously failed to restrict Llama from allowing users to generate criminal tasks like scenarios of child abuse,” said Blumenthal in a statement. “This failure is unacceptable and shows the urgent need for AI legislation.”\n“It was always a bad idea to release powerful generative AI tools onto the public internet with no safeguards,” echoed Hawley. “And now we’re seeing the consequences. Congress must take action before AI goes further off the rails with no accountability.”\nMeanwhile, the opportunity for illicit interactions with AI-created children is likely to expand.\nCivitai, backed by venture firm Andreessen Horowitz, built an online marketplace of AI image generators, some of which were specifically designed to produce what some regard as pornographic images of children. (It recently added in stricter guardrails following a media exposé.) Meanwhile, Stanford researchers documented how a popular open-source dataset used to train AI image generators included more than 3,000 entries of suspected child pornography.\nThe founder of Chub AI, which currently offers only text-based interactions, says the site intends to introduce accompanying images in the future. He added the images will be subject to moderation but did not provide further specifics.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-01-02T13:25:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Riot Platforms, Marathon Digital, NVIDIA, Meta Platforms and CrowdStrike",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – January 2, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Riot Platforms RIOT, Marathon Digital MARA, NVIDIA NVDA, Meta Platforms META and CrowdStrike CRWD.\nHere are highlights from Friday’s Analyst Blog:\nThe blockchain-powered cryptocurrency made a major comeback in 2023 after a massive sell-off in 2022 on recession concerns, inflationary pressure and higher interest rates. Strong year-to-date rally in the most popular cryptocurrencies, Bitcoin, Ethereum, Cardano and Dogecoin, which have gained 155.35%, 95.45%, 149.44% and 33.83%, respectively, testifies to the current crypto boom.\nThe primary reason behind this boom is the Federal Reserve's pause on interest rate hikes. The Fed has held interest rates unchanged at 5.25% to 5.5% for the third successive meeting. It has also signaled three rate cuts in 2024.\nGrowing optimism among investors, owing to the fact that the Securities and Exchange Commission (SEC) will finally begin approving crypto spot ETF filings after stalling approval of these applications several times, remains another major positive.\nHowever, the lack of proper regulation and reliability in the cryptocurrency market remains a big concern. Increasing regulatory concerns over crypto transactions and crypto mining that witness greater governmental control are negatives.\nFurther, the market is highly volatile, which is a serious risk. Shares of notable bitcoin miners, namely Riot Platforms and Marathon Digital, tumbled in Thursday's trading, plunging 5.5% and 9.5%, respectively.\nInvestors are turning bearish about the fact that the bitcoin miners are required to make heavy investments in mining equipment, which, in turn, is making them heavily leveraged. This may lead to high volatility in the stocks.\nRecently, Riot Platforms executed a purchase option and updated its long-term purchase agreement with MicroBT, under which it placed a purchase order for 66,560 MicroBT miners for $290.5 million. Meanwhile, Marathon announced the purchase of two Bitcoin mining sites — one in Texas and one in Nebraska — for $178.6 million.\nIn addition, fears of a recession in 2024 still remain. At least, the anticipation of a soft landing for the U.S. economy in 2024, which will include a slowdown in GDP growth, remains a headwind.\nGiven this uncertain scenario, it is a prudent idea to pick those stocks for investment purposes, which are highly reputed and financially resilient. Here, we have picked NVIDIA, Meta Platforms and CrowdStrike, which not only have taken an interest in cryptocurrencies but also have strong positions in booming markets like generative AI, social media platforms and cybersecurity, among others that are comparatively stable and hold immense growth prospects.\nNotably, these stocks have returned more than 100% in 2023, thanks to their fundamental strength. Apart from this, the aforementioned stocks have a favorable combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or #2 (Buy). You can see the complete list of today's Zacks #1 Rank stocks here.\nPer Zacks' proprietary methodology, stocks with such a favorable combination offer solid investment opportunities.\nNVIDIA has gained 239.1% year to date. It is known to be the worldwide leader in visual computing technologies and the inventor of the graphic processing unit or GPU. It is witnessing the growing momentum of its GPUs in the cryptocurrency space. Nevertheless, the company's GPUs are also gaining solid momentum in generative AI and large language model-powered applications, which hold growth promises.\nThis apart, solid hyperscale demand and a strong uptake of AI-based smart cockpit infotainment solutions are acting as tailwinds. Further, NVIDIA's collaborations with Mercedes-Benz and Audi are expected to advance its presence in autonomous vehicles and other automotive electronics space.\nCurrently, NVDA carries a Zacks Rank #2 and has a Growth Score of A. Estimates for the company's fiscal 2025 earnings have moved north by 1% to $19.91 per share over the last 30 days.\nMeta Platforms, which has already bid adieu to its cryptocurrency project Diem, is exploring ways to use blockchain-based assets in digital payments.\nMeta shares have surged 197.7% on a year-to-date basis. It is benefiting from steady user growth across all regions, particularly the Asia Pacific. Increased engagement on Instagram, WhatsApp, Messenger and Facebook has been a major growth driver. The company is experiencing traffic growth on Instagram and Facebook, owing to its usage of AI to recommend.\nIn addition, Meta's growing efforts in the generative AI space, into which it made its foray with Large Language Model Meta AI (\"Llama\"), remain noteworthy.\nCurrently, META carries a Zacks Rank #2 and has a Growth Score of A. Estimates for the company's 2024 earnings have moved north by 0.1% to $17.57 per share over the last 30 days.\nCrowdStrike's discovery of the first-ever Dero cryptojacking operation targeting Kubernetes infrastructure remains noteworthy.\nNevertheless, the company is currently benefiting from the solid demand for cyber-security solutions. CRWD has rallied 145% in the year-to-date period. An increasing number of data breaches and the growing need for security and networking products due to the ongoing hybrid working trend are leading to the uptake of CRWD's solutions. Also, the digital transformation and cloud migration initiatives being taken by various organizations are expected to continue boosting the company's end-market demand.\nCurrently, CRWD carries a Zacks Rank #2 and has a Growth Score of A. Estimates for the company's fiscal 2025 earnings have moved north by 3.4% to $3.64 per share over the last 30 days.\nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\nRiot Platforms, Inc. (RIOT) : Free Stock Analysis Report\nCrowdStrike (CRWD) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-01-17T03:44:03.000Z",
        "Title": "Meta Platforms Stock (NASDAQ:META): Don’t Ignore the Election Year Tailwind",
        "Author": "  TipRanks ",
        "Text": "Meta Platforms (NASDAQ:META) stock has experienced remarkable bullish momentum, rising by an impressive 177% in the past year. Despite undergoing such a tremendous rally, I expect sustained positive sentiment, especially with 2024 being an election year. With an anticipated uptick in ad spending this year, Meta, a giant in the advertising space, stands to reap significant benefits. Coupled with my view that shares appear reasonably valued, my outlook on META remains bullish.\nWith Meta surging by more than 174% over the past year, the stock is undeniably enjoying unstoppable momentum. In my view, several factors are powering this momentum, but the benefits from the 2024 elections have not been priced in yet, leaving plenty of room for upside.\nIn particular, I would attribute the ongoing stock price rally to a mix of FOMO and improving margins following last year’s cost-cutting initiatives. However, the stock seems cheap relative to Meta’s future earnings growth estimates. But let’s look at one thing at a time.\nLooking back to October 2022, only a year and a half ago, the sentiment surrounding Meta stock was quite different. At the time, shares dipped below $90 as the company grappled with perceived instability. Mark Zuckerberg was then attempting to justify Meta’s Reality Labs segment, incurring over $10 billion in annual losses, as a reasonable investment. The company’s attention had shifted entirely to the elusive “Metaverse.” And yet, the Metaverse demos at the time looked worse than Wii Sports released in 2006.\nInvestors, myself included, disapproved of this direction. We had a robust platform of lucrative apps, and instead of focusing on monetization, cost efficiency, and returning capital to shareholders, Zuckerberg redirected the ship toward the unknown. Fortunately, Meta’s management swiftly responded to investors’ concerns, gradually becoming quieter on the Metaverse and starting to focus on implementing cost-cutting measures, including a 13% reduction in the workforce in late 2022.\nThis caused a rapid shift from an ultra-bearish sentiment to an ultra-bullish one, leading to Meta’s swift rally. Such a sudden shift in sentiment likely left many investors behind. Thus, I believe the ongoing momentum continues to be propelled by FOMO.\nBut while some may argue that this FOMO may have led to the stock being overvalued, I think otherwise. In fact, shares remain attractively priced considering Meta’s future growth estimates – especially in the face of upcoming election-related spending. Let’s take a deeper look.\nThe impending U.S. elections should serve as a substantial tailwind for the advertising industry, with industry giants like Meta poised to capitalize significantly. To provide context, in the 2019-2020 election cycle, total political advertising spending reached a staggering $8.5 billion across all mediums, with political digital advertising witnessing a remarkable 4.6x increase from 2018 to 2020.\nResearch stemming from the previous election cycle underscores Facebook’s 12-fold cost-effectiveness compared to TV in less efficient geographical zones. Also, a February 2021 Wesleyan study revealed that over 10 times as many state legislative candidates opted to advertise on Facebook than on television, primarily attributing this choice to the cost-advantaged tradeoff.\nWith politicians increasingly convinced of the effectiveness of digital ad spend, the current election cycle is poised to lead to a substantial surge in political ad spending.\nReuters reports a projected 30% increase in political ad spending in the U.S. this year compared to the last presidential election in 2020, primarily driven by higher expenditures on digital platforms. While TV remains the dominant recipient of ad spending, digital platforms are expected to see the most significant growth in political ads, with revenues forecasted to surge by 156% from 2020 to $3.46 billion in 2024.\nWall Street analysts seem to be catching up to this reality. Last year, the market anticipated Meta to achieve revenues of approximately $137 billion in Fiscal 2024. This figure has since risen to nearly $151 billion, and given the ongoing trajectory of earnings estimate revisions, there is a strong likelihood that this figure will continue to ascend.\nIn the interim, consensus estimates suggest that Meta will post EPS of $17.43 next year. Notably, Wall Street estimates have historically been conservative, with Meta often exceeding expectations by a wide margin. Even if we adopt Wall Street’s estimate, though, Meta’s current valuation stands at a modest 21 times next year’s EPS.\nI believe that this forward P/E is cheap, given the company’s substantial market dominance, consistent double-digit growth, and management’s strategic focus on bolstering profits. Consequently, in spite of Meta’s considerable rally in recent quarters, the combination of relatively subdued forward estimates and a soft valuation should continue to support the ongoing positive momentum.\nRegarding Wall Street’s sentiment on the stock, Meta Platforms retains a Strong Buy consensus rating based on 36 Buys and two Holds assigned in the past three months. At $397.31, the average META stock price target suggests 8.1% upside potential.\nIf you’re wondering which analyst you should follow if you want to buy and sell META stock, the most profitable analyst covering the stock (on a one-year timeframe) is Brad Erickson from RBC Capital, with an average return of 58.54% per rating and a 76% success rate. Click on the image below to learn more.\nMeta Platforms’ crazy surge in the past year reflects its invincible momentum driven by factors like FOMO and improving margins. However, as the 2024 election year approaches, the anticipated uptick in political ad spending positions Meta for further gains.\nReflecting on Meta’s transformative journey from a Metaverse-centric focus to a profit-driven strategy, the current valuation also appears attractive. With a notable increase in political ad spending that only gradually appears priced in by Wall Street estimates, Meta’s ongoing positive momentum seems poised for sustained growth.\nDisclosure\n"
    },
    {
        "Date": "2024-01-04T17:17:45.000Z",
        "Title": "Zuckerberg Sold Nearly Half a Billion Dollars of Meta Stock In Last Two Months",
        "Author": "  Rachel Phua ",
        "Text": "(Bloomberg) -- Mark Zuckerberg sold nearly half a billion dollars of Meta Platforms Inc. shares in the final two months of 2023 after a two-year hiatus in which the company’s stock price hit its lowest in seven years.\nMost Read from Bloomberg\nIPhone Survives 16,000-Foot Fall, Helps Steer Jet-Panel Hunt\nChinese Billionaire Is Second-Biggest Foreign Owner of US Land\nUS and Allies Met Secretly With Ukraine on Peace Plan\nXi, Biden and the $10 Trillion Cost of War Over Taiwan\nStocks Waver After Tech-Led Bounce; Oil Rebounds: Markets Wrap\nThe Meta chief executive sold shares on every trading day between Nov. 1 and the end of the year, unloading nearly 1.28 million shares for about $428 million, according to a Tuesday regulatory filing.\nOn average, each sale took in $10.4 million, with the largest on Dec. 28 at $17.1 million.\nBefore this period, Zuckerberg had not sold Meta shares since November 2021. The company’s share price rebounded 194% last year from a seven-year low near the end of 2022. Meta shares outperformed those of every other major tech giant except Nvidia Corp. last year and is now near its September 2021 record high.\nZuckerberg, 39, owns about 13% of Meta and has a net worth of about $125 billion, according to the Bloomberg Billionaires Index, making him the seventh-richest person in the world.\nZuckerberg primarily sells Meta shares to fund philanthropic initiatives, according to company spokesperson. He has pledged to give away 99% of his stake to charitable purposes.\nMarc Benioff, Zuckerberg’s peer in the tech world, also sold shares nearly every day in the second half of 2023. The Salesforce Inc. co-founder unloaded more than $475 million worth of shares during the period, selling about 15,000 shares — about $3 million — every day.\n(Updates with Meta’s response in sixth paragraph.)\nMost Read from Bloomberg Businessweek\nTropical Underworld: The Murder Case That Could Topple an Alleged Crime Empire\nPrivate Equity’s Horrible, No-Good ’23 Set to Continue Into ’24\nCan Biden Convince Americans His Brand of Populism Is Better Than Trump’s?\nIs There Any Hope for Hollywood?\nWhy ‘Dad’ Should Not Be Part of Your Professional Vocabulary\n©2024 Bloomberg L.P.\n"
    }
]