[
    {
        "Date": "2024-03-06T15:10:00.000Z",
        "Title": "How Meta Platforms Dominates the Internet, Explained in 1 Chart.",
        "Author": "  Jake Lerch, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) dominates the internet. Consider this: Facebook, owned by Meta, has 3.07 billion monthly active users (MAUs). \nThat means three out of every eight people alive today, from 100-year-old great-grandmothers in Peru to six-month-old babies in Cameroon, have a Facebook account.\nWhat's more, Facebook is just one of Meta's online platforms. And when it comes to social media, size really matters as you can see below:\nOf the top four most popular social media networks, Meta Platforms operates three: Facebook, WhatsApp, and Instagram (plus Facebook Messenger in seventh place).\nAll told, Meta's family of apps boasts 8.0 billion MAUs, and while many crossover accounts are included in that total, it's still a jaw-dropping figure.\nIndeed, the sheer scale of Meta's reach helps explain the company's astounding ad revenue. In the fourth quarter of 2023, Meta grew ad revenue 24% year over year to $38.7 billion. Net income more than tripled to $14.0 billion. \nA closely-watched metric for social media companies is average revenue per user (ARPU). Meta's global ARPU rose 21% to $13.12 last quarter. For U.S. and Canadian users, the figure was even higher at $68.44.\nAs a result of its stellar financial results, the company recently initiated a quarterly dividend of $0.50 per share. What's more, Meta repurchased just over $20 billion of its own stock in 2023.\nWith this unmatched network of social media platforms generating high-margin ad revenue, Meta stock has quickly recovered from the multiyear low it hit during 2022's bear market. And even though shares are up over 300% since the beginning of last year, Meta still has plenty to offer long-term investors.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jake Lerch has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nHow Meta Platforms Dominates the Internet, Explained in 1 Chart. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-12T04:16:30.000Z",
        "Title": "Meta Platforms Stock (NASDAQ:META): Expect Controversy, and Stick to Your Plan",
        "Author": "  TipRanks ",
        "Text": "Meta Platforms (NASDAQ:META) is almost constantly a topic of controversy. Should this alter your plan to participate in Meta Platforms’ awesome revenue growth? The choice is yours to make, but I am bullish on META stock and don’t imagine that this Magnificent Seven member will slow down anytime soon.\nAbove all else, Meta Platforms is a social-media platform provider that owns Facebook, Instagram, and WhatsApp, along with Reels and Threads. At the same time, CEO Mark Zuckerberg wants Meta Platforms to be a strong competitor in the Metaverse as well as artificial intelligence (AI).\nYou’ve probably heard about Meta Platforms being the target of regulatory pressure in the U.S. and Europe. This hasn’t stopped META stock from rising over the past several years, though. Yet, there’s a new development that might derail Meta Platforms’ growth story — or maybe not, so let’s get into the details now.\nOverall, the U.S. stock market was a bit shaky today, but it held fairly steady. However, even though Meta Platforms is a “Magnificent Seven” company, its stock wasn’t very magnificent today.\nAs META stock slipped over 4%, investors might have wondered whether Zuckerberg had made a startling announcement. In actuality, however, the source of the consternation on Wall Street came not from Zuckerberg but from a famous political figure.\nSpecifically, former President Donald Trump had some less-than-flattering things to say about Meta Platforms. The main topic of his recent rant was rival social-media platform TikTok, which Trump considered banning when he was president.\nAs I see it, it’s important for investors to be aware of what’s in the news, even if they’re not taking a particular position. So, here’s what happened. According to Reuters, Trump declared that “There’s a lot of good and there’s a lot of bad with TikTok” and that “There are a lot of young kids on TikTok who will go crazy without it.” So, it seems that Trump might not be fully advocating for a TikTok ban right now.\nMore central to today’s topic, however, is Trump’s stance on Meta Platforms’ Facebook. Considering how a TikTok ban would benefit Facebook, Trump asserted, “I’m not looking to make Facebook double the size.” The former president added, “I think Facebook has been very dishonest.”\nThen, Trump kicked it up a notch. As reported by The Wall Street Journal, Trump stated, “I consider Facebook to be an enemy of the people, along with a lot of the media.”\nGoing forward, investors should just assume that Meta Platforms will be a target of controversy. Zuckerberg isn’t known for “playing nice” with regulators. It seems that he would prefer to continue doing what he’s been doing with Meta Platforms and pay any fines that regulators might impose upon the company.\nMeta Platforms has deep pockets, so paying fines isn’t usually a problem. Just take a look at TipRanks’ financials page for Meta Platforms, and you’ll see what I’m talking about. The company grew its revenue from $28.64 billion in the quarter ended March 2023 to $40.11 billion in the quarter ended December 2023.\nSpeaking of growth, Meta Platforms’ position of cash, cash equivalents, and short-term investments increased over the quarters and reached $65.4 billion by the end of last year. Meta Platforms is so flush with cash that the company is now paying dividends.\nNext, I checked Meta Platforms’ earnings page and discovered that the company has consistently grown its quarterly EPS for a year and a half. Furthermore, Meta Platforms has beaten Wall Street’s consensus EPS forecasts for a full year now. Evidently, this social media juggernaut is practically unstoppable when it comes to generating advertising revenue and posting impressive profits.\nOn TipRanks, META comes in as a Strong Buy based on 40 Buys, two Holds, and one Sell rating assigned by analysts in the past three months. The average Meta Platforms price target is $528.80, implying 9.35% upside potential.\nIf you’re wondering which analyst you should follow if you want to buy and sell META stock, the most profitable analyst covering the stock (on a one-year timeframe) is Brad Erickson of RBC Capital, with an average return of 76.56% per rating and a 77% success rate. Click on the image below to learn more.\nA fearful attitude would be: “What if Meta Platforms stock keeps falling?” I prefer to take an opportunistic attitude. If the share price goes low enough due to controversy that won’t destroy Meta Platforms, I’ll certainly consider buying META stock.\nIt’s also possible to buy Meta Platforms shares now and then think about adding to one’s position if the stock continues to fall. After all, heated debates will come and go, but Meta Platforms will continue to make a whole lot of money.\nDisclosure\n"
    },
    {
        "Date": "2024-03-04T14:00:16.000Z",
        "Title": "Meta Platforms, Inc. (META) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Meta Platforms (META) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nOver the past month, shares of this social media company have returned +5.8%, compared to the Zacks S&P 500 composite's +4.8% change. During this period, the Zacks Internet - Software industry, which Meta Platforms falls in, has gained 12.7%. The key question now is: What could be the stock's future direction?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Meta Platforms is expected to post earnings of $4.27 per share, indicating a change of +61.7% from the year-ago quarter. The Zacks Consensus Estimate has changed +18.6% over the last 30 days.\nThe consensus earnings estimate of $19.94 for the current fiscal year indicates a year-over-year change of +34.1%. This estimate has changed +12.5% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $23.09 indicates a change of +15.8% from what Meta Platforms is expected to report a year ago. Over the past month, the estimate has changed +14.4%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Meta Platforms is rated Zacks Rank #1 (Strong Buy).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nIn the case of Meta Platforms, the consensus sales estimate of $36.07 billion for the current quarter points to a year-over-year change of +25.9%. The $158.75 billion and $179.75 billion estimates for the current and next fiscal years indicate changes of +17.7% and +13.2%, respectively.\nLast Reported Results and Surprise History\nMeta Platforms reported revenues of $40.11 billion in the last reported quarter, representing a year-over-year change of +24.7%. EPS of $5.33 for the same period compares with $3 a year ago.\nCompared to the Zacks Consensus Estimate of $38.99 billion, the reported revenues represent a surprise of +2.87%. The EPS surprise was +10.35%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nMeta Platforms is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Meta Platforms. However, its Zacks Rank #1 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-11T09:14:00.000Z",
        "Title": "Is Meta Platforms Stock a Buy Now?",
        "Author": "  Neil Patel, The Motley Fool ",
        "Text": "The terrible market environment in 2022, coupled with investor pessimism surrounding founder and CEO Mark Zuckerberg's metaverse ambitions, hurt Meta Platforms (NASDAQ: META) that year. Share prices fell an eye-watering 64% in 2022.\nThis top social media stock has been on an absolute tear since that 2022 low thanks to strong financial results and a raging bull market. As a result, the stock price has skyrocketed 321% since the end of 2022. And yet, even with that sizeable stock price performance, the shares still look like a smart buy today.\nHere's why.\nThere's no doubt that Meta has to be one of the best-performing stocks since the start of 2023. Even with this huge gain, Meta shares trade at a forward price-to-earnings ratio of 25.6. That represents a discount when compared to the 30.4 average forward P/E from the tech-heavy Nasdaq-100 index.\nAccording to Wall Street analyst estimates, the company is set to grow revenue and earnings per share at compound annual rates of 14% and 21.3%, respectively, over the next three years. While it's smart to take forecasts with a grain of salt, this outlook makes it incredibly easy to be bullish.\nMeta's valuation looks even more compelling when you consider just how dominant this business is. Three of the company's social media platforms -- Facebook, WhatsApp, and Instagram -- are ranked in the top 4 spots globally for overall users. A fourth platform, Messenger, is ranked seventh. Combined, these four apps have a whopping 4 billion-plus monthly active users. And that total increased by 6% year over year in 2023's Q4.\nAlmost half of the global population interacts with a Meta internet property at least once per month. No other enterprise has this kind of reach.\nFrom a competitive standpoint, Meta benefits from incredibly powerful network effects thanks to these various social media apps, making it very hard for a competing service to gain any meaningful adoption (although ByteDance's TikTok is trying hard to do so).\nGiven the attention and engagement these apps command, it provides Meta with a significant data advantage. Meta has leveraged this data advantage to become a leader in digital advertising (which relies on getting targeted advertising to the right viewership). Advertisers want to do business on a platform that can give them great value for their ad spending. This helped Meta pull in $132 billion in revenue in 2023 (accounting for 98% of the company's overall revenue).\nMeta's business model ensures it has high margins if it can keep its costs under control. Meta's 2023 operating margin of 35% helped drive $43 billion of free cash flow generation. Such margins are the norm for this company. Those margins helped Meta produce $122 billion of operating cash flow in the past two years. Totals that high exceed the total valuation of all but the largest companies out there. As of Dec. 31, the business carried a net cash position of $47 billion on its balance sheet, giving it plenty of spare cash to continue investing aggressively in its CEO's metaverse goals.\nStrong finances have also allowed Meta to return capital to shareholders in the form of stock buybacks and dividends. In the last 12 months, it spent $20 billion on reducing the outstanding share count. With its most recent financial report, Meta announced a $0.50 per share quarterly dividend that might entice income-seeking investors.\nConsidering its attractive valuation, dominant social media reach, and stellar finances, you will find no shortage of reasons why Meta is a smart stock to consider buying right now.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 8, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nIs Meta Platforms Stock a Buy Now? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-01T17:00:00.000Z",
        "Title": "Meta Platforms Has Spent $46 Billion on the Metaverse Since 2021, But It's Spending Twice As Much on This 1 Thing",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) has invested a huge sum of cash into developing its virtual and augmented reality technology and the software and social platforms to support its hardware. Unfortunately, the business doesn't have much to show for it so far.\nReality Labs, the division of Meta housing its metaverse technology, generated a total of $6.3 billion in revenue over the past three years. That's resulted in an operating loss of $40 billion. And management expects 2024's operating loss to exceed the $16 billion it lost last year. That's a phenomenally large bet on the future of computing.\nWhile Meta Platforms' detractors decry the amount of spending Mark Zuckerberg and his team are putting into developing virtual and augmented reality platforms, investors shouldn't overlook the fact that it's spent about twice as much on something else entirely over the past three years.\nSince 2021, Meta Platforms has bought back $92 billion worth of its own stock. As of the end of 2023, it had $31 billion available and authorized for repurchases, and it added another $50 billion to that authorization at the start of February.\nMeta's massive step-up in share repurchases over the past three years is an indication of the strength of its operations and balance sheet.\nMeta generated $43 billion in free cash flow in 2023. That's a huge bounce-back from the $18.4 billion it generated in 2022 and up from the $38.4 billion generated in 2021. 2022 was a bit of an anomaly for Meta, as a pullback in advertising spending combined with Meta's massive increase in capital expenditures curbed its financial results. However, the return to growth in 2023 indicates the long-term strength of Meta's business.\nImportantly, Meta's capital expenditures are mostly related to its Family of Apps business, not Reality Labs. It's spending on data centers and servers is for its artificial intelligence, which powers everything from its ads business to its content recommendation algorithm. Reality Labs spending is mostly tied to research and development (R&D).\nR&D spending has consistently climbed higher, but has largely stayed in line with revenue. That said, Meta spends more as a percentage of revenue on R&D than its peers. But with a strong operating margin, that shouldn't be a concern for investors.\nAll this means Meta's ability to invest in the future, including things like the metaverse and AI, doesn't curb its ability to return cash to shareholders through repurchases and its newly initiated dividend.\nDespite numerous challenges, Meta has been able to stave them off and continue growing free cash flow over time. There's very little chance that will change anytime in the foreseeable future.\nMeta's network effect offers a protective moat. It counts nearly 4 billion monthly active users across its family of apps. That locks people into its apps, even when competitors pop up. We've seen Meta counteract the effect of new forms of entertainment (Stories, TikTok, etc.) by simply integrating similar features into its app and leveraging its network effect.\nContinually improving its products, including its advertising products, requires a lot of investments. Still, Meta has shown strong operating margin expansion, and it should continue to show operating leverage over the next few years as it ramps up monetization of Reels, its TikTok competitor (which has been a drag on its results until recently).\nWhile Meta's spending heavily on the metaverse, especially relative to the amount of revenue it currently produces, it's not spending an unreasonable amount. If it turns out to be the next major computing platform, as Zuckerberg thinks it will, the investment will prove well worth it. And given that it's growing its free cash flow, returning boatloads of cash to investors, and still spending enough to keep growing its core Family of Apps business, investors should remain optimistic about the future.\nEven after shares have climbed to start the year, the stock trades for just 25 times forward earnings. With its massive share repurchase plans and strong outlook, it's worth paying the premium over the S&P 500 for the tech giant.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of April 1, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adam Levy has positions in Meta Platforms. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Platforms Has Spent $46 Billion on the Metaverse Since 2021, But It's Spending Twice As Much on This 1 Thing was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-23T11:05:00.000Z",
        "Title": "Meta Platforms Is Up 40% This Year. Here's Why It's Still a Fantastic Buy",
        "Author": "  Keithen Drury, The Motley Fool ",
        "Text": "The average return of the S&P 500 over the long term is about 10% per year. So, many times, when a stock returns 40% or more within a year, investors will immediately throw up their red flags. Some will sell, and others refuse to buy, but looking solely at the stock's return is a terrible way to judge whether it's a buy.\nIf you do that, you'll miss out on many of the market's biggest winners: Nvidia and Super Micro Computer have had an amazing run since the start of 2023; yet, if you sold when you were up 40%, you missed out on massive, portfolio-changing returns.\nMeta Platforms (NASDAQ: META) is in this boat as well. The stock is up 40% in 2024 and over 300% since the start of 2023. But despite that success, I think it still has room for more.\nMeta Platforms is likely better known by its old name: Facebook. Its primary business is advertising, which is done through its Family of Apps: Facebook, Instagram, WhatsApp, Messenger, and Threads. In 2022, the stock was beaten down because it was burning cash by heavily investing in its Reality Labs division, which focuses on next-generation technologies, such as augmented reality (AR), virtual reality, and the metaverse.\nBack then, these were mostly luxury gaming technologies that didn't really serve a purpose. But with artificial intelligence (AI) proliferation, CEO Mark Zuckerberg's vision is becoming a bit clearer.\nMeta is working on a game-changing AI called Ego, which will eventually integrate into AR glasses. This could be used for tasks like teaching people how to cook or communicating with those who don't speak the same language as us.\nIf this endeavor succeeds, Meta's stock could become an absolute rocket ship and easily add billions in sales.\nHowever, as this moonshot division develops products, the advertising business is holding steady. In the fourth quarter, Meta posted record ad sales, with $38.7 billion in revenue (up 24% year over year). With Meta converting 54% of that revenue into operating profits, it is an incredible cash-generation machine. The Reality Labs division burned $4.6 billion of those profits in pursuit of its goals, but that still leaves an incredible $16.4 billion (a 41% operating margin) left over for investors.\nThese profits are added to Meta's ever-growing cash stockpile, which sits at around $65.4 billion as of the end of Q4. With only $18.4 billion in long-term debt on the balance sheet, it has plenty of cash on the sidelines to do whatever it wants.\nSo, Meta decided to pay a dividend. If you held shares on Feb. 22, you're entitled to a $0.50 per share dividend that will be paid on March 26. That works out to a 0.4% dividend yield, which isn't a lot. But all great dividend companies have to start somewhere, and some dividends are better than none.\nAll these facts look at Meta's previous results, which are fantastic. But why is the stock a buy right now?\nIf we look at Meta's forward price-to-earnings (P/E) ratio, it trades around 25 times forward earnings. While that's not terribly cheap, it isn't a bad price for a company on the cutting edge of AI technologies and growing revenue at a 25% pace.\nAdditionally, when compared to other big-tech stocks, like Apple and Microsoft, that aren't growing fast and trade at a higher premium, Meta's stock looks fairly priced.\nMeta is a huge player in AI and is succeeding with its social media products. Meta's growth is just getting started, and investors would be unwise to sell now. In fact, I think they can confidently buy the stock now with the expectation of it being much higher three to five years down the road.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Meta Platforms. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Platforms Is Up 40% This Year. Here's Why It's Still a Fantastic Buy was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-28T16:08:52.000Z",
        "Title": "Meta employee calls out ‘toxic’ rules that ban staff from discussing controversial topics like Israel–Palestine after an alleged investigation where she was ‘kicked out of internal systems’",
        "Author": "  Orianna Rosa Royle ",
        "Text": "A Meta employee has expressed fears that an internal ban on controversial political topics is the beginning of censorship across its platforms like Instagram and Facebook, claiming she was removed from the company's systems for two months after penning concerns about the Israel-Gaza conflict.\nSaima Akhter, a New York-based data scientist at Meta, claims that she was placed \"under investigation\" and kicked out of internal systems for “speaking up for Palestine.”\nShe now alleges the investigation has concluded and she has returned to Meta.\nStaffers at Meta are banned from discussing politics, health and weapons under its “community engagement expectations (CEE).”\n“External censorship on Meta platforms starts with internal censorship of Meta employees,” Akhter writes in her post on Instagram.\n“I am continuing to push for more explanation on why and what they were investigating.\n\"And I am continuing to ask how employees at Meta can express their concerns to leadership and actually be heard.”\nThe employee signed off the post by tagging her employer: “@meta, please stop internally censoring employees and get rid of the toxic CEE.”\nFortune has contacted Meta and Akhter for comment.\nMeta introduced CEE at the end of 2022 “to ensure that internal discussions remain respectful,” Lori Goler, the company’s head of people at the time wrote in an internal memo viewed by Fortune.\n“This comes with the trade-off that we’ll no longer allow for every type of expression at work, but we think this is the right thing to do for the long-term health of our internal community,\" the memo added.\nFrom then on, topics that had previously caused “disruption” including vaccine efficacy, abortion and gun rights were all banned overnight from being discussed in the workplace.\nDespite this, Akhter began openly advocating for Palestine amid its escalating conflict with Israel in the wake of Hamas’ Oct. 7 attack.\nMeta CEO, Mark Zuckerberg, weighed in on the war which has now claimed over 31,000 lives, calling the terrorist attacks “pure evil.”\n“My primary concern is the safety of our employees and their families in Israel and the surrounding region,\" Zuckerberg shared on Instagram stories.\nA group of Meta employees—including Akhter—then penned and circulated a letter asking Meta to \"acknowledge Palestinian lives lost\" and \"transparent action for internal and external censorship on our platforms.\"\n\"Internally we have been trying to raise these concerns and alarms but there is a rule that you cannot talk about disruptive topics, so anything we post about in regards to Palestine gets taken down,\" the Meta employee said in an Instagram video earlier this year before allegedly being placed “under investigation.”\nNow, in her latest Instagram post, she has blasted Meta’s leadership team for failing to acknowledge the hundreds of pro-Palestenian voices in the company.\n“The letter received nearly 500 signatures, and nearly 100 personal testimonials from employees,” she says. “Leadership deleted the letter (including deleting copies of the letter from employees drives and emails), ignored it, and never addressed it again.”\nIt’s not the first time that Meta has been accused of silencing pro-Palestinian posts on its platforms since the outbreak of the Israel-Gaza war.\nIn a scathing 51-page report, Human Rights Watch blasted the social network behemoth for engaging in a “systemic and global” censorship of content in support of Palestine and Palestinians, including the taking down of posts, disabling accounts and restricting users’ ability to interact with others’ posts.\nMeta outlined in a blog post on its company website that it did indeed take down “more than 795,000 pieces of content” from its platform in the aftermath of the Oct. 7 attack because they violated the company's “Dangerous Organizations and Individuals” policy—this included posts which showed “identifiable victims at the moment of the attack” and ones praising Hamas.\nMeanwhile, Black Lives Matter activist Shaun King said that his Instagram account was deactivated last December after he accused Israel of genocide.\n“The account was disabled due to multiple instances of praise for designated entities in violation of our policies,” a Meta spokesperson explained to CNBC at the time.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-03-14T10:29:00.000Z",
        "Title": "Here's the Key Reason Meta Platforms Stock Has Soared 547% From Its 2022 Low",
        "Author": "  Anthony Di Pizio, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) stock suffered a peak-to-trough decline of 76% between September 2021 and October 2022, bottoming at around $90. Meta is the parent of social media platforms Facebook, Instagram, and WhatsApp, but CEO Mark Zuckerberg pivoted the company toward the metaverse in 2021. The shift eroded Meta's profitability because of the metaverse's high capital costs and negligible revenue.\nFollowing the plunge in stock price, Zuckerberg heeded investors' complaints and dubbed 2023 the \"year of efficiency.\" He slashed more than 21,000 jobs and committed to slow spending on the metaverse in favor of focusing more on artificial intelligence (AI) and the company's core social platforms.\nThe chart below displays the incredible improvement in Meta's quarterly net income since 2022. In the recent fourth quarter of 2023, it soared by a whopping 201% year over year, to $14 billion.\nIt's no surprise Meta stock has soared 547% from its October 2022 low to $497, which is near an all-time high.\nPer the above chart, Meta's net income totaled $39.1 billion in 2023. That translated to $14.87 in earnings per share, and based on its current stock price of $497.09, Meta trades at a price-to-earnings (P/E) ratio of 33.4.\nThat's roughly in line with the 32.9 P/E ratio of the Nasdaq-100 index, implying that Meta stock is fairly valued. However, Wall Street believes the company will grow its earnings by 22.4% in 2024, meaning the stock might look undervalued by the end of the year if it remains at the current price.\nTherefore, Meta stock still looks like a great value despite its impressive 547% gain since October 2022.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nHere's the Key Reason Meta Platforms Stock Has Soared 547% From Its 2022 Low was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-05T13:00:01.000Z",
        "Title": "Meta's Growth Story Continues",
        "Author": "  Yiannis Zourmpanos ",
        "Text": "Shares of Meta Platforms Inc. (NASDAQ:META) skyrocketed last year, driven by the artificial intelligence rally.\nIn 2023, Mark Zuckerberg pledged for a\"year of efficiency,\" meaning the social media company would invest most of its dedicatory work into improving its products with an AI touch, cutting down costs with new initiatives to enhance user engagement.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nThis would then solidify its operational foundations to see Meta register a solid financial performance in the fourth quarter and for all of 2023.\nDuring the earnings call, Zuckerberg noted Meta's applications enjoy global use by at least one out of every 3.1 billion people.\nFinally, on the current route and strategic stakes, the company stands some chance to beat the Wall Street community's average target price of around $491.55 in the coming months; it has a promising outlook for growth in market value.\nMeta carries out activities within two business segments. The first one is the Family of Apps, which encompasses all its social media platforms, including Facebook, Instagram, WhatsApp and others.\nIts offerings in augmented and virtual reality are part of the other segment, Reality Labs.\nEven though the Family of Apps contributes the highest revenues and profits, Reality Labs has been declining sharply over the past few quarters. Surprisingly, the fourth quarter finished in favor of the segment and brought in $1.07 billion in revenue, reporting an increase of 47.1% year over year on the back of higher sales of Quest 3, with expenses rising 14% to $5.7 billion due to research and developments and headcount costs, resulting in a $4.6 billion operating loss.\nThe good news is the Family of Apps has again compensated for Reality Labs; underperformance, building $39 billion in revenue and an operating profit of $21 billion. While the Family of Apps saves the day for Meta, accounting for about 99% of its total revenue, Reality Labs remains to be explored. The metaverse market is in its fledgling stages.\nSource: Statista\nBy 2030, the global metaverse is expected to surpass $1.3 trillion, growing at a compounded annual rate amounting to 44.50% between 2022 and 2030.\nMeta believes that AI-powered technologies will enable the next generation of AR, MR and VR to be much more powerful, opening up the scope for exciting innovations in Reality Labs.\nAs Meta develops its products, operating expenses will rise between $94 billion and $99 billion in 2024. The company did not provide specific figures, but it noted that Reality Labs' loss from operations would go through the roof for the year based on the forecast of operating expenses.\nIn 2014, Meta purchased WhatsApp, the world's most popular messaging app, for $19 billion. Meta has since introduced the WhatsApp Business API that allows merchants to pay for certain application services. As of July 2023, WhatsApp Business reached over 200 million monthly active users worldwide. Revenue from the Family of Apps surged to $334 million in the quarter, marking an 82% increase, propelled by the robust growth in business messaging via the WhatsApp Business platform.\nThe company had announced in its previous quarterly results the launch of Meta Verified for businesses on Facebook and Instagram in a few countries, aiming to bring it to WhatsApp shortly after. Meta is also making good progress with the WhatsApp Channels product, which has now more than 500 million monthly active users since its debut in September 2023.Additionally, Meta does have several other ways to profit from WhatsApp if it ultimately decides to monetize it, such as advertising or business-focused subscription plans and from functional mergers with other platforms.\nWhatsApp currently stands at 2.78 billion active monthly users from 180 countries, and it is expected that the number will hit 3.14 billion by 2025. Meta has not taken an official stance on this either, and its vast monetization possibility is still in progress.\nSource: Oberlo\nAt the Connect conference last year, Meta presented its generative AI products: Meta AI, an advanced conversational assistant based on Llama 2, its large language model that will be integrated with Instagram, WhatsApp and Messenger.\nThe technology has already been integrated into the company's mixed reality headset, Quest 3, and its Ray-Ban Meta smart glasses, which launched in October. Both had a solid start.\nWhile Quest 2 weighed on Reality Labs' segment performance in 2023, the AI-powered Meta Quest 3 has the potential to give a big boost. In respect of the fourth-quarter results, both products delivered well.\nAI is capable of actually enhancing Meta's advertising platforms. Dependent on different types of advertising, the company's revenue from Family of Apps advertising reached $38.7 billion in the fourth quarter, which was 24% higher. With the digital ad market recovering in 2024, Meta's advertising revenue might soar further.\nMoreover, Meta expects to be very aggressive this year in its AI, non-AI hardware and Reality Labs investments, likely making capital expenditures between $30 billion and $37 billion.\nDespite the increasing expenses, management forecasts first-quarter 2024 revenue in the$34.5 billion to $37 billion range, implying a 20% to 29% increase over the prior-year quarter. The consensus for first-quarter revenue stands at $35.97 billion, which aligns with the company's forecast.\nMeta's balance sheet shows that it ended the fourth quarter with $65.4 billion in cash and marketable securities, comprising $18.4 billion in long-term debt.\nNot surprisingly, in the last quarter, it also generated strong free cash flow of $11.50 billion. A healthy free cash flow balance allows the company to pay off its debt, fund future growth projects, pay dividends and undertake similar activities. Thus, the free cash flow balance also ascertains a better understanding of the company's financial health.\nThis free cash flow enabled Meta to start paying dividends to its shareholders. The company announced a dividend payment of 50 cents per share for the quarter, payable quarterly. In fact, surplus cash will also enable Meta to finance AI projects quite soon as it has predicted 2024 to be a year of heavy investment in the segment.\nWall Street expects Meta's revenue and earnings for 2024 to spike by 17.3% and 34.5%, respectively. Trading at 32 times its price-earnings compared to its historical average of 33 suggests the tech giant might be fairly priced. However, with the boost in earnings from AI and in light of 2024 U.S. elections with elevated advertising revenue, the company deserves a higher multiple, closer to 35, implying a target price of $520 in the short term.However, the reasonable valuation is contingent upon the premise that Wall Street still continues to overlook Meta's generative AI capabilities, apart from its monetization potential for WhatsApp and Threads and yet other unexplored growth prospects at Reality Labs.\nThe incredible full-year results and a strong forecast for 2024 have boosted Meta's market cap over $1.2 trillion. Lastly, as Meta Platforms sails toward the future, the integration of AI could pave the way for a smoother ride, making the stock a compelling growth at a reasonable price play, with additional upside potential from current levels.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-04-01T20:05:00.000Z",
        "Title": "Meta to Announce First Quarter 2024 Results",
        "Author": "PR Newswire ",
        "Text": "MENLO PARK, Calif., April 1, 2024 /PRNewswire/ -- Meta Platforms, Inc. (NASDAQ: META) announced today that the company's first quarter 2024 financial results will be released after market close on Wednesday, April 24, 2024.\nMeta will host a conference call to discuss its results at 2 p.m. PT / 5 p.m. ET the same day. The live webcast of the call can be accessed at the Meta Investor Relations website at investor.fb.com, along with the company's earnings press release, financial tables, and slide presentation. \nFollowing the call, a replay will be available at the same website. Transcripts of conference calls with publishing equity research analysts held on April 24, 2024 will also be posted to the investor.fb.com website.\nDisclosure Information Meta uses the investor.fb.com and about.fb.com/news/ websites as well as Mark Zuckerberg's Facebook Page (facebook.com/zuck), Instagram account (instagram.com/zuck) and Threads profile (threads.net/zuck) as means of disclosing material non-public information and for complying with its disclosure obligations under Regulation FD. \nAbout Meta Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.\nContacts Investors: Kenneth Dorellinvestor@meta.com / investor.fb.com\nPress: Ryan Moore press@meta.com / about.fb.com/news/\nView original content to download multimedia:https://www.prnewswire.com/news-releases/meta-to-announce-first-quarter-2024-results-302104791.html\nSOURCE Meta\n"
    },
    {
        "Date": "2024-03-22T11:01:24.000Z",
        "Title": "Is It Time To Consider Buying Meta Platforms, Inc. (NASDAQ:META)?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Meta Platforms, Inc. (NASDAQ:META) led the NASDAQGS gainers with a relatively large price hike in the past couple of weeks. The company is now trading at yearly-high levels following the recent surge in its share price. As a large-cap stock with high coverage by analysts, you could assume any recent changes in the company’s outlook is already priced into the stock. However, what if the stock is still a bargain? Let’s take a look at Meta Platforms’s outlook and value based on the most recent financial data to see if the opportunity still exists.\n View our latest analysis for Meta Platforms \nThe stock seems fairly valued at the moment according to our valuation model. It’s trading around 10% below our intrinsic value, which means if you buy Meta Platforms today, you’d be paying a fair price for it. And if you believe that the stock is really worth $565.23, then there’s not much of an upside to gain from mispricing. Although, there may be an opportunity to buy in the future. This is because Meta Platforms’s beta (a measure of share price volatility) is high, meaning its price movements will be exaggerated relative to the rest of the market. If the market is bearish, the company’s shares will likely fall by more than the rest of the market, providing a prime buying opportunity.\nInvestors looking for growth in their portfolio may want to consider the prospects of a company before buying its shares. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. With profit expected to grow by 71% over the next couple of years, the future seems bright for Meta Platforms. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.\nAre you a shareholder? META’s optimistic future growth appears to have been factored into the current share price, with shares trading around its fair value. However, there are also other important factors which we haven’t considered today, such as the financial strength of the company. Have these factors changed since the last time you looked at the stock? Will you have enough conviction to buy should the price fluctuates below the true value?\nAre you a potential investor? If you’ve been keeping tabs on META, now may not be the most advantageous time to buy, given it is trading around its fair value. However, the positive outlook is encouraging for the company, which means it’s worth diving deeper into other factors such as the strength of its balance sheet, in order to take advantage of the next price drop.\nWith this in mind, we wouldn't consider investing in a stock unless we had a thorough understanding of the risks. For example - Meta Platforms has 1 warning sign we think you should be aware of.\nIf you are no longer interested in Meta Platforms, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-02T16:30:00.000Z",
        "Title": "Will Meta Platforms Be Worth More Than Apple by 2030?",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms' (NASDAQ: META) stock has rallied by about 180% over the past 12 months and now trades just a few dollars shy of its all-time high. Investors rushed back to the social media giant as its advertising business recovered, and as management expanded its share buyback authorization by $50 billion and initiated a dividend.\nThat rally lifted Meta's market cap past the trillion-dollar mark for the first time in two years this January, and it's now worth $1.2 trillion. However, Meta is still less valuable than Apple (NASDAQ: AAPL), which has throttled the company's ad sales over the past three years by improving the user-privacy aspects of the iOS mobile operating system.\nBut now that Meta's business is firing on all cylinders again, could it overtake Apple -- which currently has a market cap of $2.8 trillion -- by 2030?\nMeta's growth stalled out in 2022 as it struggled with fierce competition from ByteDance's TikTok, macro headwinds for the advertising market, and the impact of Apple's user-privacy upgrades. Its Reality Labs unit, which houses its metaverse efforts and its virtual and augmented reality devices, also continued to lose billions of dollars every quarter. During that challenging year, Meta's revenue and earnings per share (EPS) declined by 1% and 38%, respectively.\nBut in 2023, Meta's revenue and EPS rose 16% and 73%, respectively, as its advertising business recovered. It countered Apple's iOS changes by gathering more first-party data with its own AI algorithms, challenged TikTok by expanding its Reels short video platform on Facebook and Instagram, and offset its declining ad prices by selling more ad impressions. It also attracted a lot of new ad purchases from Chinese e-commerce and gaming companies, which were trying to reach more overseas customers; China-based advertisers drove 5 percentage points of its total revenue growth during the year.\nFrom 2023 to 2026, analysts expect Meta's revenue and earnings to grow at a compound annual rate of 14% and 22%, respectively. Its stock still looks reasonably valued relative to those estimates at 24 times forward earnings.\nIf Meta matches those estimates and continues to grow its bottom line at a compound annual rate of 15% from 2026 to 2030, its EPS could rise to $46.70. If its forward multiple remains roughly the same, in early 2030, its stock could be trading at about $1,120, giving it a market cap of nearly $2.8 trillion. That would match Apple's current valuation.\nApple also suffered a slowdown over the past three years. In its fiscal 2022 (which ended Sept. 24, 2022), its revenue and EPS only rose 8% and 9%, respectively, as it lapped a period of robust sales of its first 5G handset, the iPhone 12. In fiscal 2023, Apple's revenue fell 3% and its earnings stayed nearly flat as the 5G upgrade cycle ended and its sales of Macs withered in a post-pandemic market. China's economic slowdown and tough currency headwinds exacerbated that pressure.\nFrom fiscal 2023 to fiscal 2026, analysts expect Apple's revenue and earnings to grow at a compound annual rate of 4% and 8%, respectively. Those growth rates look stable, but they're not that impressive for a stock that trades at 28 times forward earnings.\nApple still trades at a premium to its growth because it's widely considered a safe-haven stock. The company can still diversify its portfolio away from the iPhone over the next few years with fresh products and subscription services, and it could expand through acquisitions and investments by tapping its $173 billion in cash and marketable securities. However, its price-to-earnings ratio could gradually contract if it doesn't reaccelerate its growth.\nIf Apple meets analysts' expectations and grows its EPS at a modest compound annual rate of 8% from fiscal 2026 to fiscal 2030, its EPS could reach $10.50. If its valuation remained at 28 times forward earnings at that point, its stock would be trading at $294, giving it a market cap of $4.5 trillion. But if Apple's forward multiple dropped to 20 -- in line with other mature tech companies -- its stock price of $210 per share would give it a market cap of $3.2 trillion.\nBased on those calculations and forecasts, Meta probably won't be worth more than Apple by 2030, but it could have a lot more upside potential than the iPhone maker. For Meta to reach Apple's current market cap by 2030, its stock would have to more than double from its current levels.\nMeanwhile, Apple could struggle to match those gains if it continues to generate single-digit percentage earnings growth while trading at premium valuations. That outlook might change if the Vision Pro takes off or if Apple launches other revolutionary products or services -- but it will take a lot of work to diversify the business away from its dependence on the iPhone.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Apple and Meta Platforms. The Motley Fool has a disclosure policy.\nWill Meta Platforms Be Worth More Than Apple by 2030? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-04T17:15:18.000Z",
        "Title": "Why Meta Platforms Stock Rose by Nearly 26% in February",
        "Author": "  Jon Quast, The Motley Fool ",
        "Text": "Shares of Meta Platforms (NASDAQ: META) rose by 25.6% during February, according to data provided by S&P Global Market Intelligence. The majority of the upward move occurred on Feb. 2, the day after the company reported financial results for the fourth quarter of 2023 and initiated a quarterly dividend for the first time.\nAt the start of the year, Meta Platforms' co-founder and CEO Mark Zuckerberg dubbed 2023 the \"year of efficiency,\" meaning he was pushing the company toward robust improvements to profitability. The company delivered in dramatic fashion. It earned over $39 billion in net income in 2023, which was good for a stellar net profit margin of 29%.\nIt didn't just hit $39 billion in net income -- Meta Platforms grew the top line as well. In 2023, the company's revenue had a 16% year-over-year increase. Rates for its ads had a modest improvement whereas ad impressions were up big time, partly thanks to strong engagement from its still-growing user base.\nMeta is rewarding shareholders more than ever thanks to its efficient year. The company is authorized to repurchase over $80 billion in stock at management's discretion. And as mentioned, it will pay its first quarterly dividend on March 26 at a rate of $2 per share annually.\nAs Meta's largest shareholder, Zuckerberg is the biggest beneficiary of this dividend decision and is expected to earn roughly $700 million in annual dividend income.\nMeta is returning some profits to shareholders, which is good. But it should be pointed out, however, that the company isn't simply squeezing its business for every penny of profit that it can. To the contrary, it still had a $16 billion operating loss in its Reality Labs business segment -- a part of the business trying to develop its metaverse aspirations.\nWhether investors believe this is money well-spent is beside the point. Meta is still spending on growth while rewarding shareholders with profits -- an important balance to strike.\nFor the first quarter of 2024, Meta expects revenue growth of at least 20%. That's significant for a company this big and it's an encouraging number.\nGranted, Meta expects big increases to expenses as well in 2024. Specifically with its Reality Labs business segment, management said it expects its segment operating loss \"to increase meaningfully.\"\nI believe this is why Meta's dividend is so important here. Yes, the company's profit margins could decrease in 2024 compared to 2023. But management is showing a commitment to balance -- it will invest in the business while still rewarding shareholders. The quarterly dividend is a commitment to this. And that should be exciting for Meta's shareholders today.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jon Quast has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms. The Motley Fool has a disclosure policy.\nWhy Meta Platforms Stock Rose by Nearly 26% in February was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-14T11:00:16.000Z",
        "Title": "A Look Into Meta Platforms' (NASDAQ:META) Impressive Returns On Capital",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "To find a multi-bagger stock, what are the underlying trends we should look for in a business? Firstly, we'll want to see a proven return on capital employed (ROCE) that is increasing, and secondly, an expanding base of capital employed. Put simply, these types of businesses are compounding machines, meaning they are continually reinvesting their earnings at ever-higher rates of return. With that in mind, the ROCE of Meta Platforms (NASDAQ:META) looks attractive right now, so lets see what the trend of returns can tell us.\nJust to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business. To calculate this metric for Meta Platforms, this is the formula:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.25 = US$50b ÷ (US$230b - US$32b) (Based on the trailing twelve months to December 2023).\nThus, Meta Platforms has an ROCE of 25%.  In absolute terms that's a great return and it's even better than the Interactive Media and Services industry average of 7.1%.\n View our latest analysis for Meta Platforms \nAbove you can see how the current ROCE for Meta Platforms compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like, you can check out the forecasts from the analysts covering Meta Platforms  for free.\nMeta Platforms deserves to be commended in regards to it's returns. The company has employed 119% more capital in the last five years, and the returns on that capital have remained stable at 25%. Now considering ROCE is an attractive 25%, this combination is actually pretty appealing because it means the business can consistently put money to work and generate these high returns. If Meta Platforms can keep this up, we'd be very optimistic about its future.\nIn the end, the company has proven it can reinvest it's capital at high rates of returns, which you'll remember is a trait of a multi-bagger. On top of that, the stock has rewarded shareholders with a remarkable 200% return to those who've held over the last five years. So even though the stock might be more \"expensive\" than it was before, we think the strong fundamentals warrant this stock for further research.\nMeta Platforms does have some risks though, and we've spotted   1 warning sign for Meta Platforms  that you might be interested in.\nIf you'd like to see other companies earning high returns, check out our free list of companies earning high returns with solid balance sheets here.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-07T04:54:42.000Z",
        "Title": "Meta Shifts Focus to Enterprise Applications in the Metaverse",
        "Author": "  Hope C ",
        "Text": "Meta, the social media giant previously known as Facebook, is seemingly shifting its focus away from individual-centric metaverse experiences and towards enterprise applications and artificial intelligence (AI). This apparent pivot is reflected in a recent blog post titled \"Game Changers: 3 Predictions for Technological Transformation in 2024 & Beyond.\"\nThe first prediction highlights Meta's potential change in direction. It suggests that the metaverse will find its initial value in enterprise and educational settings, possibly indicating a strategic pivot towards increasing adoption of their Quest VR headset hardware by businesses.\nFurthermore, the post seemingly acknowledges the decline in metaverse hype, calling it \"dead\" and contrasting it with the rising interest in AI. While acknowledging consumer interest in the metaverse, evidenced by the Quest app's performance on the App Store, Meta emphasizes business applications like collaborative computer-aided design tools. This suggests a potential reorientation of their metaverse strategy towards enterprise needs.\nMeta's second prediction focuses on \"portable artificial intelligence,\" specifically onboard large language models (LLMs). Unlike powerful systems like ChatGPT and Claude, which rely on cloud connectivity, onboard LLMs could operate directly on devices. This approach could allow Meta to integrate metaverse hardware with augmented reality (AR) to create informative heads-up displays for everyday use.\nFinally, the third prediction emphasizes the importance of business messaging tools within the metaverse. \"People expect to interact with brands and businesses they support in new, more personal ways,\" the blog post emphasizes. This could signal a potential future where brands interact with consumers within the metaverse through AI-powered tools and engaging experiences.\n"
    },
    {
        "Date": "2024-04-01T13:00:13.000Z",
        "Title": "We Think Meta Platforms (NASDAQ:META) Can Manage Its Debt With Ease",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "The external fund manager backed by Berkshire Hathaway's Charlie Munger, Li Lu, makes no bones about it when he says 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.' It's only natural to consider a company's balance sheet when you examine how risky it is, since debt is often involved when a business collapses. Importantly, Meta Platforms, Inc. (NASDAQ:META) does carry debt. But should shareholders be worried about its use of debt?\nDebt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. Ultimately, if the company can't fulfill its legal obligations to repay debt, shareholders could walk away with nothing. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, plenty of companies use debt to fund growth, without any negative consequences. When we think about a company's use of debt, we first look at cash and debt together.\n See our latest analysis for Meta Platforms \nThe image below, which you can click on for greater detail, shows that at December 2023 Meta Platforms had debt of US$18.4b, up from US$9.92b in one year. But it also has US$65.4b in cash to offset that, meaning it has US$47.0b net cash.\nThe latest balance sheet data shows that Meta Platforms had liabilities of US$32.0b due within a year, and liabilities of US$44.5b falling due after that. On the other hand, it had cash of US$65.4b and US$16.2b worth of receivables due within a year. So it actually has US$5.12b more liquid assets than total liabilities.\nHaving regard to Meta Platforms' size, it seems that its liquid assets are well balanced with its total liabilities. So it's very unlikely that the US$1.24t company is short on cash, but still worth keeping an eye on the balance sheet. Simply put, the fact that Meta Platforms has more cash than debt is arguably a good indication that it can manage its debt safely.\nIn addition to that, we're happy to report that Meta Platforms has boosted its EBIT by 50%, thus reducing the spectre of future debt repayments. When analysing debt levels, the balance sheet is the obvious place to start. But it is future earnings, more than anything, that will determine Meta Platforms's ability to maintain a healthy balance sheet going forward. So if you're focused on the future you can check out this free report showing analyst profit forecasts.\nFinally, a company can only pay off debt with cold hard cash, not accounting profits. Meta Platforms may have net cash on the balance sheet, but it is still interesting to look at how well the business converts its earnings before interest and tax (EBIT) to free cash flow, because that will influence both its need for, and its capacity to manage debt. During the last three years, Meta Platforms produced sturdy free cash flow equating to 78% of its EBIT, about what we'd expect. This cold hard cash means it can reduce its debt when it wants to.\nWhile it is always sensible to investigate a company's debt, in this case Meta Platforms has US$47.0b in net cash and a decent-looking balance sheet. And it impressed us with its EBIT growth of 50% over the last year. So we don't think Meta Platforms's use of debt is risky. The balance sheet is clearly the area to focus on when you are analysing debt. However, not all investment risk resides within the balance sheet - far from it. For example, we've discovered 1 warning sign for Meta Platforms that you should be aware of before investing here.\nAt the end of the day, it's often better to focus on companies that are free from net debt. You can access our special list of such companies (all with a track record of profit growth). It's free.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-19T12:30:03.000Z",
        "Title": "If You Invested $1000 in Meta Platforms a Decade Ago, This is How Much It'd Be Worth Now",
        "Author": "  Zacks Equity Research ",
        "Text": "How much a stock's price changes over time is important for most investors, since price performance can both impact your investment portfolio and help you compare investment results across sectors and industries.\nFOMO, or the fear of missing out, also plays a role in investing, particularly with tech giants and popular consumer-facing stocks.\nWhat if you'd invested in Meta Platforms (META) ten years ago? It may not have been easy to hold on to META for all that time, but if you did, how much would your investment be worth today?\nMeta Platforms' Business In-Depth\nWith that in mind, let's take a look at Meta Platforms' main business drivers.\nMeta Platforms is the world’s largest social media platform. The company’s portfolio offering evolved from a single Facebook app to multiple apps like photo and video sharing app Instagram and WhatsApp messaging app owing to acquisitions. Along with in-house developed Messenger, these apps now form Meta’s family of products used by almost 3.98 billion people on a monthly basis as of Dec 31, 2023.Newly introduced metric, which is the family daily active people (DAP) that measures daily users of its family of products, was 3.19 billion, as of Dec 31.  Meta uses metrics like daily active users (DAUs) and monthly active users (MAUs) to measure Facebook’s user base. As of Dec 31, 2023, DAUs and MAUs were 2.11 billion and 3.065 billion, respectively.Headquartered in Menlo Park, CA, Meta generated revenues worth $134.9 billion in 2023. Advertisement accounted for 97.8% of revenues. Marketers buy ads that can appear on multiple platforms including Meta, Instagram, Messenger and third-party applications and websites.Meta, thanks to its huge user base gained a significant market share in the advertising space wherein it faces tough competition from Google, Twitter, Amazon and Snapchat-parent Snap.Meta also faces significant competition from the likes of Apple (messaging), YouTube (advertising and video), Bytedance (social media) and Tencent (messaging and social media).Meta core app enables people to connect, share, discover and communicate with one other on mobile devices and personal computers. User engagement on core Meta platform is fostered by News Feed that displays an algorithmically-ranked series of stories and advertisements customized for each user.Instagram is a community for sharing photos, videos and messages, enabling people to discover interests that they care about. People can express themselves through photos, videos and private messaging via Instagram Feed and Stories.Messenger helps people to connect with friends, family, groups and businesses across platforms and devices. WhatsApp is a simple, reliable and secure messaging application, used by people and businesses around the world to communicate in a private way.Meta also offers virtual reality (VR) products through its Oculus division.\nBottom Line\nWhile anyone can invest, building a lucrative investment portfolio takes research, patience, and a little bit of risk. If you had invested in Meta Platforms ten years ago, you're probably feeling pretty good about your investment today.\nAccording to our calculations, a $1000 investment made in March 2014 would be worth $7,182.83, or a 618.28% gain, as of March 19, 2024. Investors should keep in mind that this return excludes dividends but includes price appreciation.\nThe S&P 500 rose 175.04% and the price of gold increased 56.16% over the same time frame in comparison.\nAnalysts are forecasting more upside for META too.\nMeta is benefiting from steady user growth across all regions, particularly Asia Pacific. Increased engagement for its offerings like Instagram, WhatsApp, Messenger and Facebook has been a major growth driver. The company is leveraging AI to recommend Reels content, which is driving traffic on Instagram and Facebook. Its innovative portfolio, which includes Threads, Reels, Llama 2, Ray-Ban Meta smart glass, and mixed reality device Quest 3 is likely to aid prospects. Reels continued to do very well across both Instagram and Facebook driven by growing adoption. People reshared Reels 3.5 billion times every day during the fourth-quarter. However, challenging macroeconomic conditions remain a headwind for Meta’s advertising revenues. Slow monetization of Reels, along with mounting operating losses at Reality Labs, are concerns.\nThe stock is up 5% over the past four weeks, and no earnings estimate has gone lower in the past two months, compared to 15 higher, for fiscal 2024. The consensus estimate has moved up as well.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-13T13:15:00.000Z",
        "Title": "Better Growth Stock: Meta Platforms vs. Pinterest",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) and Pinterest (NYSE: PINS) can be considered the David and Goliath, respectively, of the social media market. Meta served 3.98 billion people across Facebook, Messenger, Instagram, and WhatsApp monthly at the end of 2023. Pinterest served 498 million monthly active users (MAUs) at the end of the year.\nMeta's social networks enable people to stay in touch with their friends, family, and co-workers, or to follow brands and public figures. Meta also sells virtual and augmented reality devices, and it launched an \"X-like\" platform called Threads last year. Pinterest's virtual pinboards are mainly used to share interests, hobbies, and ideas with other users, and its visual format makes it a natural fit for e-commerce sales.\nOver the past 12 months, Meta's stock soared nearly 180% as Pinterest's stock rose 40%. Let's see why Meta outperformed Pinterest, and if it's still the better buy.\nMeta's revenue and earnings per share (EPS) declined 2% and 38%, respectively, in 2022. That slowdown was caused by Apple's privacy changes on iOS, which disrupted its ability to harvest data from third-party apps; stiff competition from ByteDance's TikTok; and the macro headwinds for the advertising sector.\nAs Meta's ad sales slowed down, it continued to burn billions of dollars each quarter on its unprofitable Reality Labs segment, which develops its augmented reality and virtual reality products.\nThat combination of slowing growth and rising expenses rattled the bulls. But in 2023, its revenue and EPS rose 16% and 73%, respectively, as it overcame those challenges. Meta dealt with Apple's changes by mining more first-party data with its AI algorithms, countered TikTok with the expansion of Reels, and attracted a lot of ad dollars from Chinese gaming and e-commerce companies as they targeted overseas customers.\nIt also offset its declining ad prices with more ad impressions. As its advertising business recovered, it continued to expand its Reality Labs division -- but it still had enough cash to initiate its first dividend at the end of 2023 and boost its buyback plan by $50 billion.\nAnalysts expect Meta's revenue and EPS to rise 17% and 34%, respectively, in 2025. Its stock is hovering near its all-time high, but it still looks reasonably valued at 25 times forward earnings, and it pays a token forward dividend yield of 0.4%.\nPinterest's revenue only increased 9% in 2022 as it turned unprofitable on a generally accepted accounting principles (GAAP) basis. That represented a significant slowdown from its 52% growth in 2021 and 48% growth in 2020.\nDuring the pandemic, many people flocked to Pinterest to find ideas for recipes, home improvement projects, family activities, and online shopping ideas. But many of those users left after the pandemic passed, and the macro headwinds for the advertising market exacerbated that slowdown. That deceleration drove the bears to declare that Pinterest was a fad stock.\nIn 2023, Pinterest's revenue rose just 9% again and it remained unprofitable. However, it returned to GAAP profitability in the second half of 2023, while its MAUs increased 11% to 498 million for the full year and accelerated from its 4% MAU growth in 2022. That stabilization was driven by an influx of Gen Z users, which reduced its dependence on older users; its overseas expansion; fresh video content; and AI-driven recommendations. More merchants also launched \"shoppable pins\" that turned Pinterest's pinboards into a decentralized e-commerce marketplace.\nAnalysts expect Pinterest's revenue and adjusted EPS to rise 18% and 24%, respectively, in 2024 as its business stabilizes and the macro environment improves. At 28 times forward earnings, it's a bit pricier than Meta and doesn't pay a dividend, but it might remain a good long-term play on the \"social shopping\" market.\nPinterest's business is recovering, but Meta is clearly the better pick right now because it's more broadly diversified, more profitable, and trades at more attractive valuations than Pinterest. Meta is also growing at a similar rate as Pinterest even though it serves eight times as many monthly active users worldwide, so the social media underdog might need to grow a lot faster than the market leader to attract the attention of growth-oriented investors.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Apple, Meta Platforms, and Pinterest. The Motley Fool has a disclosure policy.\nBetter Growth Stock: Meta Platforms vs. Pinterest was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-19T22:58:08.000Z",
        "Title": "Meta expects first shipments of new Nvidia chips later this year",
        "Author": "Reuters ",
        "Text": "NEW YORK (Reuters) - Facebook owner Meta Platforms expects to receive initial shipments of Nvidia's new flagship artificial intelligence chip later this year, a Meta spokesperson told Reuters.\nNvidia, the dominant designer of GPU (graphics processing unit) chips needed to power most cutting-edge artificial intelligence work, announced the new B200 \"Blackwell\" chip at its annual developer conference on Monday.\nThe chip maker said the B200 is 30 times speedier at tasks like serving up answers from chatbots, although it did not give specific details about how well it performs when chewing through huge amounts data to train those chatbots, which is the kind of work that has powered most of Nvidia's soaring sales.\nNvidia's Chief Financial Officer Colette Kress told financial analysts on Tuesday that \"we think we're going to come to market later this year,\" but also said that shipment volume for the new GPUs would not ramp up until 2025.\nSocial media giant Meta is one of Nvidia's biggest customers, after buying hundreds of thousands of its previous generation of chips to support pushes into amped-up content recommendations systems and generative AI products.\nMeta CEO Mark Zuckerberg disclosed in January that the company planned to have about 350,000 of those earlier chips, called H100s, in its stockpile by the end of the year. In combination with other GPUs, he added, Meta would have the equivalent of about 600,000 H100s by then.\nIn a statement on Monday, Zuckerberg said Meta planned to use Blackwell to train the company's Llama models. The company is currently training a third generation of the model on two GPU clusters it announced last week, which it said each contain around 24,000 H100 GPUs.\nMeta planned to continue using those clusters to train Llama 3 and would use Blackwell for future generations of the model, the Meta spokesperson said.\n(This story has been officially corrected after Meta said that it erroneously forecast it would not receive new Nvidia chips until at least next year)\n(Reporting by Katie Paul in New York and Max Cherney and Stephen Nellis in San Jose; Editing by Bill Berkrot)\n"
    },
    {
        "Date": "2024-03-01T14:21:33.000Z",
        "Title": "Meta rebuffs Google's virtual reality tie-up proposal, The Information reports",
        "Author": "Reuters ",
        "Text": "(Reuters) -Meta Platforms decided against a partnership with Alphabet to use Google's Android XR platform for its virtual and mixed-reality Quest headsets, The Information reported on Friday.\nGoogle had suggested that Meta partnered with its new software platform that is being developed for virtual reality, augmented reality and mixed-reality headsets, the report said, citing a source involved in the talks.\nBut such a partnership could thwart Meta CEO Mark Zuckerberg's plan to \"own the next computational platform for AR, VR and mixed reality,\" according to the report.\nMeta is already talking to hardware companies, including South Korea's LG Electronics, about building new VR devices using Quest's software, the report said, quoting unnamed Meta employees.\nMeta and LG Electronics did not respond to Reuters request for comment, while Alphabet declined to comment.\nMeta's Quest devices currently run on an open-source version of Google's Android operating system, the report said.\nApple released its mixed reality headset Vision Pro last month.\n(Reporting by Yuvraj Malik in Bengaluru; Editing by Anil D'Silva and Shinjini Ganguli)\n"
    },
    {
        "Date": "2024-03-09T11:00:21.000Z",
        "Title": "Estimating The Intrinsic Value Of Meta Platforms, Inc. (NASDAQ:META)",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Using the 2 Stage Free Cash Flow to Equity, Meta Platforms fair value estimate is US$564\nCurrent share price of US$506 suggests Meta Platforms is potentially trading close to its fair value\nOur fair value estimate is 9.2% higher than Meta Platforms' analyst price target of US$517\nIn this article we are going to estimate the intrinsic value of Meta Platforms, Inc. (NASDAQ:META) by taking the expected future cash flows and discounting them to today's value. This will be done using the Discounted Cash Flow (DCF) model. There's really not all that much to it, even though it might appear quite complex.\nRemember though, that there are many ways to estimate a company's value, and a DCF is just one method. If you want to learn more about discounted cash flow, the rationale behind this calculation can be read in detail in the Simply Wall St analysis model.\n View our latest analysis for Meta Platforms \nWe're using the 2-stage growth model, which simply means we take in account two stages of company's growth. In the initial period the company may have a higher growth rate and the second stage is usually assumed to have a stable growth rate. To start off with, we need to estimate the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, and so the sum of these future cash flows is then discounted to today's value:\n2024\n2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2033\n Levered FCF ($, Millions) \nUS$48.7b\nUS$58.3b\nUS$67.6b\nUS$66.6b\nUS$74.5b\nUS$78.7b\nUS$82.4b\nUS$85.6b\nUS$88.6b\nUS$91.3b\nGrowth Rate Estimate Source\nAnalyst x20\nAnalyst x19\nAnalyst x9\nAnalyst x3\nAnalyst x3\nEst @ 5.67%\nEst @ 4.66%\nEst @ 3.95%\nEst @ 3.45%\nEst @ 3.10%\n Present Value ($, Millions) Discounted @ 7.2% \nUS$45.4k\nUS$50.7k\nUS$54.8k\nUS$50.4k\nUS$52.5k\nUS$51.8k\nUS$50.5k\nUS$49.0k\nUS$47.3k\nUS$45.4k\n(\"Est\" = FCF growth rate estimated by Simply Wall St)Present Value of 10-year Cash Flow (PVCF) = US$498b\nWe now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.3%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 7.2%.\nTerminal Value (TV)= FCF2033 × (1 + g) ÷ (r – g) = US$91b× (1 + 2.3%) ÷ (7.2%– 2.3%) = US$1.9t\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$1.9t÷ ( 1 + 7.2%)10= US$941b\nThe total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is US$1.4t. In the final step we divide the equity value by the number of shares outstanding. Compared to the current share price of US$506, the company appears about fair value at a 10% discount to where the stock price trades currently. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent.\nWe would point out that the most important inputs to a discounted cash flow are the discount rate and of course the actual cash flows. Part of investing is coming up with your own evaluation of a company's future performance, so try the calculation yourself and check your own assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Meta Platforms as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 7.2%, which is based on a levered beta of 1.074. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\nStrength\nEarnings growth over the past year exceeded the industry.\nDebt is not viewed as a risk.\nWeakness\nDividend is low compared to the top 25% of dividend payers in the Interactive Media and Services market.\nOpportunity\nAnnual earnings are forecast to grow faster than the American market.\nGood value based on P/E ratio and estimated fair value.\nThreat\nRevenue is forecast to grow slower than 20% per year.\nAlthough the valuation of a company is important, it ideally won't be the sole piece of analysis you scrutinize for a company. The DCF model is not a perfect stock valuation tool. Preferably you'd apply different cases and assumptions and see how they would impact the company's valuation. For example, changes in the company's cost of equity or the risk free rate can significantly impact the valuation. For Meta Platforms, we've compiled three further elements you should further examine:\nRisks: Case in point, we've spotted   1 warning sign for Meta Platforms  you should be aware of.\nFuture Earnings: How does META's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart.\nOther Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\nPS. The Simply Wall St app conducts a discounted cash flow valuation for every stock on the NASDAQGS every day. If you want to find the calculation for other stocks just search here.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-11T18:53:13.000Z",
        "Title": "Why Meta Platforms, Taiwan Semiconductor, Advanced Micro Devices, and Other Artificial Intelligence (AI) Stocks Tumbled on Monday",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "One of the byproducts of the accelerating adoption of artificial intelligence (AI) has been the investor practice -- for better or for worse -- of viewing AI stocks collectively. In many instances, developments concerning one company in the space can have a ripple effect, bringing a broad cross-section of stocks in the space up or down with them. That appears to be the case Monday morning, as two developments seem to be having on outsize impact on AI companies.\nWith that as a backdrop, foundry Taiwan Semiconductor Manufacturing (NYSE: TSM) tumbled 4.1%, social media company Meta Platforms (NASDAQ: META) slumped 4%, chipmaker Advanced Micro Devices (NASDAQ: AMD) dropped 3.8%, computer memory specialist Micron Technology (NASDAQ: MU) declined 3.1%, and semiconductor specialist Broadcom (NASDAQ: AVGO) fell 1.9%, as of 1:32 p.m. ET on Monday.\nA check of all the usual suspects -- regulatory filings, financial reports, and changes to analysts' price targets -- turned up one piece of negative company-specific news -- while surprisingly, there were a number of positive catalysts (more on that in a bit). Furthermore, troubling news about a high-profile company in the space seemed to put AI investors in a dour mood.\nBroadcom released the results of its fiscal 2024 first quarter (ended Feb. 4) on Friday, and investors weren't particularly impressed. The semiconductor specialist generated revenue of $11.96 billion, an increase of 34% year over year, resulting in adjusted earnings per share (EPS) of $10.99, an increase of 6%.\nWhile both metrics exceeded Wall Street's expectations, management's forecast seemed to catch investors off guard. Broadcom reiterated its outlook for the 2024 fiscal year, guiding for revenue of $50 billion. Investors were hoping the company would boost its guidance after exceeding expectations for the quarter. The news weighed on many AI and chip stocks on Friday.\nInvestors seemed to be waiting for the other shoe to drop, which happened over the weekend. Reports emerged that a proposed class action lawsuit was filed late on Friday, accusing Nvidia of copyright infringement. Three authors sued the chipmaker, alleging that Nvidia had used their books -- along with hundreds of thousands of others -- to train its NeMo AI platform, and had not requested permission. As one of the undisputed beneficiaries of the adoption of AI, this development will be carefully watched by investors.\nThis is merely the latest in a growing number of lawsuits filed by writers claiming that copyrighted works have been used to train generative AI systems without their knowledge or consent. Late last year, a group of noteworthy authors -- including George R.R. Martin, Michael Connelly, and Jonathan Franzen -- filed a similar suit against Microsoft and OpenAI, charging that ChatGPT was trained on their copyrighted works. Meta Platforms is in the midst of a similar lawsuit regarding its LLaMA AI model.\nWhile these lawsuits are currently having a chilling effect on the development of generative AI, it's too early to tell how these cases will ultimately be decided.\nWhile it's understandable that investors might be concerned about these developments, not all the news is bad. In fact, there were some positive bits of company-specific news, and investors appear to be missing the forest for the trees.\nHere are a few examples:\nOn Friday, Wells Fargo analysts maintained an overweight (buy) rating on Micron stock while raising their price target to $125, suggesting potential upside of 28% compared to Friday's close. The analysts believe the company is at an inflection point, which will become evident in the next two quarters.\nAMD also got a price target increase on Friday, courtesy of Melius Research. The analysts maintained a buy rating on AMD stock while raising their price target to $265, suggesting potential upside of 28% compared to Friday's close. They cited AMD's recently released MI300X AI chip as having good prospects in data centers.\nBroadcom got a pair of price target increases Monday morning. Baird maintained an outperform (buy) rating and raised its price target to $1,500, or upside of 19% compared to Friday's close. Citi analysts also maintained a buy rating on the stock and hiked its price target to $1,560, or 19% upside potential. Both analysts cited the secular tailwinds of AI as a catalyst fueling future growth.\nThese announcements suggest that investors should take care in painting all AI stocks with the same brush. While there will no doubt be both positive and negative developments that will impact the entire industry, each of these companies will need to execute on the opportunity and secular tailwinds represented by AI.\nMeta Platforms and Taiwan Semiconductor are the least expensive among the group, selling for 32 times and 27 times earnings, respectively. Furthermore, when measured in terms of the price/earnings-to-growth (PEG) ratio -- which factors in strong growth -- both stocks clock in at less than 1 -- the standard for an undervalued stock.\nEach of these stocks represents an intriguing opportunity, particularly in light of the opportunity represented by AI, but investors should size their positions based on their risk tolerance and the degree of volatility they're willing to endure.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now?\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nWells Fargo is an advertising partner of The Ascent, a Motley Fool company. Citigroup is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Danny Vena has positions in Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nWhy Meta Platforms, Taiwan Semiconductor, Advanced Micro Devices, and Other Artificial Intelligence (AI) Stocks Tumbled on Monday was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-01T17:46:00.000Z",
        "Title": "Top Analyst Reports for Apple, Meta Platforms & Intel",
        "Author": "  Mark Vickery ",
        "Text": "Friday, March 1, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc. (AAPL), Meta Platforms, Inc. (META) and Intel Corp. (INTC). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Apple’s shares have outperformed the Zacks Computer - Mini computers industry over the past year (+24.5% vs. +24.0%). The company is benefiting from steady iPhone sales amid stiff competition and weakness in China. It expects the March quarter’s revenues and iPhone revenues to be similar to that of the year-ago quarter’s figure after removing the additional $5 billion it generated due to pent-up demand for iPhone 14 and iPhone 14 Pro Max in the year-ago quarter.Unfavorable forex is expected to hurt revenues by 2% on a year-over-year basis. For the Services segment, Apple expects a double-digit growth rate, similar to the December-end quarter. Strong adoption of Apple TV+ driven by strong content is a key catalyst.Apple is gaining share in PCs which is positive. Apple’s strong cash balance and shareholder friendly approach to dividend and share repurchase is noteworthy. However, growing legal complexities has been a headwind.(You can read the full research report on Apple here >>>)Shares of Meta Platforms have outperformed the Zacks Internet - Software industry over the past year (+181.1% vs. +73.1%). The company is benefiting from steady user growth across all regions, particularly Asia Pacific. Increased engagement for its offerings like Instagram, WhatsApp, Messenger and Facebook has been a major growth driver.Meta Platforms is leveraging AI to recommend Reels content, which is driving traffic on Instagram and Facebook. Its innovative portfolio, which includes Threads, Reels, Llama 2, Ray-Ban Meta smart glass, and mixed reality device Quest 3 is likely to aid prospects. Reels continued to do very well across both Instagram and Facebook driven by growing adoption.People reshared Reels 3.5 billion times every day during the fourth-quarter. However, challenging macroeconomic conditions remain a headwind for Meta’s advertising revenues. Slow monetization of Reels, along with mounting operating losses at Reality Labs, are concerns.(You can read the full research report on Meta Platforms here >>>)Shares of Intel have gained +65.9% over the past year against the Zacks Semiconductor - General industry’s gain of +163.3%. The company is focusing on establishing an advanced semiconductor manufacturing ecosystem and has expanded global production capabilities under its IDM 2.0 (integrated device manufacturing) strategy.It remains on track with its 5N4Y (five nodes in four years) program in order to regain transistor performance and power performance leadership by 2025. Intel has launched AI chips for data centers and PCs to gain a firmer footing in the expansive AI sector and ubiquitous edge environment.However, weak demand trends and sluggish recovery in China are affecting its revenues. Macroeconomic challenges, inventory adjustments and intense market volatility are straining margins. Stiff competition in the server, storage and networking markets has hurt its long-term growth potential to some extent. For the first quarter of 2024, Intel has offered muted guidance.(You can read the full research report on Intel here >>>)Other noteworthy reports we are featuring today include Interactive Brokers Group, Inc. (IBKR), Diamondback Energy, Inc. (FANG) and ICON Public Limited Co. (ICLR).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nRobust Portfolio, Services Strength to Benefit Apple (AAPL)\nUser Growth, Instagram Strength Aids Meta Platforms (META)\nIntel (INTC) Rides on Manufacturing Focus, AI Chip Launch\nFeatured Reports\nElectronic Focus Aid Interactive Brokers (IBKR), Costs a WoePer the Zacks analyst, development of proprietary software and focus on the Electronic Brokerage segment will aid Interactive Brokers. Higher costs due to technology upgrades will likely hurt profits.\nDiamondback (FANG) to Benefit from Low Breakeven CostsThe Zacks analyst likes Diamondback Energy's extremely low oil price breakeven costs, wherein the company needs the commodity to be at just $50 a barrel to be profitable.\nStrategic Acquisition Aid ICON (ICLR) Amid Stiff CompetitionThe Zacks analyst is impressed with ICON's recent acquisition of Philips Pharma Solutions which enhances ICON's medical imaging experience and capabilities. Yet, stiff rivalry remains a concern.\nCincinnati Financial (CINF) Benefits From Commercial LinesPer the Zacks analyst, consistent progress at the Commercial Lines Insurance segment backed by solid premiums earned and several growth initiatives contributes to revenue growth of the company.\nKaruna (KRTX) Banks on Lead Candidate KarXT Amid CompetitionPer the Zacks analyst, the successful development and subsequent approval of KarXT will be a huge boost for Karuna as the psychosis market has immense potential. Competition remains an overhang.\nAcquisitions, Diverse Customer Base Aid NRG Energy (NRG)Per the Zacks analyst, NRG Energy's organic and inorganic acquisitions, is likely to boost its results. Its diverse customer base and retention of customers increases earnings predictability.\nMaximus (MMS) Gains From Recent Acquisition Amid High DebtPer the Zacks Analyst, the acquisition of Stirling Institute of Australia strengthens Maximus' employment services. Meanwhile, the high debt burden is concerning.\nNew Upgrades\nDeckers' (DECK) Omni-Channel Efforts Likely to Fuel Top LinePer the Zacks analyst, Deckers' focus on introducing more innovative line of products, marketing and optimizing omni-channel distribution are likely to propel top line.\nStrategic Buyouts & Growth Plans Aid Armstrong World (AWI)Per the Zacks analyst, Armstrong World is benefiting from accretive buyouts, strategic pricing and digital initiatives. Also, investments in new products and shareholder value bode well.\nStrength in Vista & National Pen Units Drive Cimpress (CMPR)Per the Zacks analyst, strength in Cimpress' Vista and National Pen units, fueled by robust demand for promotional products, apparel and marketing materials, will continue to lend momentum to it.\nNew Downgrades\nLower Headcount at Client Offices to Impact Paycom (PAYC)Per the Zacks Analyst, Paycom's near-term results are likely to be hurt by headcount reductions across its client base due to growing recession concerns amid macroeconomic uncertainties.\nSluggish Data Center Market Hurt Advanced Energy (AEIS)Per the Zacks Analyst, Advanced Energy is suffering from weakness in Industrial & Medical as well as Data Center computing end-markets.\nLeggett & Platt (LEG) Ails From Weak Demand & InflationPer the Zacks analyst, Leggett & Platt hurt from soft demand, primarily in the furniture, flooring, and textile and bedding product segments along with inflationary market and normal seasonality.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\nICON PLC (ICLR) : Free Stock Analysis Report\nDiamondback Energy, Inc. (FANG) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-08T06:30:26.000Z",
        "Title": "Meta Platforms Inc's Chief Legal Officer Sells Company Shares",
        "Author": "  GuruFocus Research ",
        "Text": "Meta Platforms Inc (NASDAQ:META), a leading technology company specializing in social media and related products and services, has reported an insider sale according to a recent SEC filing. Chief Legal Officer Jennifer Newstead sold 585 shares of the company on March 5, 2024.The transaction was executed at a price of $495 per share, resulting in a total sale amount of $289,575. This sale has adjusted Jennifer Newstead's total sold shares over the past year to 31,276, with no recorded purchases in the same period.\nThe insider transaction history at Meta Platforms Inc reveals a pattern of insider sales, with a total of 178 insider sells and no insider buys over the past year. This trend may be of interest to investors monitoring insider behaviors as a signal for company performance and stock valuation.\nOn the valuation front, Meta Platforms Inc's market cap stands at $1,305,779.801 billion as of the date of the insider's recent sale. The company's price-earnings ratio is currently 34.38, which is above both the industry median of 20.805 and the historical median for the company. This indicates a higher valuation compared to its peers and its own past performance.Furthermore, with a stock price of $495 and a GuruFocus Value of $344.73, Meta Platforms Inc is trading at a price-to-GF-Value ratio of 1.44, suggesting that the stock is Significantly Overvalued according to GuruFocus's intrinsic value estimate. The GF Value is determined by considering historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from Morningstar analysts.Investors and analysts often monitor insider transactions as they can provide insights into how the company's executives view the stock's value and future prospects. The recent sale by the insider, along with the overall trend of insider sales at Meta Platforms Inc, may be a factor for market participants to consider in their investment decisions.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-06T21:00:00.000Z",
        "Title": "Meta Materials Releases Letter to Shareholders Regarding Upcoming Special Meeting",
        "Author": "  Meta Materials Inc. ",
        "Text": "HALIFAX, NS / ACCESSWIRE / March 6, 2024 / Meta Materials Inc. (the \"Company\" or \"META\") (Nasdaq:MMAT), an advanced materials and nanotechnology company, today released the following message to shareholders.\nDear Shareholders,\nCommercialization requires capital.\nThat is a basic premise upon which we are requesting your approval at the upcoming special stockholders' meeting for an increase in the total number of common shares we are authorized to issue. We don't take this proposal lightly and intend to be judicious in issuing future shares to meet our commercialization and working capital needs.\nTo date, we have several joint developments for manufacturing and production, including our collaboration with Panasonic Industry for high-volume manufacturing of 60-cm wide NANOWEB® material. We have some other developing relationships with industry heavyweights, who have requested confidentiality in the final stages of production testing.\nIn the 2023 restructuring, we streamlined the business to focus on four core technologies. Every effort and resource has been allocated to commercialize META's cutting-edge innovations, and we are ready to launch several products (For a more comprehensive overview of our current product line-up, please view the META Investor Presentation released in January 2024 at www.metamaterial.com). Broad-scale production of our products is capital intensive, replete with long lead-time components, machinery and equipment costs and raw material sourcing unique to each product line. A few examples include:\nVLEPSIS flight testing should be completed in March 2024, with potential customers eagerly anticipating final results. To shorten the time between orders and delivery, we need to procure component and subassembly inventory to address the projected immediacy of demand.\nSeveral international currency suppliers want to adopt META's recently launched QUANTUM™ stripe security features. To meet burgeoning demand, we need to bolster production capabilities in our Thurso facility. We expect such efforts will increase volumes and yield higher margins for our authentication business.\nNotable global battery original equipment manufacturers (OEMs) have been successfully using META's NPORE and NCORE products in limited runs. We now have production requests for different sizes and significantly higher quantities; plans to scale up production require investment.\nThese few examples are illustrative of the positive demand metrics we see, constrained primarily by production limitations. As a result, we are relying on our shareholders to help us reach this next milestone that may put META on the path toward success.\nWe are planning a Q&A in the coming days to add more detail to our business strategy about commercialization, as well as the authorized share increase proposal to be voted on at the special meeting. In early April, we plan to hold a webcast to provide a business update and discuss our 2023 results.\nAt the end of the day, growth companies need access to capital. If META is constrained from bringing products to market, business viability would likely suffer. We hope you will consider joining your fellow stockholders in voting to approve this measure.\nThank you for your time and consideration, and your support of META.\nSincerely,\nUzi SassonPresident and CEO\nAbout Meta Materials Inc.\nMeta Materials Inc. (META) is an advanced materials and nanotechnology company. We develop new products and technologies using innovative sustainable science. Advanced materials can improve everyday products that surround us, making them smarter and more sustainable. META® technology platforms enable global brands to develop new products to improve performance for customers in aerospace and defense, consumer electronics, 5G communications, batteries, authentication, automotive and clean energy. Learn more at www.metamaterial.com.\nMedia and Investor Inquiries\nRob StoneVice President, Corporate Development and CommunicationsMeta Materials Inc.media@metamaterial.comir@metamaterial.com\nForward Looking Information\nThis press release includes forward-looking information or statements within the meaning of Canadian securities laws and within the meaning of Section 27A of the Securities Act of 1933, as amended, Section 21E of the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995, regarding the Company, which may include, but are not limited to, statements with respect to the business strategies, product development, restructuring plans and operational activities of the Company. Often but not always, forward-looking information can be identified by the use of words such as \"pursuing\", \"potential\", \"predicts\", \"projects\", \"seeks\", \"plans\", \"expect\", \"intends\", \"anticipated\", \"believes\" or variations (including negative variations) of such words and phrases, or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"will\" be taken, occur or be achieved. Such statements are based on the current expectations and views of future events of the management of the Company and are based on assumptions and subject to risks and uncertainties. Although the management of the Company believes that the assumptions underlying these statements are reasonable, they may prove to be incorrect. The forward-looking events and circumstances discussed in this release may not occur and could differ materially as a result of known and unknown risk factors and uncertainties affecting the Company, the capabilities of our facilities, research and development projects of the Company, the total available market and market potential of the products of the Company, the market position of the Company, the need to raise more capital and the ability to do so, the scalability of the Company's production ability, capacity for new customer engagements, material selection programs timeframes, the ability to reduce production costs, enhance metamaterials manufacturing capabilities and extend market reach into new applications and industries, the ability to accelerate commercialization plans, the possibility of new customer contracts, the continued engagement of our employees, the technology industry, market strategic and operational activities, and management's ability to manage and operate the business. More details about these and other risks that may impact the Company's businesses are described under the heading \"Forward-Looking Information\" and under the heading \"Risk Factors\" in the Company's Form 10-K filed with the SEC on March 23, 2023, in the Company's Form 10-K/A filed with the SEC on March 24, 2023, in the Company's Form 10-Q filed with the SEC on November 13, 2023, and in subsequent filings made by Meta Materials with the SEC, which are available on SEC's website at www.sec.gov. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on any forward-looking statements or information. No forward-looking statement can be guaranteed. Except as required by applicable securities laws, forward-looking statements speak only as of the date on which they are made and the Company does not undertake any obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise, except to the extent required by law.\nSOURCE: Meta Materials Inc.\nView the original press release on accesswire.com\n"
    },
    {
        "Date": "2024-03-16T00:24:29.000Z",
        "Title": "Meta wins appeal of court order to stop using its name in Brazil",
        "Author": "Reuters ",
        "Text": "SAO PAULO (Reuters) -Facebook-parent Meta on Friday won an appeal overturning a previous court ruling that barred it from using its name in Brazil due to confusion with another company.\nMark Zuckerberg's tech company was in late February ordered to stop using its name in Brazil within 30 days after a Brazilian computer services provider won a favourable ruling arguing it already owned rights to the name and had as a result of the U.S. branding been wrongly cited in over 100 lawsuits.\nIn a statement, the Brazilian Meta said it owned the name's rights in Brazil, adding it believed the law should be followed \"regardless of business decisions made by groups that want to operate in our country\".\nThe company can still appeal the decision.\nU.S. Meta, formerly called Facebook, changed its name in 2021 in a rebrand that focused on building the \"metaverse,\" a shared virtual environment.\n(Reporting by Andre RomaniEditing by Chris Reese and Rosalba O'Brien)\n"
    },
    {
        "Date": "2024-03-04T11:00:11.000Z",
        "Title": "Invest with Confidence: Intrinsic Value Unveiled of Meta Platforms Inc",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Meta Platforms Inc's (NASDAQ:META) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nAs of 2024-03-04, Meta Platforms Inc's intrinsic value as calculated by the Discounted Earnings model is $469.25. It's currently trading at a price of $502.3. Therefore, the margin of safety based on the DCF model is -7.04%. The company is fair valued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Meta Platforms Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$15.02\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.2%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 35.70% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n532.69\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n796.35\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n469.25\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $521.47. This valuation indicates that the Meta Platforms Inc is fair valued, accompanied by a margin of safety of 3.68%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-28T06:00:36.000Z",
        "Title": "Meta Platforms Inc's Chief Legal Officer Jennifer Newstead Sells Company Shares",
        "Author": "  GuruFocus Research ",
        "Text": "Meta Platforms Inc (NASDAQ:META), a leading technology company specializing in social networking services and digital platforms, has reported an insider sale according to a recent SEC filing. Chief Legal Officer Jennifer Newstead sold 585 shares of the company on March 26, 2024.Jennifer Newstead, who holds a key executive position within the company, executed the sale at an average price of $505.29 per share, which resulted in a transaction amount of approximately $295,594.65. This transaction has been officially filed with the SEC, and the document can be viewed through this link.Over the past year, the insider has sold a total of 32,245 shares of Meta Platforms Inc and has not made any purchases of the stock. The insider transaction history for the company shows a pattern of sales by insiders, with a total of 211 insider sells and no insider buys over the past year.\nOn the valuation front, Meta Platforms Inc's shares were trading at $505.29 on the day of the insider's recent sale, giving the company a market capitalization of approximately $1,259.28 billion. The price-earnings ratio stands at 33.14, which is above the industry median of 21.18 but below the company's historical median price-earnings ratio.According to the GuruFocus Value indicator, with a share price of $505.29 and a GF Value of $348.11, Meta Platforms Inc is considered Significantly Overvalued, with a price-to-GF-Value ratio of 1.45. The GF Value is a proprietary intrinsic value estimate from GuruFocus, which takes into account historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from analysts.\nMeta Platforms Inc operates a range of social networking sites and digital platforms, including Facebook, Instagram, and WhatsApp, among others. The company's platforms are used by a large global audience for communication, content sharing, and community building. Meta Platforms Inc continues to be a significant player in the technology sector, with a focus on innovation and expansion into new areas such as virtual reality and augmented reality through its Oculus products and services.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-20T12:52:40.000Z",
        "Title": "Here’s Why Sequoia Fund Trimmed Meta Platforms (META)",
        "Author": "  Soumya Eswaran ",
        "Text": "Ruane, Cunniff & Goldfarb, an investment adviser managing Sequoia Fund, released its Q4 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, the fund returned 13.31% compared to an 11.69% return for the S&P 500 Index. The fund generated a 27.83% return in 2023 compared to a 26.29% return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nSequoia Fund featured stocks like Meta Platforms, Inc. (NASDAQ:META) in its Q4 2023 investor letter. Headquartered in Menlo Park, California, Meta Platforms, Inc. (NASDAQ:META) is a technology company that develops products to connect people. On March 19, 2024, Meta Platforms, Inc. (NASDAQ:META) stock closed at $496.24 per share. One-month return of Meta Platforms, Inc. (NASDAQ:META) was 6.03%, and its shares gained 148.36% of their value over the last 52 weeks. Meta Platforms, Inc. (NASDAQ:META) has a market capitalization of $1.265 trillion.\nSequoia Fund stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its fourth quarter 2023 investor letter:\n\"Two additional trims, in Meta Platforms, Inc. (NASDAQ:META) and Carmax, were more substantive in nature. When Meta’s stock declined in 2022, we judged it to be significantly mispriced and held our ground through the bottom. We trimmed the position serially last year as the stock soared because we were wary of holding a large position exposed to significant regulatory risks, particularly in Europe. We are comfortable owning Meta at today’s much-reduced weighting and current valuation. The smaller position size reflects our updated assessment of the balance of long-term risk versus reward.\"\nMeta Platforms, Inc. (NASDAQ:META) is in third position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Meta Platforms, Inc. (NASDAQ:META) was held by 242 hedge fund portfolios, up from 234 in the previous quarter, according to our database.\nWe discussed Meta Platforms, Inc. (NASDAQ:META) in another article and shared the list of stocks whose price targets were recently raised by analysts. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\nWall Street Analysts See Upside Potential for 10 Stocks with Rising Price Targets\n10 Best Gold ETFs To Buy Now\n15 Worst Places in Texas for a Couple to Live on Only a Social Security\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-03-14T13:00:00.000Z",
        "Title": "W4 Games and Meta Team Up to Expand Open-Source Godot Ecosystem on Meta Quest",
        "Author": "Business Wire ",
        "Text": "Thanks to Meta and W4’s partnership supporting the Godot engine, developers will be able to build and ship VR And MR apps for the Meta Quest platform with all the power of Godot by July 2024.\nDUBLIN & SAN FRANCISCO, March 14, 2024--(BUSINESS WIRE)--W4 Games, on a mission to help the video game industry reclaim control by strengthening the open-source Godot ecosystem, today announced that it is collaborating with Meta to significantly improve the game developer experience with Godot on the Meta Quest Platform. By empowering developers who choose the Godot engine to create and publish extended reality (XR) games, the companies will expand the Godot games portfolio on Meta Quest and the open-source game development ecosystem.\n\"We’re really excited to announce this new partnership with Meta since we believe it will provide great new opportunities for Godot game developers and allow them to reach out to new audiences through the Meta Quest Platform. The future of the gaming experience will be highly impacted by new XR technologies and we are confident that this strategic collaboration will augment Godot’s growth path,\" said Nicola Farronato, Co-CEO of W4 Games.\nMeta Quest is one of the most compelling platforms to provide virtual and mixed-reality experiences and entertainment, and it is fueled by games, applications, and interactive content. The Godot Engine is a free and open-source technology for 2D and 3D game creation that became popular among indies for its ease of use, very fast learning curve, and permissive license (MIT). In 2023, more than a thousand commercial Godot games were published and a growing number of promising titles signal the accelerating adoption by the game development community. With a strong, year-over-year growth rate, Godot has climbed the rankings of the game industry to challenge well-established proprietary solutions and expand to fast-growing gaming segments like virtual and mixed reality.\nMeta and W4’s strategic collaboration enables new and exciting opportunities for the fast-growing Godot users community, the open-source gaming community, and Quest users alike. In particular, the partnership will cover:\nImproving functionality, performance and usability of OpenXR features within Godot for the benefit of all VR developers\nProviding an integration of the Meta Quest SDKs via plugin and exposing more Meta Quest features to end-users\nDeveloping an optimized release template specifically for Quest users that leverages Meta Quest technology\nCreating high-quality samples and documentation to help Godot users develop for Meta Quest\nThe strategic partnership also contemplates the development of educational materials and joint marketing activities in the coming years. Meta and W4 Games are dedicated to contributing as much of this work as possible to the Godot project as part of our shared commitment to the open-source community.\nLearn more about Godot — and celebrate at GDC\nDevelopers can learn more about building games with the Godot Engine at GDC 2024. Visit the Godot Pavilion, booth S763, North & South Halls — and celebrate the passionate community at the heart of the open-source movement transforming game development.\nAbout W4 Games\nFounded in 2021, W4 Games is an Irish startup formed by Godot veterans Juan Linietsky, Rémi Verschelde and Fabio Alessandrelli, and veteran entrepreneur Nicola Farronato. The company plans to revolutionize the game industry by bringing the Commercial Open Source Software (COSS) business model to an ecosystem that has traditionally relied on proprietary solutions from an ever-shrinking number of independent vendors. By providing a commercial services offering anchored in the entirely open and community-developed Godot platform, W4 Games believes that companies will be able to reclaim control of the technology powering their games, with a level of freedom and flexibility they never had before.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240314670069/en/\nContacts\nSara BlackBospar213.618.1501sara@bospar.com\n"
    },
    {
        "Date": "2024-03-06T17:00:54.000Z",
        "Title": "Meta urged by US states to combat Facebook, Instagram account hijackings",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nNEW YORK, March 6 (Reuters) - Forty U.S. states and Washington, D.C. called on Meta Platforms to crack down on scammers who hijack Facebook and Instagram accounts, to address a \"dramatic\" surge in account takeovers.\nIn a letter to Meta's chief lawyer, states led by New York Attorney General Letitia James said fraudsters are \"winning the war and running rampant on Meta,\" after the company in November 2022 announced thousands of job cuts focused on security and privacy.\nThe states said New York has since 2019 received a 1,000% increase in complaints about scammers who access accounts and change passwords, enabling them to read private messages and pose as actual users to deceive contacts and the public.\nFour of the states — Illinois, North Carolina, Pennsylvania and Vermont — reported increases in complaints exceeding 250% in the last year alone.\n\"Social media is how millions of Americans connect,\" James said in a statement. \"Having your social media account taken over by a scammer can feel like having someone sneak into your home and change all of the locks.\"\nThe states urged Meta to spend more money to prevent account takeovers, including through increased staffing, and to work more closely with people whose accounts are hacked.\nIn an emailed statement, a Meta spokeswoman said the Menlo Park, California-based company invests \"heavily\" in technology and staffing to identify compromised accounts, and shares tips with users and law enforcement to address the problem.\nAlso signing the letter were Alabama, Alaska, Arizona, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Iowa, Kentucky, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, Ohio, Oklahoma, Oregon, Rhode Island, South Carolina, South Dakota, Tennessee, Utah, Virginia, Washington, West Virginia, Wisconsin and Wyoming.\nIn October, 41 states and Washington, D.C. sued Meta, claiming the company designed its platforms to addict children, damaging their mental health. (Reporting by Jonathan Stempel in New York Editing by Bill Berkrot)\n"
    },
    {
        "Date": "2024-03-05T22:42:32.000Z",
        "Title": "Facebook, Instagram and Threads were all down in massive Meta outage on Super Tuesday",
        "Author": "  Sarah Perez ",
        "Text": "Reports are coming in that a number of Meta's top social apps, including Facebook, Instagram, and Threads, are all experiencing an outage on Tuesday morning. When loading the apps or websites, users receive an error message that \"something went wrong\" and to try again later, or, in the case of Facebook, they're taken to a logged-out landing page but are unable to sign in even when using their correct password. [Update: 12:11 p.m. ET: The apps appear to be working again. Meta said at 12:19 p.m. ET that the issue was \"technical\" in nature.]\nThe troubles seem to have started at some point after 10 a.m. ET on Tuesday, according to reports on social media and various user-submitted issue trackers, like DownDetector. However, Meta's own status page only shows results related to Meta's business products, like Ads Manager, not the platforms as a whole. We've reached out to Meta to confirm the timing and the reports and will update if we hear more information. In the meantime, Meta communications director Andy Stone has confirmed the outage in a post on X, noting, \"We're aware people are having trouble accessing our services. We are working on this now.\"\nIt's highly unusual for Meta to be experiencing a widespread outage like this, given the size and scale of its network and the redundancies built in. For that reason, some people are suspicious about the origins of this outage, particularly because it's election day across a number of U.S. states, which means millions of people are headed to the polls to vote in the primary on what's known as Super Tuesday. This outage, then, comes at a terrible time for any candidates or political organizations looking to do last-minute voter outreach efforts or those reminding people to go vote.\nMeta's suite of apps has played a large role during the election cycle, given that its family of apps, which also includes WhatsApp, now reach 3.98 million monthly active users as of the end of last year, the company's data shows. To quell its potential role in influencing the elections' outcome, Meta disabled political ads in the timeframe leading up to key elections, like the U.S. midterms. To address newer concerns, Meta also announced it would label political ads with AI-generated imagery for the 2024 election cycle.\nRelated to elections and social media discussions, Meta last week said it would be exiting the news business in the U.S. and Australia with the removal of the News tab in April 2024.\nAmazon Web Services' service health status currently shows there are no recent issues, but Meta operates its own data centers, which could still be experiencing an issue, despite whether or not AWS was seeing a problem.\nWhile some people have reported seeing issues with other sites, like YouTube and X (formerly Twitter), those platforms appear to be currently up.\nX CEO Linda Yaccarino posted an update shortly after the news of the Meta outage broke to confirm that X was not seeing issues of its own.\n\"Testing, testing... affirmative, everything is functioning smoothly here,\" she wrote.\nX owner Elon Musk meanwhile mocked the outage with a meme. In a separate post, he also added, \"If you’re reading this post, it’s because our servers are working.\"\nThe issues at Meta seem to stretch beyond just its consumer-facing apps, as company employees have also posted on X that they are unable to log in to work as well. One Meta Reality Labs employee noted they were even booted out of work \"mid meeting.\"\nRemarked app developer Nikita Bier, whose app TBH was acquired by Meta, \"Last time Facebook did a forced logout of everyone, it was hacked, where adversaries leveraged a bug with the View-As feature.\"\nMeta did not indicate that it was hacked today, but the timing had raised people's concerns.\nRoughly a couple of hours after the outage began, it was resolved. In a post on X, Stone said, \"Earlier today, a technical issue caused people to have difficulty accessing some of our services. We resolved the issue as quickly as possible for everyone who was impacted, and we apologize for any inconvenience.\"\nYouTube is down too, site confirms\nFacebook plans to shut down its news tab in the US and Australia\nDiscord comes back online after widespread outage\n"
    },
    {
        "Date": "2024-03-04T10:20:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Apple, Meta Platforms, Intel, Brokers Group and ICON",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 4, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Apple Inc. AAPL, Meta Platforms, Inc. META, Intel Corp. INTC, Brokers Group, Inc. IBKR and ICON Public Limited Co. ICLR.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc., Meta Platforms, Inc. and Intel Corp. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Apple’s shares have outperformed the Zacks Computer - Mini computers industry over the past year (+24.5% vs. +24.0%). The company is benefiting from steady iPhone sales amid stiff competition and weakness in China. It expects the March quarter’s revenues and iPhone revenues to be similar to that of the year-ago quarter’s figure after removing the additional $5 billion it generated due to pent-up demand for iPhone 14 and iPhone 14 Pro Max in the year-ago quarter.Unfavorable forex is expected to hurt revenues by 2% on a year-over-year basis. For the Services segment, Apple expects a double-digit growth rate, similar to the December-end quarter. Strong adoption of Apple TV+ driven by strong content is a key catalyst.Apple is gaining share in PCs which is positive. Apple’s strong cash balance and shareholder friendly approach to dividend and share repurchase is noteworthy. However, growing legal complexities has been a headwind.(You can read the full research report on Apple here >>>)Shares of Meta Platforms have outperformed the Zacks Internet - Software industry over the past year (+181.1% vs. +73.1%). The company is benefiting from steady user growth across all regions, particularly Asia Pacific. Increased engagement for its offerings like Instagram, WhatsApp, Messenger and Facebook has been a major growth driver.Meta Platforms is leveraging AI to recommend Reels content, which is driving traffic on Instagram and Facebook. Its innovative portfolio, which includes Threads, Reels, Llama 2, Ray-Ban Meta smart glass, and mixed reality device Quest 3 is likely to aid prospects. Reels continued to do very well across both Instagram and Facebook driven by growing adoption.People reshared Reels 3.5 billion times every day during the fourth-quarter. However, challenging macroeconomic conditions remain a headwind for Meta’s advertising revenues. Slow monetization of Reels, along with mounting operating losses at Reality Labs, are concerns.(You can read the full research report on Meta Platforms here >>>)Shares of Intel have gained +65.9% over the past year against the Zacks Semiconductor - General industry’s gain of +163.3%. The company is focusing on establishing an advanced semiconductor manufacturing ecosystem and has expanded global production capabilities under its IDM 2.0 (integrated device manufacturing) strategy.It remains on track with its 5N4Y (five nodes in four years) program in order to regain transistor performance and power performance leadership by 2025. Intel has launched AI chips for data centers and PCs to gain a firmer footing in the expansive AI sector and ubiquitous edge environment.However, weak demand trends and sluggish recovery in China are affecting its revenues. Macroeconomic challenges, inventory adjustments and intense market volatility are straining margins. Stiff competition in the server, storage and networking markets has hurt its long-term growth potential to some extent. For the first quarter of 2024, Intel has offered a muted guidance.(You can read the full research report on Intel here >>>)Other noteworthy reports we are featuring today include Interactive Brokers Group, Inc. and ICON Public Limited Co.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\nICON PLC (ICLR) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-14T13:15:00.000Z",
        "Title": "UNITE HERE: Contracted Food Service Workers at Meta Struggle to Afford Housing and Food Despite Meta’s Surging Profits",
        "Author": "Business Wire ",
        "Text": "In a report released by the workers’ union, 74% of Flagship and Yarzin Sella workers surveyed at Meta reported that they lacked money to cover rent, 55% lacked money for food\nMENLO PARK, Calif., March 14, 2024--(BUSINESS WIRE)--According to a new UNITE HERE report, contracted food service workers working in Meta cafeterias nationwide struggle to afford basics like rent and food. In the report, \"Food Service Workers at Meta Need A Raise,\" employees of the company’s food service contractors, Flagship and Yarzin Sella, say the aftermath of skyrocketing inflation has left them living paycheck to paycheck, late on rent, and skipping meals.\nIn a survey of 72% (788) of union food service workers at Meta’s contractors in the San Francisco Bay Area, Seattle, New York, Washington, DC, and Cambridge, MA, many reported serious economic insecurity during the past year.\n74% lacked money to cover rent, mortgage, or other housing costs; 66% had been late on rent; 12% stayed in an abusive living situation because they did not have the money to move.\n55% lacked money to cover food for themselves or their household; 33% reported they skipped meals because they didn’t have money to buy food.\n71% of workers surveyed had less than $500 on hand in case of an emergency.\n42% worked a second job.\nWomen are underrepresented in best-paid food service jobs at three Meta cafeterias (San Jose, San Francisco, and New York), leading to a pay gap of over $2,700 a year.\nMeanwhile, Meta reported $46.7 billion in income from operations in 20231 and has been ranked the 6th largest tech company by revenue2.\n\"I'm just trying to survive, I can’t make it on $23.75 an hour. I’ve already had to use a lot of my savings just to feed my family, and it’s scary living paycheck to paycheck. On top of that, I’m diabetic, and being able to afford insulin in incredibly important,\" said Cesar Perez, a Flagship receiver with UNITE HERE Local 19 at Meta Menlo Park.\n\"The way things are now, my daughter always gets to eat – but I don’t. We work for Flagship feeding tech workers at such a wealthy company, we deserve so much better. That’s why I’m fighting for better wages, job protection, and most of all respect in my new contract,\" said Jordan Hill, a Flagship prep cook with UNITE HERE Local 2 at Meta San Francisco.\nAround 1,000 workers in Menlo Park, Sunnyvale, San Francisco, Fremont, New York, Seattle, Washington D.C., and Cambridge, MA, are in negotiations with Flagship and Yarzin Sella for new union contracts, calling for the same economic gains other contracted tech food service workers have won.\nRecently, over 4,500 UNITE HERE members at Google cafeterias employed by Compass, Guckenheimer, and Sodexo won historic second union contracts that set a standard for all industry food service workers, including a minimum raise of $7 an hour over the life of the contract, continued free family healthcare, protections against layoffs, gender identity protections, and more.\n\"We’re part of the engine of these tech companies and the economy in our cities. We’re being disrespected by Flagship and Yarzin Sella at Meta – we're not asking them to be different, we’re asking them to meet the standard for the industry,\" said Enrique Fernandez, UNITE HERE Vice President for Immigration, Diversity, and Civil Rights and Local 19 Business Manager. \"Workers don’t have share prices. We need to pay the rent, we need to be able to survive.\"\n1 Meta 10-K for 2023, p. 90. https://www.sec.gov/ixviewer/ix.html?doc=/Archives/edgar/data/0001326801/000132680124000012/meta-20231231.htm 2 https://fortune.com/ranking/global500/search/?sector=Technology\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240314638625/en/\nContacts\nAllyssa Pollard, apollard@unitehere.org, 202-769-8867\n"
    },
    {
        "Date": "2024-03-11T14:14:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Nvidia, Constellation Energy, Meta Platforms, Advanced Micro Devices and Eli Lilly",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 11, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Nvidia Corporation NVDA, Constellation Energy Corp. CEG, Meta Platforms META, Advanced Micro Devices AMD and Eli Lilly and Co. LLY.\nHere are highlights from Friday’s Analyst Blog:\nThe S&P 500 soared to new all-time highs on reassuring comments regarding potential interest rate declines. SPDR S&P 500 ETF Trust, the proxy version of the S&P 500 Index, has risen 8.3% so far this year.\nWe have highlighted five stocks that have gained in double digits so far this year. These are Nvidia Corporation, Constellation Energy Corp., Meta Platforms, Advanced Micro Devices and Eli Lilly and Co..\nThe Federal Reserve Chair Jerome Powell told a U.S. Senate committee that the central bank is \"not far\" from being confident that inflation is declining toward the 2% target, which would make rate cuts possible. The comment has bolstered investor expectations for the first rate cut in June.\nPowell noted that inflation had \"eased substantially\" since hitting a 40-year high in 2022 but that policymakers still needed \"greater confidence\" in its continued decline before cutting rates. He added that there are risks of keeping monetary policy tight for too long and damaging an ongoing economic expansion that has sustained a below 4% unemployment rate for two years.\nThe latest bouts of weak data have also raised the bets that the Fed might lower interest rates as soon as June. The U.S. manufacturing sector recorded its 16th consecutive month of decline in February, while Michigan University's consumer confidence index dropped slightly last month. U.S. personal spending data also showed the weakest reading in three years. Traders now see a 72.7% chance of the first rate cut this year in June, per CME Group's FedWatch tool (read: Is US Manufacturing Space Improving? 4 Sector ETFs Look Decent).\nFurther, the European Central Bank might also start cutting rates as soon as June on a softer outlook for inflation and economic growth.\nLet's take a closer look at the fundamentals of SPY.\nSPDR S&P 500 ETF Trust holds 503 stocks in its basket, with each accounting for no more than 7% of the assets. This suggests a nice balance across each security and prevents heavy concentration. The fund is widely spread across sectors with information technology, financials, healthcare and consumer discretionary accounting for a double-digit allocation each.\nSPDR S&P 500 ETF Trust has an AUM of $497.7 billion and charges 9 bps in fees per year. It trades in an average daily volume of 65 million shares and has a Zacks ETF Rank #3 (Hold) with a Medium-risk outlook (see: all the Large Cap Blend ETFs here).\nBelow, we have highlighted the above-mentioned five best-performing stocks in the ETF.\nNvidia is the worldwide leader in visual computing technologies and the inventor of graphic processing unit or GPU. The stock has jumped 87% so far this year. It has an estimated growth of 79.2% for the fiscal year ending January 2025.\nNvidia makes up 5.1% of the assets in SPY and has a Zacks Rank #1 (Strong Buy) at present. It has a Growth Score of A. You can see the complete list of today's Zacks #1 Rank stocks here.\nConstellation Energy generates and markets electricity. It sells natural gas, renewable energy and other energy-related products and services. The stock has jumped 53.6% so far this year. It makes up 0.13% of the assets in the SPY portfolio.\nConstellation Energy has an expected earnings growth rate of 42.7% for this year and a Zacks Rank #3 (Hold). It has a Momentum Score of A (read: Nasdaq ETF Logs Best Month Since 2015: 5 Top Stocks).\nMeta Platforms is the world's largest social media platform. The company's portfolio offering evolved from a single Facebook app to multiple apps like the photo and video sharing app Instagram and WhatsApp messaging app due to acquisitions. The stock has jumped 44.7% and has an estimated earnings growth of 34.1% for this year.\nMeta Platforms accounts for 2.6% of SPY's assets. It currently has a Zacks Rank #1 and a Growth Score of B.\nAdvanced Micro Devices has strengthened its position in the semiconductor market. It has evolved from a pure-bred consumer-PC chip provider to an enterprise-focus company. The stock has rallied 43.4% so far this year and accounts for 0.79% of the SPY portfolio.\nAdvanced Micro Devices has an estimated earnings growth rate of 30.6% for this year and has a Zacks Rank #3.\nEli Lilly is one of the world's largest pharmaceutical companies and boasts a diversified product profile, including a solid lineup of new successful drugs. The stock has gained 33.8% and accounts for a 1.4% share in the SPY portfolio.\nEli Lilly has an estimated earnings growth rate of 96.8% for this year and a Zacks Rank #3 at present.\nWant key ETF info delivered straight to your inbox? \nZacks' free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week.\nGet it free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nConstellation Energy Corporation (CEG) : Free Stock Analysis Report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-13T14:36:05.000Z",
        "Title": "Nvidia's Artificial Intelligence (AI) Chips Power 2 Behemoth Supercomputers for Meta Platforms",
        "Author": "  Jose Najarro, The Motley Fool ",
        "Text": "In today's video, I discuss recent updates affecting Nvidia (NASDAQ: NVDA) and Meta Platforms (NASDAQ: META). Check out the short video to learn more, consider subscribing, and click the special offer link below.\n*Stock prices used were the after-market prices of March 12, 2024. The video was published on March 13, 2024.\nShould you invest $1,000 in Nvidia right now?\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jose Najarro has positions in Meta Platforms and Nvidia. The Motley Fool has positions in and recommends Meta Platforms and Nvidia. The Motley Fool has a disclosure policy. Jose Najarro is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\nNvidia's Artificial Intelligence (AI) Chips Power 2 Behemoth Supercomputers for Meta Platforms was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-11T14:30:00.000Z",
        "Title": "Zuckerberg Trying To Catch Up To Bezos's Yacht Game: Meta Platforms CEO Spends $330 Million On Yachts",
        "Author": "  Aran Richardson ",
        "Text": "Owning a superyacht is a rite of passage for tech billionaires. Meta Platforms Inc. CEO Mark Zuckerberg and Amazon.com Inc. Founder Jeff Bezos, two of the wealthiest people on the planet, have each made headlines with their extravagant yacht purchases. Zuckerberg recently acquired two luxury vessels totaling $330 million, including a yacht and a support yacht.\nWhile $330 million is a lot of money, it's not going to put a significant dent in Zuckerberg's net worth. According to the Forbes Real-Time Billionaires List from March 7, Zuckerberg is worth $179.5 billion. A $330 million expenditure comes out to 0.18% of that. That's the equivalent of someone with a $1 million net worth spending $1,800 on a fancy canoe.\nDon't Miss:\nWealthTech startup unlocks a $33 trillion home equity market and you can own a stake in it with just $250.\nNew homebuilding startup could be in the right place at the right time to shock real estate market – and it sells for $5 per share.\nZuckerberg’s flagship purchase is the Launchpad, a 387-foot beauty that boasts a helipad, dive center and decompression chamber — perfect for Zuckerberg’s adventurous spirit. Additional features include a massive observation lounge, a pool and a bar area. Industry publication Luxury Launches notes it will likely cost Zuckerberg at least $30 million per year to operate Launchpad.\nAccommodating 24 guests and a crew of 48, Launchpad offers luxury and comfort on a grand scale. Zuckerberg’s second purchase, the support vessel Wingman, provides additional space and amenities, including a helideck and a dive center. Wingman includes space for a variety of toys, such as a submersible, various rescue tenders, diving gear, Vespa scooters and a host of other vehicles and equipment.\nOriginally commissioned by Russian oligarch Vladimir Potanin, the ship remained in its Dutch shipyard for some time before the Dutch authorities allowed its sale to a non-Russian — Zuckerberg.\nTrending: Fortnite’s creator company greenlights partial ownership for up to 100 accredited investors in the upcoming series.\nIn terms of size and expense, Bezos’s superyacht and his support vessel dwarfs Zuckerberg’s. Bezos owns Koru, the world's largest sailing yacht, which reportedly cost at least $500 million. His support ship Abeona is a 246-foot motor yacht that carries crew and an array of vehicles and supplies. Bezos took steps in late 2023 to hide his yacht's location from the public, turning off Koru's automatic identification system (AIS), a data tracker that transmits a ship's course and other information to improve safety and communication with nearby ships.\nOther billionaires, including LVMH Chairman and CEO Bernard Arnault, also own yachts. Arnault owns Symphony a 333-foot luxury yacht. While Bezos's 417-foot yacht is gigantic and ostentatious, it is also surpassed by other mega yachts. The House of Nahyan, the royal family of Abu Dhabi who are considered the richest family in the world, owns the Azzam, the biggest yacht in the world at 591 feet.\nAs these tech titans continue to push the boundaries of wealth and extravagance, their superyachts serve as symbols of their success and status in the world of billionaires.\nRead Next:\nAmid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity.\nThis startup in the climate tech industry could unlock the riches flowing 30 feet above your head.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Zuckerberg Trying To Catch Up To Bezos's Yacht Game: Meta Platforms CEO Spends $330 Million On Yachts originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    }
]