[
    {
        "Date": "2024-10-19T01:00:55.000Z",
        "Title": "Berkshire Hathaway Lifts Stake in Sirius XM After Malone Deal",
        "Author": "  Alexandre Rajbhandari ",
        "Text": "(Bloomberg) -- Warren Buffett is amplifying his bet on Sirius XM Holdings Inc., as Berkshire Hathaway Inc. keeps adding more shares of the radio broadcasting firm to its portfolio.\nMost Read from Bloomberg\nA Broken Oil Pipeline Plunges South Sudan’s Capital Into Chaos\nDrug Decriminalization Spawns a Political Debacle for Progressives\nCities Look to AI to Flag Residents’ Trash and Recycling Mistakes\nInside the ‘Utopias’ of Mexico City\nOne City’s Plan to Re-Link a Neighborhood That Robert Moses Divided\nThe conglomerate has acquired $42 million worth of shares in the three days through Friday, regulatory filings show.\nBerkshire Hathaway now has a stake of about 32.5% in Sirius XM’s publicly traded stock, having become the top holder last month. That change came as billionaire John Malone’s Liberty Media split off its 83% stake and combined it with its separate tracking shares in the broadcaster.\nBershire added more of the stock to its holdings last week. The move provided some support for Sirius XM’s shares, which are down 50% this year amid expectations of lower sales.\nMost Read from Bloomberg Businessweek\nAI Detectors Falsely Accuse Students of Cheating—With Big Consequences\nBYD Is Winning the Global Race to Make Cheaper EVs\nNeuralink Co-Founder’s New Startup Sells a Brain Computer Toolkit\nA Fentanyl Vaccine Is a Long Shot That Just Might Work\nHow Starbucks Became a Sugary Teen Emporium\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-16T14:50:17.000Z",
        "Title": "What Makes Berkshire Hathaway (BRK-B) a Lucrative Investment?",
        "Author": "  Soumya Eswaran ",
        "Text": "Fiduciary Management Inc. (FMI), an independent money management firm, released its third-quarter 2024 investor letter. A copy of the letter can be downloaded here. In the third quarter, domestic and international equity markets rose. FMI has typically lagged in more speculative-driven bull markets (similar to today’s) and outperformed in more challenging environments driven by valuation framework, focus on business quality, and balance sheet strength. The FMI Large Cap strategy trades at a ~30% and ~50% discount to the 493 stocks in S& P 500 and Magnificent Seven, the FMI Small Cap strategy trades at a ~37% discount to the Russell 2000 and the FMI International strategy continues to trade at a discount to the MSCI EAFE Index. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nFiduciary Management Inc. highlighted stocks like Hathaway Inc. (NYSE:BRK-B), in the third quarter 2024 investor letter. Incorporated in 1998, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in insurance, freight rail transportation, and utility businesses. The one-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 1.33%, and its shares gained 35.73% of their value over the last 52 weeks. On October 4, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $462.68 per share with a market capitalization of $996.872 billion.\nFiduciary Management Inc. stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its Q3 2024 investor letter:\nBerkshire Hathaway Inc. (NYSE:BRK-B) is a diversified holding company that owns subsidiaries in insurance and reinsurance, freight rail transportation, utilities, energy, manufacturing, services, retail, and finance. Chairman, controlling shareholder, and famed investor Warren Buffett uses the permanent capital base of the large insurance assets – along with disciplined underwriting standards – to drive value-added investments that compound shareholder returns over time. From its inception in 1965 through 2023, Berkshire’s market value has increased at an annual growth rate of 19.8% vs. 10.2% for the S&P 500. Berkshire’s primary assets are its large insurance businesses, including GEICO, General Re, and National Indemnity, which we estimate at ~35% of the company’s value. The enduring competitive advantages of Berkshire’s insurance assets have allowed it to increase its float at a higher rate than its peers and provide low-cost funding for a strong collection of operating businesses, including BNSF Railroad, McLane Foodservice, Pilot Travel, Marmon Industries, Dairy Queen, and many others. On conservative estimates, we believe the company is trading at over a 20% discount on a sum[1]of-the-parts basis, and carries a mid-teens earnings multiple when factoring in a healthy net cash position and look-through EPS from its public equity portfolio. In an expensive market, we find the valuation to be significantly more appealing than the S&P 500. We expect a combination of strong operations and value-added acquisitions to increase the intrinsic value of the company at an above-average rate going forward.\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 14th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 120 hedge fund portfolios held Berkshire Hathaway Inc. (NYSE:BRK-B) at the end of the second quarter which was 119 in the previous quarter. While we acknowledge the potential of Berkshire Hathaway Inc. (NYSE:BRK-B) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Berkshire Hathaway Inc. (NYSE:BRK-B) and shared the list of stocks that hedge funds and mutual funds are in love with and those that they hate according to Goldman Sachs. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-11T11:10:00.000Z",
        "Title": "If You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today",
        "Author": "  Johnny Rice, The Motley Fool ",
        "Text": "Warren Buffett is undoubtedly one of the greatest investors of our time. Though the Oracle of Omaha can't actually see into the future, his knack for picking the right horse is almost unmatched. Guided by a disciplined philosophy, Buffett believes in backing businesses that have firm competitive advantages, or \"moats,\" and keeping his money parked for the long haul. As he said in his 2023 letter to Berkshire shareholders: \"When you find a truly wonderful business, stick with it. Patience pays.\"\nAs the head of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), he helped build the kind of company he loves to invest in. Berkshire is a wonderful company with solid business fundamentals, an established moat, and an incredible management team. Under his leadership, the company's stock has soared.\nBerkshire is in a solid position today. Aside from the investments it's famous for, like those in Apple or American Express, its insurance businesses are the backbone of Berkshire. The segment is doing well, with its first-quarter 2024 net underwriting earnings nearly tripling year over year and nearly doubling year over year in Q2 2024. GEICO, its biggest insurance brand, continues to have some of the lowest costs in the industry.\nA $10,000 investment in Berkshire 30 years ago would now be worth over $363,000, a 3,530% gain or 12.7% annualized. That's nearly four percentage points better than the average annual return of the S&P 500 over the same time period. Perhaps a difference 4% per annum doesn't sound like all that much, but the power of compound interest is hard to understate. Over 30 years, that 4% difference means your investment returned almost 200%, or three times, more.\nWhile investing in Berkshire earlier would have been ideal, it's still a great company today. Buffett is aging, yes, but the company continues to make strong investment choices and increase shareholder value. Berkshire will remain guided by its enduring philosophy and values, carrying on Buffett's legacy when he steps down.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $20,855!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $43,423!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $392,297!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of October 7, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIf You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-11T10:24:44.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway trims Bank of America stake below 10%",
        "Author": " David Hollerith    · Senior Reporter",
        "Text": "Warren Buffett's Berkshire Hathaway (BRK-A, BRK-B) has dropped its holdings in Bank of America (BAC) down below a 10% threshold, capping three months of selling that netted the conglomerate roughly $10 billion.\nBerkshire said Thursday it further trimmed its stake in Bank of America by another 9.5 million shares, making approximately $382 million in profits from those sales between Tuesday and Thursday.\nWith its latest sale, Berkshire’s Bank of America stake is down to 9.99%. Falling below the 10% threshold means the conglomerate is no longer obligated by federal securities laws to update its holdings of the nation's second-largest bank to the Securities and Exchange Commission within days.\nUnless Buffett or Berkshire choose to address their Bank of America position publicly, investors will have to wait for Berkshire’s quarterly 13F filing.\nBuffett and Berkshire haven’t yet said anything about the motivation for selling. And Berkshire remains the bank’s largest stockholder, with over 775 million shares worth roughly $31 billion.\nBerkshire began selling its BofA position three months ago. It unloaded a total of 257 million shares over the past 13 weeks, earning $9.98 billion on those sales.\nThe price of Bank of America’s stock has fallen more than 9% since Buffett began selling his firm's longest-held bank stock position.\nBofA is still up over 18% so far this year but trailing rivals Goldman Sachs (GS), JPMorgan Chase (JPM), and Citigroup (C).\nBank of America reports third quarter results Tuesday morning. Its profits are expected by analysts to fall both from a year ago and the previous quarter.\nBut its major lending revenue stream, net interest income, is expected to have hit its bottom in the second quarter and grow from there through the end of the year, according to recent comments from CFO Alastair Borthwick.\nThe recent moves by Berkshire are notable given Buffett’s long history with the bank. He injected $5 billion into Bank of America in 2011 as the lender struggled to overcome the wreckage of the subprime housing meltdown that caused the 2008-2009 financial crisis.\nAnd Berkshire's investment in the Charlotte, N.C.-based bank more than a decade ago wasn't only a bet on its recovery. It was also throwing heft behind the new leadership of CEO Brian Moynihan, who took over the top job in 2009.\n\"I don't know what exactly he's doing because, frankly, we can't ask, and we wouldn't,\" Moynihan said at a Barclays conference last month.\nBy June of this year, Bank of America accounted for 15% of Berkshire’s portfolio as the firm slashed its stake in Apple (AAPL).\nNow it is the company’s third-biggest position behind Apple and American Express (AXP).\n“We're buying the stock, a portion of the stock, and so life will go on. But he's been a great investor for our company and stabilized our company when we needed it at the time,” Moynihan added.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-10-17T13:00:00.000Z",
        "Title": "Berkshire Hathaway: Buy, Sell, or Hold?",
        "Author": "  Geoffrey Seiler, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.B) (NYSE: BRK.A) stock has long been popular with individual investors as it lets them ride along with one of the most successful investors of all time, Warren Buffett. This popularity has paid off in recent years, with the stock up over 25% this year and more than doubling over the past five years.\nHowever, with Buffett now in his 90s, investors may be wondering if the stock is a buy, sell, or hold. Let's take a look at each case.\nThe buy case for Berkshire centers on the idea that Buffett has created a company that will long be successful well after he is gone. Although it's a conglomerate with investments in a variety of sectors, the heart of Berkshire's operations is still its insurance operations. Berkshire owns several insurance companies, including GEICO and General Re.\nHowever, Buffett long ago put a unique spin on the insurance industry that has helped make Berkshire the company it is today. Insurance companies make most of their profits off their float, which is simply the money that insurance companies hold that hasn't been paid out in claims yet. If the premiums they collect are equal to claims they later pay out, insurance companies are essentially getting interest-free loans they can hold until they pay those claims.\nMost insurance companies take a conservative approach and invest their floats in fixed-income securities such as bonds. However, Buffett took a much different approach and used the float to run his large stock portfolio. This has created superior returns over the years.\nThis model will stay in place once Buffett is gone, and he has a team in place to continue to make sure there is a smooth transition. Vice Chairman Greg Abel will be responsible for all investment and capital allocation decisions, while Vice Chairman Ajit Jain will run Berkshire's insurance operations. The company will also still have Todd Combs and Ted Weschler around to help manage Berkshire's investment portfolio, which they have been doing for more than decade.\nBuffett has already transitioned a lot of power over, so the day-to-day operations should continue to run smoothly when he is gone.\nReplacing one of the greatest investors of all time won't be easy. In addition, Buffett had a lot of leeway with the Berkshire board to get deals done, and companies were often very receptive to become part of Berkshire. There have already been some indications that there will be more dealmaking scrutiny when Buffett is gone.\nAs such, when Buffett is no longer at the helm, I would expect the stock to react negatively.\nIn addition, Berkshire stock is expensive by the traditional price-to-book (P/B) metric that investors often use to value insurance companies. For his part, Buffett previously used the P/B metric as a measure to help determine if the company should be buying back stock. He initially would repurchase shares when Berkshire stock was trading below 1.1 times book value and later upped it to if it was trading below 1.2 times. In later years, though, he said neither the P/B nor price-to-earnings (P/E) ratio were great measures of the company's intrinsic value.\nThat said, the stock is trading well above historical levels from both a P/B and P/E perspective at a time when Buffett's reign as CEO could be soon coming to a close.\nThe hold case for Berkshire stems from the acknowledgement that the stock may be a little pricey, but that the company will continue to increase its intrinsic value over the years and that Buffett has created an enduring legacy that will help Berkshire thrive even when he is gone. While Buffett cannot be replaced, his successors will still do admirable jobs that continue to move the stock in the right direction.\nAt the same time, despite being 94 years old, Buffett is still in charge and he may have several good years left still as the head of Berkshire.\nGiven Berkshire's valuation along with Buffett's advanced age, I would view Berkshire stock as a hold. I think the company will be in strong hands after he leaves, but that it won't quite be the same when he is gone. I believe the stock will continue to be a solid long-term investment, but I would prefer to be a buyer on a dip.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $831,707!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 14, 2024\nGeoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-15T11:00:00.000Z",
        "Title": "2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Most investors know that Berkshire Hathaway (NYSE: BRK. A)(NYSE: BRK.B) has been one of the best-performing investments of all time. Its key to success has been to invest consistently, holding for years or even decades at a time.\nBut Berkshire's run is far from over. And right now, there are two exciting reasons nearly every investor should consider jumping into this legendary stock.\nWarren Buffett acquired Berkshire Hathaway back in 1965. Over the first few decades of operation, the company soared in value. In the 1980s, for example, Berkshire stock rose in value by at least 30% most years, with annual returns reaching as high as 90%.\nEven though Berkshire's biggest days of growth are behind it, the shares have still performed quite well over more recent decades. During the past 30 years, for instance, Berkshire's total return has greatly outperformed that of the S&P 500 index. Even over just the past three years, Berkshire stock has risen by roughly 60%, besting the S&P 500's return of just 38% over the same time period.\nBRK. B Total Return Level data by YCharts\nWhat has allowed Berkshire stock to beat the market again and again, even as its valuation has soared to nearly $1 trillion? The biggest key has been Buffett's investing prowess. Buffett and his investing team have repeatedly invested shareholder capital successfully, whether by buying shares of a publicly traded company, acquiring a private company, or simply buying back Berkshire's own stock.\nBut there's another advantage that Berkshire has that few other investments offer: the advantage of permanent capital. That is, Berkshire has a pool of capital that it can invest regardless of market conditions. During the 2008 financial crisis, for example, it was able to spend billions of dollars on blue chip companies at discounts simple because so many other competing pools of capital had already dried up.\nThis permanent capital is generated by Berkshire's insurance businesses -- an industry that doesn't necessarily see demand plummet during recessions or bear markets. While underwriting profits may not be very high during certain market cycles, insurers provide a steady stream of investable cash because premiums are paid up front while claims are paid out after the fact. Many other investment vehicles have copied this business model in recent years, but it has remained a durable competitive advantage for Berkshire, especially when paired with Buffett's investment acumen.\nDiverting more cash that could be used for lifestyle expenses into your investment account is not always fun, but it's a wise long-term decision. Investing in Berkshire can eliminate some of the friction involved in upping your savings rate.\nFirst, every time you buy more Berkshire stock, you know you're betting on one of the most successful investment vehicles in history. Putting more money to work in the market is significantly more fun when you have the confidence that these investments will match or even outpace the overall market's returns.\nSecond, by buying shares of Berkshire, you become a partner in one of America's most iconic businesses. You quite literally become an investing partner with Buffett and the rest of this team. Whenever they make a move, so are you. Except in this case, they're doing all of the groundwork for you, while you sit back and enjoy life. If they see opportunities in a certain industry or region of the world, Buffett and company are empowered to invest your money where it has the best chance of growing. Whereas with other investments, your capital may be limited to a certain industry or geography.\nIn a nutshell, investing in Berkshire can be more fun than nearly any other investment vehicle. Who wouldn't want to be investment partners with Warren Buffett? And any trick you can use to up your savings rate is nearly as important as choosing the right investment. With Berkshire, you can accomplish both, making it an attractive choice for nearly every investor.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 14, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\n2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-17T11:25:00.000Z",
        "Title": "Why Warren Buffett Just Sold $10.5 Billion Worth of One of Berkshire Hathaway's Largest Holdings",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "Few investors' moves and comments draw as much attention as Warren Buffett's -- and there's good reason for that. He has a track record nearly 70 years long of producing market-trouncing returns for shareholders. Not only that, but he manages over $600 billion of investable assets for Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), which is a lot of weight to throw around.\nSo, whenever Buffett's regulatory filings reveal he has been selling shares of one of his holdings, it has the potential to sway investors' opinions about the stock.\nIndeed, Buffett has significantly trimmed the size of his equity portfolio over the last few quarters. Berkshire's stock positions totaled $348 billion as of the end of 2023's second quarter. That total was down to $280 billion at the end of June this year despite the S&P 500 (SNPINDEX: ^GSPC) having climbed by 22.7% in that time. In fact, Buffett sold more stock than he bought in each of the last seven quarters.\nIt looks like Berkshire will report an eighth straight quarter of net sales when it releases its quarterly numbers next month. That's because the Oracle of Omaha has sold $10.5 billion worth of one of his top holdings, Bank of America (NYSE: BAC) over the last three months. -- and $9.6 billion worth of those sales took place during the third quarter.\nHere are two possible reasons behind Buffett's decision to sell some of his Bank of America stock.\nBuffett was once a bigger investor in bank stocks. Considering Berkshire Hathaway is an insurance business at its core, the banking and finance industry would seem to be in his wheelhouse.\nIn 2020, Berkshire Hathaway held stakes in U.S. Bancorp, Wells Fargo, and JP Morgan Chase. He exited the JP Morgan position that year, closed out the Wells Fargo stake in 2022, and sold his last share of U.S. Bank at the start of 2023. There are still a good number of bank stocks in Buffett's portfolio, but Bank of America remains, by far, its largest position in that sector.\nBuffett explained his changing attitudes about the banking industry at last year's shareholder meeting, which took place shortly after the collapse of Silicon Valley Bank. He noted that because it's now easy to move money from one institution to another, that makes it a much more fragile environment for banks in which to operate.\nBuffett's comments suggest smaller banks may be much riskier investments today than they were in the past. But Bank of America is huge -- the second-largest in the U.S. by assets and market cap -- and it has a massive footprint of retail locations, so investors shouldn't fear that its depositors will withdraw their funds en masse.\nIt's extremely solid, and management has done an admirable job of turning it around since Buffett made his initial $5 billion investment in 2011.\nSo Buffett's recent sales may be best explained by two factors.\nFirst, Buffett has said his overall recent selling spree is partly motivated by the expectation that corporate tax rates will rise in the near future. The corporate tax cuts that then-President Trump signed into law in 2017 are set to expire at the end of 2025. At that point, corporate taxes on capital gains will reset back from 21% to 35%, unless Congress passes new cuts for businesses. All else being equal, Buffett would rather have Berkshire Hathaway pay taxes on the substantial gains it has made on Bank of America (and some of its other holdings) at the lower tax rate.\nSecond, Buffett appears to believe Bank of America has been trading recently near its intrinsic value. It wouldn't make sense to sell shares to save on taxes if Buffett didn't think the stock was trading within 14% of its intrinsic value. With the majority of those sales taking place at share prices of $39 to $41, Buffett probably doesn't think the stock is worth much more than that.\nBuffett's most recent sale on Oct. 10 pushed Berkshire's stake in Bank of America below 10%. That's under the threshold requiring the conglomerate to report every purchase or sale of Bank of America stock within three days. So we might not find out if Buffett has continued selling Bank of America since then until February.\nIt might make sense for Buffett to reduce his stake in Bank of America, but it could be an opportunity for investors interested in the banking industry.\nBank of America was hit hard by the Federal Reserve's decision to quickly ramp up interest rates in its effort to bring inflation back under control. The bank holds large volumes of bonds on its balance sheet with longer-than-average durations. So while its competitors were buying bonds with higher interest rates, Bank of America was stuck earning lower interest rates on its old bonds, which it needed to hold until they reached maturity. At the same time, it still had to pay higher interest rates to depositors to prevent them from moving their money elsewhere. The result was that Bank of America's net interest income declined.\nBut management said its net interest income hit the bottom of its trough in the second quarter, and that investors should expect the metric to grow in 2025. As the Fed continues the rate-cutting campaign it started last month, Bank of America should see some nice improvements. The stock has climbed to about $42 per share, and investors hope that Buffett is done selling at this point. While the current price is above the average price Berkshire sold shares at, it reflects only a slight premium to the bank's average tangible book value multiple over the last five years. As such, the stock looks fairly priced. In that light, it may make sense for Buffett to sell some shares for tax reasons, but may also make sense for retail investors who are interested in adding a solid bank stock to their portfolio to buy them.\nBefore you buy stock in Bank of America, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Bank of America wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $806,459!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 14, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Adam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bank of America and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWhy Warren Buffett Just Sold $10.5 Billion Worth of One of Berkshire Hathaway's Largest Holdings was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-16T14:50:17.000Z",
        "Title": "What Makes Berkshire Hathaway (BRK-B) a Lucrative Investment?",
        "Author": "  Soumya Eswaran ",
        "Text": "Fiduciary Management Inc. (FMI), an independent money management firm, released its third-quarter 2024 investor letter. A copy of the letter can be downloaded here. In the third quarter, domestic and international equity markets rose. FMI has typically lagged in more speculative-driven bull markets (similar to today’s) and outperformed in more challenging environments driven by valuation framework, focus on business quality, and balance sheet strength. The FMI Large Cap strategy trades at a ~30% and ~50% discount to the 493 stocks in S& P 500 and Magnificent Seven, the FMI Small Cap strategy trades at a ~37% discount to the Russell 2000 and the FMI International strategy continues to trade at a discount to the MSCI EAFE Index. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nFiduciary Management Inc. highlighted stocks like Hathaway Inc. (NYSE:BRK-B), in the third quarter 2024 investor letter. Incorporated in 1998, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in insurance, freight rail transportation, and utility businesses. The one-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 1.33%, and its shares gained 35.73% of their value over the last 52 weeks. On October 4, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $462.68 per share with a market capitalization of $996.872 billion.\nFiduciary Management Inc. stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its Q3 2024 investor letter:\nBerkshire Hathaway Inc. (NYSE:BRK-B) is a diversified holding company that owns subsidiaries in insurance and reinsurance, freight rail transportation, utilities, energy, manufacturing, services, retail, and finance. Chairman, controlling shareholder, and famed investor Warren Buffett uses the permanent capital base of the large insurance assets – along with disciplined underwriting standards – to drive value-added investments that compound shareholder returns over time. From its inception in 1965 through 2023, Berkshire’s market value has increased at an annual growth rate of 19.8% vs. 10.2% for the S&P 500. Berkshire’s primary assets are its large insurance businesses, including GEICO, General Re, and National Indemnity, which we estimate at ~35% of the company’s value. The enduring competitive advantages of Berkshire’s insurance assets have allowed it to increase its float at a higher rate than its peers and provide low-cost funding for a strong collection of operating businesses, including BNSF Railroad, McLane Foodservice, Pilot Travel, Marmon Industries, Dairy Queen, and many others. On conservative estimates, we believe the company is trading at over a 20% discount on a sum[1]of-the-parts basis, and carries a mid-teens earnings multiple when factoring in a healthy net cash position and look-through EPS from its public equity portfolio. In an expensive market, we find the valuation to be significantly more appealing than the S&P 500. We expect a combination of strong operations and value-added acquisitions to increase the intrinsic value of the company at an above-average rate going forward.\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 14th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 120 hedge fund portfolios held Berkshire Hathaway Inc. (NYSE:BRK-B) at the end of the second quarter which was 119 in the previous quarter. While we acknowledge the potential of Berkshire Hathaway Inc. (NYSE:BRK-B) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Berkshire Hathaway Inc. (NYSE:BRK-B) and shared the list of stocks that hedge funds and mutual funds are in love with and those that they hate according to Goldman Sachs. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-18T16:10:13.000Z",
        "Title": "Why Berkshire Hathaway B (BRK.B) Could Beat Earnings Estimates Again",
        "Author": "  Zacks Equity Research ",
        "Text": "If you are looking for a stock that has a solid history of beating earnings estimates and is in a good position to maintain the trend in its next quarterly report, you should consider Berkshire Hathaway B (BRK.B). This company, which is in the Zacks Insurance - Property and Casualty industry, shows potential for another earnings beat.\nThis company has seen a nice streak of beating earnings estimates, especially when looking at the previous two reports. The average surprise for the last two quarters was 31.79%.\nFor the last reported quarter, Berkshire Hathaway B came out with earnings of $5.38 per share versus the Zacks Consensus Estimate of $4.83 per share, representing a surprise of 11.39%. For the previous quarter, the company was expected to post earnings of $3.41 per share and it actually produced earnings of $5.19 per share, delivering a surprise of 52.20%.\nWith this earnings history in mind, recent estimates have been moving higher for Berkshire Hathaway B. In fact, the Zacks Earnings ESP (Expected Surprise Prediction) for the company is positive, which is a great sign of an earnings beat, especially when you combine this metric with its nice Zacks Rank.\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\nBerkshire Hathaway B has an Earnings ESP of +8.11% at the moment, suggesting that analysts have grown bullish on its near-term earnings potential. When you combine this positive Earnings ESP with the stock's Zacks Rank #3 (Hold), it shows that another beat is possibly around the corner.\nWith the Earnings ESP metric, it's important to note that a negative value reduces its predictive power; however, a negative Earnings ESP does not indicate an earnings miss.\nMany companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-18T14:47:48.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Makes A Bold Move Dumping Bank Stock Days Ahead Of Earnings – What Are They Signaling?",
        "Author": "  LaToya Scott ",
        "Text": "It's a given that Warren Buffett's Berkshire Hathaway is a titan in the investment world, with interests ranging from insurance giant Geico to confectionery maker See's Candies. The conglomerate also holds large equity stakes in blue-chip companies.\nWith over 45 stock positions totaling $314 billion or about 32% of Berkshire's $995 billion market cap, these stocks are critical to the company’s bottom line.\nDon't Miss:\nGroundbreaking trading app with a ‘Buy-Now-Pay-Later' feature for stocks tackles the $644 billion margin lending market – here’s how to get equity in it with just $100\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today.\nBerkshire’s stock market gains reached $22.8 billion in the first half the year. But Buffett has said these gains are not the key figure to watch. Instead, he prefers investors focus on Berkshire's price-to-book value, which, as of Oct. 7, stood at 1.62, higher than its five-year average of 1.39.\nBerkshire's top holdings include some of the world's largest and most recognized companies. Apple leads with a market cap of $3.6 trillion, followed by American Express at $197 billion and Bank of America (B of A) at $327 billion. Coca-Cola and Chevron round out the list with stakes worth $303 billion and $268 billion, respectively.\nTrending: The global games market is projected to generate $272B by the end of the year — for $0.55/share, this VC-backed startup with a 7M+ userbase gives investors easy access to this asset market.\nHowever, Buffett's recent activity with Bank of America has caught the attention of many. Since mid-July, Berkshire has sold over $10 billion in B of A stock, reducing its stake in the bank to 10.1%. Berkshire also recently shed $382 million worth of shares, signaling that Buffett may not be done selling.\nThe Securities and Exchange Commission requires investors with stakes above 10% to disclose their trades within two business days. This has led some experts to speculate that Buffett aims to reduce his holdings below that threshold, allowing him to manage his trades with less public scrutiny. According to Bloomberg, this strategy could help Berkshire avoid driving down the stock price through large sales in one go.\nTrending: This Adobe-backed AI marketing startup went from a $5 to $85 million valuation working with brands like L'Oréal, Hasbro, and Sweetgreen in just three years – here's how there's an opportunity to invest at $1,000 for only $0.50/share today.\nWhile the KBW Nasdaq Bank Index has remained stable, Buffett's moves have likely influenced other investors to sell. There's also the possibility that Buffett's team is simply taking profits, as Bank of America shares soared 75% from October last year to July.\nDespite these sales, some experts remain bullish on B of A's long-term prospects. Morningstar analyst Suryansh Sharma assigns the bank a \"wide moat,\" signifying long-lasting competitive advantages of at least 20 years.\nTrending: ‘Scrolling to UBI': Deloitte's #1 fastest-growing software company allows users to earn money on their phones – invest today with $1,000 for just $0.25/share\nSharma noted that while Bank of America may not outpace industry leader JP Morgan, it remains competitive thanks to its expansive retail network and top-tier investment banking capabilities. Merrill Lynch, the wealth management firm owned by B of A, has also become one of the top brokerage firms in the U.S., further strengthening the bank's standing.\nAccording to Sharma, Bank of America's stock, trading at $39.93 on Tuesday, is now fairly valued with a fair price estimate of $39.50. He also emphasized that the bank has evolved into one of the leading U.S. banking franchises since overcoming its post-2008 financial crisis challenges.\nRead Next:\nThis billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Warren Buffett's Berkshire Hathaway Makes A Bold Move Dumping Bank Stock Days Ahead Of Earnings – What Are They Signaling? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-10-13T10:50:00.000Z",
        "Title": "Berkshire Hathaway Stock: Buy, Sell, or Hold?",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is often considered a reliable stock for conservative long-term investors. The conglomerate is led by Warren Buffett, who famously said his favorite holding period for a stock is \"forever.\"\nIt owns a wide range of evergreen insurance, railroad, utility, and consumer-staples companies; and it holds millions of shares in dozens of blue chip stocks in its closely watched investment portfolio.\nOver the past five years, Berkshire Hathaway's stock has rallied more than 120% as the S&P 500 advanced 100%. Let's see why Buffett's company outperformed the market -- and if it's the right time to buy, sell, or hold the stock.\nWarren Buffett's investment fund took over the struggling textile maker Berkshire Hathaway in 1965. Buffett subsequently transformed Berkshire by liquidating its textile operations, rebuilding its core business by acquiring several insurance and energy companies, and expanding its reach into other industries. It now directly owns well-known brands like GEICO, the BNSF Railway, Dairy Queen, Fruit of the Loom, Duracell, Acme Brick, and See's Candies.\nBerkshire put a lot of the cash generated by those evergreen subsidiaries into its investment portfolio, which is now worth nearly $314 billion and holds massive stakes in companies like Apple, American Express, Bank of America, and Coca-Cola.\nBerkshire reports its profitability through its \"operating earnings\" -- an adjusted metric that excludes the capital gains and losses from its investment portfolio -- instead of its earnings per share (EPS) under generally accepted accounting principles (GAAP). It claims that this proprietary metric filters out the stock market's near-term volatility.\nFrom 2018 to 2023, its operating earnings had a steady compound annual growth rate (CAGR) of 7%, from $24.8 billion to $37.4 billion, even as the market was rattled by the pandemic, inflation, rising interest rates, and geopolitical conflicts. Last year, its operating earnings jumped 21% as the growth of its insurance underwriting and investment businesses easily offset the macro pressures for its other businesses.\nThe bulls still love Berkshire because it's built on a foundation of evergreen businesses, it's well diversified, and its investments are still directly overseen by Buffett. And while past performance shouldn't be considered a reliable indicator of future gains, the stock has consistently outperformed the S&P 500 over the past six decades.\nThe company has also been pruning its portfolio and raising a lot more cash as lower rates drove the S&P 500 toward its record highs. It reduced its stake in Apple, Bank of America, and other top holdings over the past year, and its total cash, cash equivalents, and short-term T-bill investments hit a record high of $271.5 billion in the second quarter of 2024. The growth of that war chest suggests that Berkshire is gearing up to make some big investments if the market pulls back.\nWith a market cap of $982 billion, Berkshire trades at just 3.6 times its cash and cash equivalents, as well as 3.1 times the total value of its investment portfolio. Those reasonable valuations could limit its downside even if the market slips.\nThe bears believe Berkshire will face choppier waters over the next few years after Warren Buffett steps down. The 94-year-old Buffett already plans to hand the reins over to Greg Abel, the chairman and CEO of Berkshire Energy, in the near future. Abel has big shoes to fill, and it's unclear if he can continue to expand Berskhire's core businesses while executing smart trades for its investment portfolio. If Abel \"di-worsifies\" Berkshire's business, its growth could stall out.\nBerkshire's core insurance businesses could also be adversely affected by declining interest rates, which tend to reduce the profitability of their fixed-income investments. That might be why Ajit Jain, who has been Berkshire's insurance chief for nearly four decades, sold more than half of his shares earlier this year.\nThe stock also isn't cheap relative to its trailing operating earnings. At its current market cap, it trades at 26 times last year's operating earnings. But five years ago, it was trading at about 21 times its trailing operating earnings for 2018.\nThose concerns are valid, but I think investors should still buy and hold Berkshire's stock for three simple reasons: It's well diversified, it has plenty of cash for fresh investments and acquisitions, and Greg Abel will likely follow Buffett's playbook to a T instead of making radical changes.\nIts stock could certainly pull back over the next few quarters, but investors who sell it today will probably miss out on some much bigger gains over the next few years.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $21,266!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $43,047!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $389,794!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of October 7, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Leo Sun has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Stock: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-13T11:39:00.000Z",
        "Title": "2 No-Brainer Berkshire Hathaway Stocks to Buy Right Now for Less Than $500",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "If you're looking for profitable stock ideas, look no further than Warren Buffett's portfolio. Buffett has proven to be one of the best investors in history, and stealing his ideas is a great way to position your own portfolio for success. Right now, his holding company, Berkshire Hathaway, is betting on two stocks that every investor should strongly consider. The long-term upside potential for both companies is truly impressive.\nFew companies have grown as quickly in recent years as Nu Holdings (NYSE: NU). Sales growth rates have regularly surpassed 100% year over year, while earnings have just turned positive, and are on a strong upward trajectory. Shares trade at just 32 times forward earnings even though earnings growth next year is expected to be around 46%. What kind of business trades at this cheap of a valuation despite such strong fundamentals?\nPart of Nu's problem is a lack of general market awareness given the company operates solely in Latin America. But there's also an issue of underestimating fintech businesses like this. Much of the market likely still considers Nu a bank stock, but it's really a fintech company, capable of growing far faster and generating higher profits than traditional banks. Last quarter, for example, Wells Fargo posts sales growth of around 1% with a return on equity just above 10%. Nu, meanwhile, grew revenue by 55% with returns on equity of 24%.\nTo be sure, Nu does have many fans already, including several notable investors likeWarren Buffett. The bank also already boasts a $60 billion market cap with more than 100 million customers. But roughly 100% of this customer base is in just three countries: Brazil, Mexico, and Colombia. In a nutshell, Nu is a fintech company focused on bringing low-cost financial services to a handful of countries that most American investors don't monitor. And yet Nu has taken these markets by storm. In 2013, for example, almost no one in Brazil was using Nu for their credit card, savings account, or insurance policy. Today, more than half of all Brazilian adults use Nu.\nClearly, Nu is a hit in its local markets, even if most investors abroad have yet to encounter the company or its stock. And shares do garner a premium versus most traditional bank stocks. But trading at just 32 times forward earnings despite earnings per share (EPS) tripling over the last 12 months is simply too attractive to ignore. Buffett hasn't sold any shares since the company's IPO in 2021, and it's not too late to join him in this little-known growth gem.\nIf you're worried about market volatility, few companies offer as much downside protection as Chubb (NYSE: CB). Late last year, Buffett and Berkshire began loading up on Chubb stock. But they didn't want the market to be aware of this buying activity. So they requested a disclosure exemption from the SEC, which they received. The exemption was reasonable, considering Berkshire is already a major player in the insurance industry. But few suspected Chubb as the company Berkshire was plowing billions into. Chubb is now Berkshire's ninth-largest position in its publicly traded portfolio -- a stake worth nearly $7 billion.\nIf markets turn sour, this is the type of stock that I'd want to own. That's true even as Chubb's stock price hits record highs. Analysts anticipate that property and casualty insurers, such as Chubb, will experience fantastic years in the future. Research from the Swiss Re Group, for instance, predicts P&C insurance pricing and profitability to strengthen due to weakening competition, higher interest rates, and easing inflation. \"Property and casualty insurers are expected to improve profitability in 2024, with industrywide return on equity (ROE) across eight major markets at 10% so far this year, up from 6% in 2023,\" the firm predicts. \"ROE of above 10% is forecast into 2025.\"\nIf current trends continue, Chubb is set for a record-breaking string of years from a financial perspective. And the company is uniquely positioned to weather any potential market downturns. That's because P&C insurance is generally a recession-resistant business, and Chubb has proven willing to snap up the competition when capital is scarce. Just take a look at the Great Recession. Throughout the 2008 crash, Chubb shares beat the S&P 500 even as the rest of the financial industry was collapsing. Chubb stock then went on to beat the S&P 500 over the following decade.\nChubb certainly doesn't have as much upside potential as Nu, but it's a fit for more portfolios looking to balance risk and reward.\nBefore you buy stock in Nu Holdings, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nu Holdings wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nWells Fargo is an advertising partner of The Ascent, a Motley Fool company. Ryan Vanzo has no position in any of the stocks mentioned. The Motley Fool recommends Nu Holdings. The Motley Fool has a disclosure policy.\n2 No-Brainer Berkshire Hathaway Stocks to Buy Right Now for Less Than $500 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-01T18:48:21.000Z",
        "Title": "Berkshire Hathaway buys full control of its energy unit",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) -Berkshire Hathaway will take full ownership of Berkshire Hathaway Energy, after Warren Buffett's conglomerate agreed to acquire the 8% it did not already own from the family of late billionaire philanthropist Walter Scott.\nAccording to a Tuesday regulatory filing, Berkshire Hathaway Energy will pay $2.37 billion in cash for about 4.42 million of its shares.\nThe Scott family will also swap 1.6 million of the energy unit's shares for an unspecified number of Berkshire Class B shares. Berkshire Hathaway Energy is also exchanging some debt.\nFollowing the transaction, Omaha, Nebraska-based Berkshire will own 100% of the energy unit, up from 92% now.\nThe transaction is expected to be completed after regulatory approvals in the current quarter. Its total value is unclear because the energy unit's shares are not publicly traded.\nBerkshire Hathaway Energy declined additional comment, while Berkshire did not immediately respond to a request for comment.\nScott, an Omaha native, was a longtime Berkshire director and Buffett friend who died in Sept. 2021 at age 90.\nAnalysts had expected Berkshire to buy out Scott's family, though Edward Jones' analyst James Shanahan said it took longer than expected.\nIn June 2022, Berkshire Vice Chairman Greg Abel, who led Berkshire Hathaway Energy for a decade, sold his 1% stake to Berkshire for $870 million. That suggested that the Scott family's stake was worth nearly $7 billion at the time.\nBut the energy unit's PacifiCorp utility has since faced many lawsuits from homeowners and business owners who blame it for causing wildfires in Oregon and northern California in 2020.\nThe purchase also lets Berkshire spend some of its cash, which totaled $276.9 billion as of June 30.\n\"It makes sense,\" said Cathy Seifert, an analyst at CFRA Research. \"Berkshire has a significant pile of cash to deploy, at a time U.S. Treasury yields are falling and likely to continue to fall.\"\nShe said the energy unit nonetheless \"has had its fair amount of challenges since Abel sold his stake, not the least of which is the wildfire litigation.\"\nBerkshire Hathaway Energy owns energy, utility and pipeline businesses, and one of the largest U.S. residential real estate brokerages.\nBuffett's conglomerate originally bought a 76% stake in 2000, when the unit was known as MidAmerican Energy. The unit adopted the Berkshire Hathaway Energy name in 2014.\nBerkshire also owns dozens of other businesses, including the BNSF railroad and Geico car insurance, and common stocks including Apple.\nAbel, 62, is expected to eventually succeed Buffett, 94, as Berkshire's chief executive.\n(Reporting by Jonathan Stempel in New York; Editing by Nick Zieminski)\n"
    },
    {
        "Date": "2024-10-19T01:00:55.000Z",
        "Title": "Berkshire Hathaway Lifts Stake in Sirius XM After Malone Deal",
        "Author": "  Alexandre Rajbhandari ",
        "Text": "(Bloomberg) -- Warren Buffett is amplifying his bet on Sirius XM Holdings Inc., as Berkshire Hathaway Inc. keeps adding more shares of the radio broadcasting firm to its portfolio.\nMost Read from Bloomberg\nA Broken Oil Pipeline Plunges South Sudan’s Capital Into Chaos\nDrug Decriminalization Spawns a Political Debacle for Progressives\nCities Look to AI to Flag Residents’ Trash and Recycling Mistakes\nInside the ‘Utopias’ of Mexico City\nOne City’s Plan to Re-Link a Neighborhood That Robert Moses Divided\nThe conglomerate has acquired $42 million worth of shares in the three days through Friday, regulatory filings show.\nBerkshire Hathaway now has a stake of about 32.5% in Sirius XM’s publicly traded stock, having become the top holder last month. That change came as billionaire John Malone’s Liberty Media split off its 83% stake and combined it with its separate tracking shares in the broadcaster.\nBershire added more of the stock to its holdings last week. The move provided some support for Sirius XM’s shares, which are down 50% this year amid expectations of lower sales.\nMost Read from Bloomberg Businessweek\nAI Detectors Falsely Accuse Students of Cheating—With Big Consequences\nBYD Is Winning the Global Race to Make Cheaper EVs\nNeuralink Co-Founder’s New Startup Sells a Brain Computer Toolkit\nA Fentanyl Vaccine Is a Long Shot That Just Might Work\nHow Starbucks Became a Sugary Teen Emporium\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-11T10:24:44.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway trims Bank of America stake below 10%",
        "Author": " David Hollerith    · Senior Reporter",
        "Text": "Warren Buffett's Berkshire Hathaway (BRK-A, BRK-B) has dropped its holdings in Bank of America (BAC) down below a 10% threshold, capping three months of selling that netted the conglomerate roughly $10 billion.\nBerkshire said Thursday it further trimmed its stake in Bank of America by another 9.5 million shares, making approximately $382 million in profits from those sales between Tuesday and Thursday.\nWith its latest sale, Berkshire’s Bank of America stake is down to 9.99%. Falling below the 10% threshold means the conglomerate is no longer obligated by federal securities laws to update its holdings of the nation's second-largest bank to the Securities and Exchange Commission within days.\nUnless Buffett or Berkshire choose to address their Bank of America position publicly, investors will have to wait for Berkshire’s quarterly 13F filing.\nBuffett and Berkshire haven’t yet said anything about the motivation for selling. And Berkshire remains the bank’s largest stockholder, with over 775 million shares worth roughly $31 billion.\nBerkshire began selling its BofA position three months ago. It unloaded a total of 257 million shares over the past 13 weeks, earning $9.98 billion on those sales.\nThe price of Bank of America’s stock has fallen more than 9% since Buffett began selling his firm's longest-held bank stock position.\nBofA is still up over 18% so far this year but trailing rivals Goldman Sachs (GS), JPMorgan Chase (JPM), and Citigroup (C).\nBank of America reports third quarter results Tuesday morning. Its profits are expected by analysts to fall both from a year ago and the previous quarter.\nBut its major lending revenue stream, net interest income, is expected to have hit its bottom in the second quarter and grow from there through the end of the year, according to recent comments from CFO Alastair Borthwick.\nThe recent moves by Berkshire are notable given Buffett’s long history with the bank. He injected $5 billion into Bank of America in 2011 as the lender struggled to overcome the wreckage of the subprime housing meltdown that caused the 2008-2009 financial crisis.\nAnd Berkshire's investment in the Charlotte, N.C.-based bank more than a decade ago wasn't only a bet on its recovery. It was also throwing heft behind the new leadership of CEO Brian Moynihan, who took over the top job in 2009.\n\"I don't know what exactly he's doing because, frankly, we can't ask, and we wouldn't,\" Moynihan said at a Barclays conference last month.\nBy June of this year, Bank of America accounted for 15% of Berkshire’s portfolio as the firm slashed its stake in Apple (AAPL).\nNow it is the company’s third-biggest position behind Apple and American Express (AXP).\n“We're buying the stock, a portion of the stock, and so life will go on. But he's been a great investor for our company and stabilized our company when we needed it at the time,” Moynihan added.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-10-16T21:45:20.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Exceeds Market Returns: Some Facts to Consider",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) ended the recent trading session at $465.69, demonstrating a +0.65% swing from the preceding day's closing price. The stock outperformed the S&P 500, which registered a daily gain of 0.47%. On the other hand, the Dow registered a gain of 0.79%, and the technology-centric Nasdaq increased by 0.28%.\nThe company's shares have seen an increase of 1.31% over the last month, surpassing the Finance sector's loss of 3.28% and falling behind the S&P 500's gain of 3.48%.\nThe investment community will be closely monitoring the performance of Berkshire Hathaway B in its forthcoming earnings report. The company's earnings per share (EPS) are projected to be $4.57, reflecting a 7.86% decrease from the same quarter last year. Meanwhile, the latest consensus estimate predicts the revenue to be $96.62 billion, indicating a 3.66% increase compared to the same quarter of the previous year.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $19.72 per share and a revenue of $368.44 billion, representing changes of +14.78% and +1.09%, respectively, from the prior year.\nInvestors should also pay attention to any latest changes in analyst estimates for Berkshire Hathaway B. Recent revisions tend to reflect the latest near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has remained unchanged. Berkshire Hathaway B presently features a Zacks Rank of #2 (Buy).\nWith respect to valuation, Berkshire Hathaway B is currently being traded at a Forward P/E ratio of 23.47. This valuation marks a premium compared to its industry's average Forward P/E of 13.69.\nWe can additionally observe that BRK.B currently boasts a PEG ratio of 3.35. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. BRK.B's industry had an average PEG ratio of 1.78 as of yesterday's close.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This group has a Zacks Industry Rank of 63, putting it in the top 25% of all 250+ industries.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-11T11:10:00.000Z",
        "Title": "If You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today",
        "Author": "  Johnny Rice, The Motley Fool ",
        "Text": "Warren Buffett is undoubtedly one of the greatest investors of our time. Though the Oracle of Omaha can't actually see into the future, his knack for picking the right horse is almost unmatched. Guided by a disciplined philosophy, Buffett believes in backing businesses that have firm competitive advantages, or \"moats,\" and keeping his money parked for the long haul. As he said in his 2023 letter to Berkshire shareholders: \"When you find a truly wonderful business, stick with it. Patience pays.\"\nAs the head of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), he helped build the kind of company he loves to invest in. Berkshire is a wonderful company with solid business fundamentals, an established moat, and an incredible management team. Under his leadership, the company's stock has soared.\nBerkshire is in a solid position today. Aside from the investments it's famous for, like those in Apple or American Express, its insurance businesses are the backbone of Berkshire. The segment is doing well, with its first-quarter 2024 net underwriting earnings nearly tripling year over year and nearly doubling year over year in Q2 2024. GEICO, its biggest insurance brand, continues to have some of the lowest costs in the industry.\nA $10,000 investment in Berkshire 30 years ago would now be worth over $363,000, a 3,530% gain or 12.7% annualized. That's nearly four percentage points better than the average annual return of the S&P 500 over the same time period. Perhaps a difference 4% per annum doesn't sound like all that much, but the power of compound interest is hard to understate. Over 30 years, that 4% difference means your investment returned almost 200%, or three times, more.\nWhile investing in Berkshire earlier would have been ideal, it's still a great company today. Buffett is aging, yes, but the company continues to make strong investment choices and increase shareholder value. Berkshire will remain guided by its enduring philosophy and values, carrying on Buffett's legacy when he steps down.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $20,855!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $43,423!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $392,297!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of October 7, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Johnny Rice has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIf You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-12T15:05:00.000Z",
        "Title": "Berkshire Hathaway: Buy, Sell, or Hold?",
        "Author": "  Eric Volkman, The Motley Fool ",
        "Text": "Several months ago, I wrote an article discussing whether investors should plow some of their money into Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). Spoiler alert: I concluded that Warren Buffett's investment vehicle was more than worthy of a buy.\nMuch has happened to the company's vaunted equity portfolio since then, however, and it looks different now than it did such a short time ago. So I think it's time for a reassessment -- is the Berkshire of late 2024 still as much of a buy as it was before all those portfolio changes?\nThe major stock moves in the portfolio involve divestment in Berkshire's monster Apple and Bank of America positions. At one point, more than half of the Berkshire equity portfolio was stuffed with Apple stock; following a series of big share sales in recent months, that proportion fell to 29%.\nBerkshire amassed a huge stake in Bank of America following a 2011 deal in which Buffett agreed to inject it with $5 billion in return for a package of preferred shares and warrants. In mid-2017, Berkshire exercised the warrants, funding them from the sale of most of the preferred stock. By the end of that year alone, the resulting stake in Bank of America common shares was worth more than $20 billion -- quite an outsized return across that relatively thin stretch of time.\nYet even a finance industry aficionado such as Buffett didn't want to hang on to such a large position forever. Berkshire's Bank of America sell-offs this year have been aggressive; more than $10 billion worth of the lender's equity has flown from the company's hands since July, downsizing its share of the portfolio from 13% to 10%. Buffett is still doing very well with what remains -- that 10%-plus holding is worth a cool $31 billion these days.\nThose sales helped Berkshire fund its latest -- and to many observers, most unexpected -- major investment move. It loaded up on U.S. Treasuries, with the frequently adventurous Buffett and his gang plowing tens of billions of dollars into these ultra-safe investments. Berkshire's most recent quarterly earnings report revealed that its pile of short-term Treasuries amounted to a hard-to-imagine $234.6 billion. By the way, that's well more than the U.S. Federal Reserve's stash of $195 billion.\nWith that, the company's cash and equivalents tally (basically, greenbacks plus extremely liquid securities) ballooned to $277 billion according to that earnings report. That's quite the dramatic increase from the previous end-quarter figure of $189 billion.\nOther changes in Berkshire's portfolio are less Earth-shaking, and entirely in character for Buffett. The celebrated investor loves the concept of a moat, and he's got a pair in two new Berkshire positions: aerospace and medical device components supplier Heico, and Ulta Beauty, a cosmetics retailer that sets itself apart with its in-store salons.\nMeanwhile, existing Berkshire holdings that got a boost in share count last quarter included unique media company Sirius XM Holdings, energy giant Occidental Petroleum, and an enterprise operating in a sector near, dear, and very familiar to Buffett and his colleagues: insurance mainstay Chubb.\nFinally, we recently saw Berkshire fully exit its investments in troubled entertainment company Paramount Global and the far more popular stock of high-flying cloud data specialist Snowflake. Other sell-offs included chunks of its holdings in Capital One Financial and Occidental peer Chevron.\nTaking all these changes together, it seems Berkshire isn't as confident as it once was on the growth potential of stocks today. That would explain its recent thirst for Treasuries, one of the most conservative investments imaginable. Those new equity positions suggest a batten-down-the-hatches adherence to that economic moat philosophy, as do several of the add-ons of existing holdings (except for maybe Occidental, which could be more of a play on low valuations; Buffett is an ace bargain hunter).\nThe Apple and Bank of America sell-offs trim those positions to more reasonable levels, particularly with the former stock. It's a conservative move to reduce a stake to the point where it's far less dominant in the portfolio than it once was.\nIf anything, I think Berkshire's slimmed-down equity portfolio looks better than it did when I wrote the previous article. Apple is a fine company, but at its size, anchored as it is by a nearly 20-year-old product (the iPhone), it won't have an easy time posting meaningful growth numbers. Those other recent buys look both opportunistic and potentially quite rewarding, an admirable combination.\nSo given that Berkshire's current stock lineup is an improvement over the quarter-ago version, I'm still bullish on the company. It remains a definite buy to me.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Eric Volkman has positions in Apple. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Chevron, Snowflake, and Ulta Beauty. The Motley Fool recommends Heico and Occidental Petroleum. The Motley Fool has a disclosure policy.\nBerkshire Hathaway: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-06T13:00:00.000Z",
        "Title": "With Warren-Buffett Led Berkshire Hathaway Buying the Remaining Stake in Berkshire Hathaway Energy, Is It Time to Buy Utility Dividend Stocks?",
        "Author": "  Daniel Foelber, The Motley Fool ",
        "Text": "This has been another great year in the stock market, with the broader indexes roaring to new highs. But Warren Buffett's commentary from Berkshire Hathaway's (NYSE: BRK.A) (NYSE: BRK.B) annual shareholder meeting and changes to the company's public equity holdings indicate that Berkshire isn't a net buyer in today's market.\nBerkshire has cut its stake in its largest public equity holding, Apple, by nearly 50%, trimmed its position in Bank of America, and more. In total, Berkshire has sold over $100 billion in stock this year and has built up a cash and Treasury bill position of over $300 billion.\nHowever, Berkshire seems to remain confident in the utility and energy sectors, as evidenced by its sizable positions in Chevron and Occidental Petroleum, as well as a decision to buy the remaining 8% stake in Berkshire Hathaway Energy (or BHE, for short) -- giving Berkshire total control of the entity.\nHere's a primer on how Berkshire Hathaway Energy fits into the broader business, the benefits of investing in dividend-paying utility stocks, and a low-cost exchange-traded fund (ETF) that's worth considering now.\nBerkshire is known for its public equity holdings. But a ton of additional value is baked into its insurance businesses, ownership of BNSF railroad, BHE, and other business units. Berkshire loves boring businesses that make money and can steadily grow earnings and their dividends -- like Coca-Cola and American Express. BHE embodies this philosophy.\nBHE contains various electric and gas utilities, pipelines, and other infrastructure assets. Its domestic regulated energy interests include four regulated U.S. utility companies and five U.S. integrated natural gas pipelines with 21,000 miles of operated pipeline, among other assets.\nUnlike the exploration and production or refining side of oil and gas, whose profit margins are heavily dependent on oil and gas prices, the midstream oil and gas industry functions like a toll road -- charging fees to move energy products across the country from areas of production to areas of consumption or export.\nRegulated utilities work with government agencies to set prices that are fair to consumers. This can give utilities a return, allowing them to invest in more infrastructure and pay dividends to shareholders.\nInvestors can buy shares of Berkshire Hathaway to gain exposure to BHE. But a simpler and more direct approach may be to buy an ETF with broad-based exposure to the utility sector.\nThe Vanguard Utilities ETF (NYSEMKT: VPU) mirrors the performance of the utility sector. The fund is up an impressive 27.8% year to date -- besting the S&P 500, Nasdaq Composite, and Dow Jones Industrial Average.\nThe Vanguard Utilities ETF features an expense ratio of 0.1%, has a minimum investment of just $1, and yields 3%. Even after its run-up, it still sports a somewhat reasonable price-to-earnings (P/E) ratio of 25 -- which is lower than the S&P 500 but high for a traditionally low-growth sector.\nThe sector has been a beacon of safety for value investors seeking passive income in an otherwise expensive market. But after its surge, investors may wonder if it is the best sector to buy now.\nContext is critical in the stock market. The utility sector was down slightly from 2020 through the end of 2023 -- lagging the broader indexes by a wide margin during those four years. So its recent rebound may be partially due to the sector being oversold.\nFurthermore, higher demand for computing to power artificial intelligence models could be a boon for electric utilities and justify infrastructure investments.\nLower interest rates are adding even more fuel to the fire. The Federal Reserve just cut interest rates for the first time in four years. Lower interest rates reduce the cost of capital and increase the potential return on investment for capital-intensive projects, such as power generation, transmission, and distribution.\nMany utilities also carry a significant amount of debt on their balance sheets. Lower borrowing costs could help these companies refinance debt and reduce their interest expense.\nThe utility sector isn't the bargain-bin buy it was at the beginning of the year, but it remains a solid sector for passive income-oriented investors. The year-to-date gain looks massive and overextended at first glance, but a good amount of that is due to how beaten down the sector was going into the year.\nInvestors looking for safe, reasonably valued pockets of the market may want to consider the Vanguard Utilities ETF as a simple yet effective way to achieve diversification in the utility sector.\nBefore you buy stock in Vanguard World Fund - Vanguard Utilities ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Vanguard World Fund - Vanguard Utilities ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $765,523!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of September 30, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWith Warren-Buffett Led Berkshire Hathaway Buying the Remaining Stake in Berkshire Hathaway Energy, Is It Time to Buy Utility Dividend Stocks? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-14T11:00:00.000Z",
        "Title": "Here's Why Berkshire Hathaway Stock Is a Buy Before Nov. 1",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Wall Street tracks the moves of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) very closely. Every nuance is dissected to get a sense of what Chief Executive Officer Warren Buffett, who is usually pretty private about what he's doing and why, is thinking.\nBut there's definitely something big happening, and the third-quarter earnings update, which will likely take place in early November, will show investors just how big.\nIt is actually quite difficult to describe Berkshire Hathaway's business because the company has its fingers in so many different industries. To simplify, it is an enormous, sprawling conglomerate. But the real truth is that the company is the investment vehicle of Buffett.\nGiven the incredible price advance of Berkshire Hathaway under his command, it makes sense that investors would want to pay close attention to the investment decisions he makes. That's actually a more descriptive statement than it seems because, in some ways, Berkshire Hathaway is more like a mutual fund than an operating company. Buffett likes to buy well-run companies while they are cheap, and then let the management teams of those businesses build them over time. It's the same approach that a stock investor would take -- only Buffett usually buys entire companies.\nThat said, Buffett is also a disciplined investor. If there's nothing he likes, he'll just sit on cash. With the market near all-time highs today, there's clearly nothing that Buffett likes right now because the cash is piling up on the company's balance sheet.\nAt the end of the second quarter, Berkshire Hathaway had a huge cash hoard. Cash alone tallied as much as $36.8 billion at the company's insurance operation and $5.4 billion in its railroad, utilities, and energy division.\nThat's big enough, but it isn't the entire picture, because Buffett invests in Treasury bills to earn interest on its cash. The insurance division held $234.6 billion in Treasury bills at the end of the second quarter, bringing the total cash and short-term investment figure up to a gigantic $277 billion or so.\nAnd that number is only set to get bigger. Berkshire Hathaway has been taking profits in Apple (NASDAQ: AAPL) and Bank of America (NYSE: BAC) stock.\nBut don't look at this cash pileup as a negative. While it is true that Buffett clearly doesn't see anything he wants to buy right now, that is really a time-dependent issue. If there's a bear market, he's very likely to start putting that money to work.\nWhat's interesting here is that Berkshire Hathaway is a monster of a company, with a market cap of nearly $1 trillion. It will take a monster of an acquisition to move the needle for the company. And that's just what it looks like Berkshire Hathaway is gearing up to make.\nHere's the thing: There's really no right or wrong time to hire Warren Buffett to manage your money, which is basically what you are doing when you buy Berkshire Hathaway. Sure, there are better and worse times, but if you want to benefit from the services of the Oracle of Omaha, now is as good a time as any to buy.\nThat said, given the profits Buffett is taking to bulk up his cash store, now might be a better time than you think, and you'll find out just how much better when the company reports on its balance sheet again in early November.\nIt's true that you might have to suffer some paper losses when the market crashes if you buy Berkshire today, but that's when the cash hoard being built will get put to work. Unless you have the investment fortitude to invest when everyone else is selling, which is a highly difficult emotional task and something that Buffett has proven he can do, buying now while you watch Buffett prepare for something big very well might be the best investment decision for you to make.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $21,266!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $43,047!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $389,794!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of October 7, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nHere's Why Berkshire Hathaway Stock Is a Buy Before Nov. 1 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-13T10:00:00.000Z",
        "Title": "Should You Buy Class A Shares of Berkshire Hathaway Below $700,000?",
        "Author": "  Bram Berkowitz, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B), one of the largest companies in the world, has two classes of shares. The original Class A shares have been around since Berkshire went public and have enjoyed an incredible run, with each share now trading at a good deal more than a half-million dollars.\nBerkshire introduced the Class B shares in the 1990s to make the stock more affordable to smaller investors. However, with the advent of fractional shares, investors can now purchase as little as they want of the Class A stock, making it accessible for all. Should people invest in the Class A shares of Berkshire while they trade for less than $700,000? Let's take a look.\nStock prices don't mean a whole lot when investing in stocks. For instance, a company whose shares trade at a high price can also have a low market cap and valuation. So, just because Berkshire Class A shares trade at a high price, it doesn't necessarily mean they are overvalued. One way Berkshire is typically valued is on a price-to-tangible book value (P/TBV) basis, which looks at a company's market value compared to its net worth. This is a common way to value financials such as insurance companies and banks, which makes sense because Berkshire owns one of the largest insurance companies in the U.S. with Geico.\nAs you can see, Berkshire's P/TBV has been on the rise, but the stock has traded at a higher valuation before and trades below its average P/TBV since the turn of the century. Looking at the company's price-to-earnings (P/E) ratio, Berkshire is very attractively priced compared to its average, but not terribly far off from where it traded during most of the decade between 2010 and 2020.\nGiven its sheer size and looking at some of the businesses Berkshire owns, it's clear that Buffett has built a moat that won't be easy to replicate. Berkshire owns the third-largest auto insurance company in the U.S., one of the largest railroads in North America, large mortgage and manufacturing businesses, and a significant number of energy assets. The company is also sitting on a hoard of more than $271 billion in cash that it can use to buy stocks to add to its $300 billion-plus stock portfolio or repurchase its own stock.\nBerkshire has a phenomenal track record. Between 1965 and 2023, Berkshire's stock generated overall gains of more than 4,300,000%, compared to the S&P 500's 31,200% including dividends. That's a compound annual growth rate of 19.8%, as opposed to the S&P 500's 10.2%.\nBerkshire's longtime Vice Chairman Charlie Munger recently passed away at the age of 99. Buffett is 94, and his remaining years running Berkshire are limited. But Buffett and Munger instituted a strong succession plan, and Berkshire has many strong investing lieutenants who have learned from the best and are more than capable.\nGiven all these qualities, people can invest in Berkshire Class A shares while they trade for less than $700,000. It's one of those stocks you can buy and hold forever, without having to check it too often.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nBram Berkowitz has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nShould You Buy Class A Shares of Berkshire Hathaway Below $700,000? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-08T17:59:36.000Z",
        "Title": "Berkshire Hathaway nets $10 billion from BofA share-sale spree",
        "Author": "  Niket  Nishant and Manya Saini ",
        "Text": "By Niket Nishant and Manya Saini\n(Reuters) - Warren Buffett-led Berkshire Hathaway (BRK-A, BRK-B) further cut its stake in Bank of America, a late Monday filing showed, netting the investment giant more than $10 billion since it started the share sale in July.\nBuffett, who began investing in the second largest U.S. lender in 2011, had a 13.1% stake worth around $45 billion as of July. The latest round of sales have reduced the stake to 10.1%.\nThe selling spree by Buffett appears to be unnerving other BofA shareholders, at a time when the outlook for the banking industry remains murky amid fears over a possible U.S. recession.\nSince Berkshire's first sale in July, BofA's shares have lost nearly 7% of their value, while JPMorgan Chase - the biggest U.S. bank - has inched up 0.5%. The KBW Bank index has risen nearly 2% in the same period.\n\"When one of America's foremost investors is selling, that creates apprehension,\" said Macrae Sykes, portfolio manager at Gabelli Funds who has invested in BofA via funds.\nSince 2020, Buffett's large holding has made him a company insider under U.S. regulations, but he has never behaved as an active investor. If he were to reduce his stake further, it could worsen the pressure on the stock, analysts said.\n\"You need to have a very, very, very deep understanding of any company that Buffett is trading in, to say that you understand things better than him,\" said Odysseas Papadimitriou, CEO of personal finance firm WalletHub.\nBuffett has not disclosed his reasons for selling down his stake. Berkshire did not immediately respond to a request for comment, while BofA declined to comment.\nThe bank will report results next week, along with peer Citigroup, with investors keeping a close eye on the potential impact from higher deposit costs and tepid loan demand.\nBofA shares are unlikely to rebound in the near future, according to Suryansh Sharma, equity analyst for financial services for Morningstar Research, who said the stock was \"not cheap\" after having recovered nearly 50% from 2023 lows.\n\"Going forward, there are very few positive things that can happen, which can further rally the stock,\" he said.\nBuffett began investing in BofA in 2011, when many investors worried about the bank's capital needs after the financial crisis.\nBofA CEO Brian Moynihan praised Buffett last month, calling him a \"great investor (who) stabilized our company\". Since Buffett's investment, the bank's shares have jumped nearly six-fold.\nMoynihan said he did not know the rationale behind the share sale. In the recent years, Buffett has also retreated from Wells Fargo, a holding he had since 1989. His portfolio still includes a nearly $3.5 billion stake in Citi, which is in the middle of a revival under CEO Jane Fraser.\nSome investors see Buffett's move as a sign of his doubts over the U.S. economy against the backdrop of inflation and elevated interest rates.\nOthers interpreted his moves as a reflection of diminished confidence in the stock market, which he has said exhibits \"casino-like behavior\".\nBofA, however, is not the only stock that Buffett has dumped recently. Earlier this year, Berkshire halved its stake in technology behemoth Apple.\nAt the investment giant's annual meeting in May, Buffett said selling made sense as the federal tax rate on capital gains could grow depending on who wins the U.S. election.\n\"Buffett is a very tax-efficient entity. He's been around for a long time,\" said Art DeGaetano, founder and CIO of Bramshill Investments.\n(Reporting by Niket Nishant and Manya Saini in Bengaluru; Editing by Arun Koyyur)\n"
    },
    {
        "Date": "2024-10-01T15:56:42.000Z",
        "Title": "Warren Buffett buys rest of Berkshire Hathaway's utilities, but investors must guess at the price",
        "Author": "  JOSH FUNK ",
        "Text": "OMAHA, Neb. (AP) — Warren Buffett's Berkshire Hathaway is buying the rest of its utility unit from the estate of a longtime board member who died three years ago, but it's not clear exactly how much it will pay for that 8% stake in the massive utility business.\nBerkshire Hathaway Energy said in a regulatory filing Tuesday that it will pay Walter Scott's family $2.4 billion cash and issue a number of Class B Berkshire shares that are equivalent to 1.6 million shares of the utility business, but since the utility's shares aren't publicly traded it is hard to estimate the total value of the deal that's expected to close later this year. Altogether, Berkshire is buying more than 4.4 million shares in the utilities to give it 100% ownership.\n“That filing left me with a number of questions, but they don’t have an investor relations function so I don’t expect those questions to be answered,” CFRA Research analyst Cathy Seifert said. “The hope is that when they report earnings there will be more details.”\nDes Moines, Iowa-based Berkshire Hathaway Energy includes MidAmerican Energy, Pacificorp and NV Energy in Nevada and a Canadian electricity transmission provider called AltaLink, among other businesses.\nBuffett doesn't like to disclose any more than he has to, and the Berkshire Hathaway parent company didn't issue a press release or file anything with the Securities and Exchange Commission, leaving investors to speculate.\nApparently, Buffett doesn't believe this transaction is big enough to have a material impact on Berkshire Hathaway given that it just reported more than $30.3 billion in earnings and was sitting on $277 billion cash in the second quarter.\nBut a similar transaction when Berkshire bought out Vice Chairman Greg Abel's 1% stake in the utility business two years ago for $870 million suggests this deal with the Scott family is sizeable. Abel is slated to eventually replace Buffett as Berkshire Hathaway's CEO. If Berkshire agreed to pay the same price for the shares the Scott family is selling, the deal should be worth $6.96 billion.\nOf course in the past two years, one of Berkshire's biggest utilities, PacifiCorp, has paid out hundreds of millions in settlements related to wildfires in Oregon and California that damaged thousands of homes in 2020, and Berkshire Hathaway has recorded $2.7 billion in wildfire losses.\nBuffett was down on the utility industry's prospects in this year's letter to Berkshire Hathaway shareholders. But it's not clear what the current value of the utility divisions shares are today. Buffett didn't immediately respond to questions about the deal with the Scott family, and the utility unit declined to comment beyond what is in the regulatory filing.\nIn addition to utilities, Berkshire Hathaway owns BNSF railroad, a number of large insurance companies including Geico and a varied assortment of manufacturing and retail firms that includes aviation parts maker Precision Castparts and more well-known brands like Dairy Queen and See's Candy.\n"
    },
    {
        "Date": "2024-10-10T13:00:17.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK.B) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this company have returned +0.6%, compared to the Zacks S&P 500 composite's +5.9% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway B falls in, has lost 1%. The key question now is: What could be the stock's future direction?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Berkshire Hathaway B is expected to post earnings of $4.57 per share, indicating a change of -7.9% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nThe consensus earnings estimate of $19.72 for the current fiscal year indicates a year-over-year change of +14.8%. This estimate has remained unchanged over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $19.99 indicates a change of +1.4% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has remained unchanged.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Berkshire Hathaway B.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Berkshire Hathaway B, the consensus sales estimate for the current quarter of $96.62 billion indicates a year-over-year change of +3.7%. For the current and next fiscal years, $368.44 billion and $374.84 billion estimates indicate +1.1% and +1.7% changes, respectively.\nBerkshire Hathaway B reported revenues of $93.65 billion in the last reported quarter, representing a year-over-year change of +1.2%. EPS of $5.38 for the same period compares with $4.62 a year ago.\nCompared to the Zacks Consensus Estimate of $97.31 billion, the reported revenues represent a surprise of -3.75%. The EPS surprise was +11.39%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-11T01:27:09.000Z",
        "Title": "Berkshire Hathaway raises $1.9 billion in global yen bonds, set to boost Japan bets",
        "Author": "  Scott Murdoch and Junko Fujita ",
        "Text": "By Scott Murdoch and Junko Fujita\n(Reuters) - Warren Buffett's Berkshire Hathaway has raised 281.8 billion yen ($1.9 billion) in a yen-denominated bond offer, a move analysts say lays the ground for the U.S investment company to increase its exposure to Japanese assets.\nThe deal was the largest bond sale in the Japanese currency for the firm in five years, a term sheet reviewed by Reuters on Thursday showed.\nThe global yen bond issue signals Buffett's deepening association with Japan's capital markets after its equity stake buys in the nation's top five trading houses over the past four years.\nBerkshire Hathaway said in a U.S. Securities and Exchange Commission filing that the proceeds raised in the deal would be used for general corporate purposes. It did not disclose the size of the deal in the filing.\nThe firm first announced it would buy stakes in Japan's trading houses in 2020 with the intention of holding them long-term and increasing ownership to as much as 9.9%. Since then, it has raised its stake in Japan's top five trading firms to around 9% each, according to its annual report in February.\nIt sold 263.3 billion yen of bonds in April.\n\"Berkshire's yen bond sales this year is the biggest in a year since it started selling yen bonds and this indicates their expectations for upside of Japanese stocks,” said Takehiko Masuzawa, trading head of Phillip Securities Japan.\n\"The market is looking at what kind of stocks will be their next target. Investors see value stocks which pay higher dividends, such as banks and insurers, will be the most likely targets.\"\nBuffett's optimism on Japan has helped attract other foreign investors and send the benchmark Nikkei index to a record high this year. The index has risen 17.7% so far in 2024.\nIn the latest deal, Berkshire Hathaway issued bonds with tenors of 3, 5, 7, 10, 20, 28 and 30 years, according to the term sheet.\nThe 3-year tranche was the largest with 155.4 billion yen raised. The 5-year bond raised 58 billion yen.\nLonger-dated bonds were added during the transaction and a proposed 15-year tranche was dropped, messages sent from the deal's bookrunners showed.\nFinal prices for each of the tranches were set at the lower to middle end of the revised price guidance given to investors, term sheets showed.\n($1 = 149.1500 yen)\n(This story has been corrected to say that the offerings are global yen bonds, not Samurai bonds, in the headline and paragraph 3)\n(Reporting by Scott Murdoch in Sydney and Junko Fujita in Tokyo; Editing by Jamie Freed, Jacqueline Wong and Muralikumar Anantharaman)\n"
    },
    {
        "Date": "2024-10-04T13:40:10.000Z",
        "Title": "Is Berkshire Hathaway (BRK.B) Outperforming Other Finance Stocks This Year?",
        "Author": "  Zacks Equity Research ",
        "Text": "The Finance group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Has Berkshire Hathaway B (BRK.B) been one of those stocks this year? By taking a look at the stock's year-to-date performance in comparison to its Finance peers, we might be able to answer that question.\nBerkshire Hathaway B is one of 871 companies in the Finance group. The Finance group currently sits at #6 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.\nThe Zacks Rank is a proven model that highlights a variety of stocks with the right characteristics to outperform the market over the next one to three months. The system emphasizes earnings estimate revisions and favors companies with improving earnings outlooks. Berkshire Hathaway B is currently sporting a Zacks Rank of #2 (Buy).\nOver the past 90 days, the Zacks Consensus Estimate for BRK.B's full-year earnings has moved 5.4% higher. This is a sign of improving analyst sentiment and a positive earnings outlook trend.\nBased on the latest available data, BRK.B has gained about 27% so far this year. In comparison, Finance companies have returned an average of 16.5%. This means that Berkshire Hathaway B is outperforming the sector as a whole this year.\nAnother Finance stock, which has outperformed the sector so far this year, is Axis Capital (AXS). The stock has returned 43.6% year-to-date.\nThe consensus estimate for Axis Capital's current year EPS has increased 5.9% over the past three months. The stock currently has a Zacks Rank #2 (Buy).\nBreaking things down more, Berkshire Hathaway B is a member of the Insurance - Property and Casualty industry, which includes 40 individual companies and currently sits at #16 in the Zacks Industry Rank. Stocks in this group have gained about 26.6% so far this year, so BRK.B is performing better this group in terms of year-to-date returns. Axis Capital is also part of the same industry.\nBerkshire Hathaway B and Axis Capital could continue their solid performance, so investors interested in Finance stocks should continue to pay close attention to these stocks.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAxis Capital Holdings Limited (AXS) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-10T08:46:00.000Z",
        "Title": "Is Berkshire Hathaway's A Share Class a Buy?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) is one of the most famous companies on Wall Street today. Run by investment icon Warren Buffett, it is a very unique entity. There are some good reasons why investors might want to buy it, but that doesn't mean every investor can buy it. That's most prominent with regard to the A share class. Here's why most investors won't want to buy Berkshire Hathaway's A shares, even if they can afford to do it.\nBerkshire Hathaway is an insurance company. Berkshire Hathaway is a utility. Berkshire Hathaway is a midstream pipeline company. Berkshire Hathaway is a train company. Berkshire Hathaway is a chemical company. Berkshire Hathaway is a manufacturing company. Berkshire Hathaway is a retailer. Berkshire Hathaway is a housing company... The list could keep going, but you probably get the point. This company has its fingers in a lot of different pies.\nThe easy way to describe Berkshire Hathaway is to call it a conglomerate. But even that doesn't really do justice to the massive portfolio of businesses it owns. Then there's the investments in other public companies, which tallied up to $280 billion at the end of the second quarter of 2024. That's down from $350 billion at the end of 2023, because Warren Buffett has been selling stock in companies like Bank of America and Apple. The key point here, however, is that Buffett's Berkshire Hathaway is not your typical company in any way, shape, or form.\nIn fact, it was created based on Warren Buffett's unique way of investing. In many ways, that's why investors buy Berkshire Hathaway, to invest alongside a man who has been called \"the Oracle of Omaha\" because of his successful investment history.\nIf you look at Berkshire Hathaway in this way, there's really no wrong or right time to buy it. It is more like a mutual fund that's run by a star manager. Sure, there are better and worse times to buy, but is there really a wrong time to hire a manager with a long track record of beating the market? And you still probably won't buy the A shares.\nBerkshire Hathaway has never conducted a stock split on its A shares. But, as you can see in the graph above comparing Berkshire's A shares to the S&P 500 Index, it has grown massively over time. Berkshire Hathaway's A shares trade at around $678,000, give or take a few hundred bucks. The median net worth in the United States is around $193,000. Simple math will tell you that most people just can't afford to buy Berkshire Hathaway's A shares -- not even a single share!\nThat has nothing to do with the desirability of Berkshire Hathaway as an investment. It's just that the A shares are really an exclusive club that only the very rich and institutional investors can afford to join. Even if you could manage to buy a few shares of the A class, you'd need to think carefully about the diversification of your portfolio. Sure, Berkshire Hathaway is diversified, but do you really want to put all of your eggs into Buffett's hands and hope he doesn't make a mistake?\nThat's why Berkshire Hathaway ended up creating B shares. Each A share can be converted into 1,500 class B shares. Thus, they trade at a much lower price point. Berkshire's B shares currently trade at around $450. That's a figure that the median U.S. citizen could afford far more easily. To be fair, it's not a low stock price, given that there are companies that trade for pennies. But it is manageable if you want to invest alongside Warren Buffett.\nGiven the huge price tag involved in buying Berkshire Hathaway's A shares, most investors aren't going to be able to buy them. That makes the B shares the default choice. But even if you can afford the A shares (even if it's just a few shares), you probably won't want to buy them, because it will involve dedicating huge sums of money to just one company. Sure, it is a diversified company that could easily be seen as something similar to a mutual fund. But 10 shares would be worth nearly $7 million. That large a commitment to one company just isn't going to be a prudent move for most investors.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $814,364!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway's A Share Class a Buy? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-15T17:57:48.000Z",
        "Title": "Warren Buffett's Berkshire Increases Investment in Struggling SiriusXM",
        "Author": "  Nauman Khan ",
        "Text": "Warren Buffett (Trades, Portfolio)'s Berkshire Hathaway(BRK.A, Financial) has raised its stake in SiriusXM(SIRI, Financial) to 32% after a strategic transaction by John Malone's Liberty Media. According to the latest Securities and Exchange Commission filing, the Omaha-based conglomerate invested $87 million in the satellite radio company after buying roughly 3.6 million of its shares.\nThis followed Liberty Media's tracking stocks with SiriusXM in early September and a restructuring of Malone's media assets while also spinning out the Atlanta Braves a company in which Berkshire owns stakes.\nHowever, SiriusXM has been experiencing some problems, such as a decreased subscriber base and a reduced target audience among young people. This has dampened the spirit of analysts on Wall Street, which, at the moment, only five of fourteen are advising that investors purchase the stock. The latest criticism came from JPMorgan's Sebastiano Petti, who downgraded SiriusXM to underweight, saying that it is struggling to deliver growth and is not as popular among the young as one might think.\nFurthermore, the Liberty Media agreement led to the collapse of SiriusXM's share count by 12%, which can stop the firm's stock buyback programs until 2027, putting pressure on its stock prices. Nevertheless, Berkshire's rise in stake triggered the gain of 8% in SiriusXM shares up until now, and for the YTD, there has been a decline of over 50%.\nThis investment has not elicited a word from Buffett, which fuels speculation if he or his right-hand men, Ted Weschler or Todd Combs, made this strategic move for the company. This action also seems to support the recent trend of Buffett's investment policy, especially inavoiding risky media business.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-10-08T13:41:38.000Z",
        "Title": "Berkshire Hathaway exceeds $10bln in Bank of America sales, reducing stake further",
        "Author": "Investing.com ",
        "Text": "Investing.com -- As per a regulatory filing dated Monday, Warren Buffet's Berkshire Hathaway (NYSE:BRKa) Inc (NYSE:BRKb). has now surpassed $10 billion in total proceeds from reducing its stake in Bank of America (NYSE:BAC).\nWarren Buffett, began scaling back the substantial investment in mid-July, which has since put downward pressure on the stock’s price.\nIn this most recent round of sales, Berkshire gained $383 million over three trading days, offloading a smaller number of shares compared to previous sales.\nHistorically, Buffett's selling activity has tended to slow when the stock price approaches $39, as indicated in his company's filings.\nAt this price, Berkshire's remaining 10.1% stake is valued at approximately $31.4 billion.\nIn September, Berkshire Hathaway continued to decrease its stake in Bank of America by selling 18.7 million shares between September 3 and September 5. These transactions generated about $760 million.\nRelated Articles\nBerkshire Hathaway exceeds $10bln in Bank of America sales, reducing stake further\nFactbox-Arcadium deal could power Rio Tinto's entry into lithium supplier big league\nThese 2 stocks will trade in a volatile fashion during Tesla's robotaxi event\n"
    },
    {
        "Date": "2024-10-04T14:00:16.000Z",
        "Title": "Warren Buffett-Led Berkshire Hathaway Pares Bank Of America Stake By $338M, Marking 13th Round Of Sales Amid Speculation On Strategic Shifts",
        "Author": "  Kaustubh Bagalkote ",
        "Text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nLegendary investor Warren Buffett-led Berkshire Hathaway (NYSE:BRK) (NYSE:BRK) has further reduced its stake in Bank of America Corp (NYSE:BAC), selling shares worth $338 million, as per a recent U.S. Securities and Exchange Commission filing.\nWhat Happened: This marks the 13th round of sales since mid-July, with shares sold at an average price of $39.40, one of the lowest prices received since the selling began.\nDon't Miss:\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nFinding a fiduciary financial advisor doesn’t have to be hard. SmartAsset’s free tool matches you with up to 3 financial advisors that serve your area in 5 minutes. Each advisor has been vetted by SmartAsset and is held to a fiduciary standard to act in your best interests.\nDespite these sales, Berkshire Hathaway remains the largest shareholder, holding 10.2% of the bank’s stock, valued at over $31 billion.\nThe pace of Berkshire’s sales has slowed, with recent transactions averaging $338 million, compared to previous rounds of about $750 million. The reasons for the sales remain undisclosed.\nTrending: This billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nWhy It Matters: Bank of America CEO Brian Moynihan has praised Buffett as an investor but admitted uncertainty about the reasons behind the share reduction, stating, “I don't know what exactly he is doing because frankly we can't ask.”\nBuffett’s recent actions have raised eyebrows, given his reputation for a long-term, patient investment approach. His decision to sell a significant portion of one of his favorite stocks, Bank of America, has sparked speculation about potential strategic shifts or market concerns.\nPrice Action: Bank of America Corp’s stock closed at $39.23 on Wednesday, up 0.025% for the day. Year to date, the stock has surged 15.72%, according to data from Benzinga Pro.\nWondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.\nKeep Reading:\nYour biggest returns may not come from the stock market. Invest the way colleges, pension funds, and the 1% do. Get started investing in commercial real estate today.\nInterest rates are falling but you can still make high yields in real estate. Find out how.\nThis article Warren Buffett-Led Berkshire Hathaway Pares Bank Of America Stake By $338M, Marking 13th Round Of Sales Amid Speculation On Strategic Shifts originally appeared on Benzinga.com\n"
    },
    {
        "Date": "2024-10-10T21:07:00.000Z",
        "Title": "Top Analyst Reports for Berkshire Hathaway, Canadian Pacific & AIG",
        "Author": "  Mark Vickery ",
        "Text": "Thursday, October 10, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 12 major stocks, including Berkshire Hathaway Inc. (BRK.B), Canadian Pacific Kansas City Ltd. (CP) and American International Group, Inc. (AIG), as well as micro-cap stock Steel Partners Holdings L.P. (SPLP). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the year-to-date period (+27.8% vs. +26.7%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Canadian Pacific have outperformed the Zacks Transportation - Rail industry over the year-to-date period (+2.3% vs. -1.4%). Following the approval of the merger with Kansas City Southern, the company is known as Canadian Pacific Kansas City Ltd. The deal is anticipated to draw synergies (annually) of $1 billion within three years.The merged entity has started to offer a daily premium intermodal service between the U.S. Midwest and Mexico. We are impressed with Canadian Pacific Kansas City's efforts to reward its shareholders through dividends and share repurchases.On the flip side, high operating expenses continue to weigh on the company's bottom line. The positivity surrounding the stock is evident from the fact that the Zacks Consensus Estimate for current-year earnings has been revised upward over the past 60 days. In view of the positives surrounding the stock, investors would do well to bet on the same at current levels.(You can read the full research report on Canadian Pacific here >>>)American International’s shares have gained +13.3% over the year-to-date period against the Zacks Insurance - Multi line industry’s gain of +20.4%. The company’s cost-cutting efforts are driving operational efficiency, aiding the margins. It continues to make divestitures to streamline its operations, focus on the General Insurance unit and reduce portfolio volatility.American International’s robust cash generation abilities have enabled it to continue elevating shareholder value through share buybacks and dividend payouts. Its FCF increased 5.4% in the trailing 12-month period.However, deterioration in its North America Commercial Lines’ combined ratio is a headwind. Its net debt-to-capital is higher than the industry. Moreover, its ROE of 9.52% is lower than the industry’s average of 16.09%, reflecting inefficiency in utilizing shareholders’ funds. As such, the stock warrants a cautious stance.(You can read the full research report on American International here >>>)Shares of Steel Partners’ have gained +4.1% over the past six months against the Zacks Diversified Operations industry’s gain of +15.2%. This microcap company with market capitalization of $808.39 million reported strong financial results in second-quarter 2024, with revenues growing 6.4% year over year to $533.2 million and a 113.2% surge in net income to $124.9 million.Revenues for the six months ended Jun 30, 2024 also increased by 6.7% to $1 billion. This growth reflects the company's effective diversification across its industrial and financial services segments. SPLP's operational efficiency is highlighted by a 15.7% adjusted EBITDA margin, up from 14.7% in second-quarter 2023.The company's balance sheet is robust, with $256.4 million in cash and a $112-million debt reduction in the first half of 2024, enhancing financial stability. Investments in the Supply Chain segment, which saw 192% in revenues for the six months ended Jun 30, 2024, position SPLP for long-term growth, particularly as global supply chains evolve.(You can read the full research report on Steel Partners here >>>)Other noteworthy reports we are featuring today include Palo Alto Networks, Inc. (PANW), Halliburton Co. (HAL) and Wheaton Precious Metals Corp. (WPM).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nCanadian Pacific KC's (CP) Dividend Payouts Boost Prospects\nAIG Benefits From Divestitures and Cost Control Measures\nFeatured Reports\nProduct Strength, Marketing Effort Aid Palo Alto (PANW)Per the Zacks analyst, Palo Alto Networks is gaining from solid contributions of its growth-oriented products including Prisma and Cortex. Increasing marketing efforts are also positive.\nHalliburton (HAL) to Benefit from International GrowthThe Zacks analyst believes that Halliburton's strong growth at its international business, coupled with margin expansion, positions the company to capitalize on emerging opportunities worldwide.\nInvestment & Expanding Operation Aid American Water (AWK)Per the Zacks analyst American Water's planned long-term investment to strengthen infrastructure and expanding operation through acquisition and organic means are going to drive its performance.\nRegency Centers (REG) Gains From Solid Retail Assets DemandPer the Zacks analyst, focus on grocery-anchored shopping centers, leading tenant roster and expansion efforts augur well for Regency Centers. However, rising e-commerce adoption remains a concern.\nDocuSign (DOCU) Gains From eSignature Strength, InvestmentsThe Zacks analyst is optimistic about DocuSign's top line as it significantly benefits from continued customer demand for eSignature. Investments in technical expertise are also reaping benefits.\nNew Upgrades\nSolid Portfolio, Higher Output Aid Wheaton Precious (WPM) Per the Zacks Analyst, Wheaton Precious will gain from its solid portfolio of assets. Higher production from certain mines will boost margins.\nCyberArk (CYBR) Rides on Shift to Subscription ServicesPer the Zacks analyst, CyberArk's focus on selling more subscription-based services is helping the company generate stable revenues and higher margins.\nNew Downgrades\nMassive Debt & Stiff Competition Concerns for Lumen (LUMN)Per the Zacks analyst, though Lumen stands to gain from AI proliferation, the increasing competition in this space is concerning. Heavy debt load is an additional headwind.\nRising Cost Impede Bank of Hawaii's (BOH) Bottom-Line GrowthPer Zacks analyst, Bank of Hawaii's bottom line remains under pressure due to escalating expenses through investments in technology and innovation.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nHalliburton Company (HAL) : Free Stock Analysis Report\nAmerican International Group, Inc. (AIG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nCanadian Pacific Kansas City Limited (CP) : Free Stock Analysis Report\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\nWheaton Precious Metals Corp. (WPM) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-13T11:45:00.000Z",
        "Title": "Could Chubb Become the Next Berkshire Hathaway?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Late last year, Warren Buffett's holding company, Berkshire Hathaway, started buying up shares of a mysterious company. No one knew the company in question because Berkshire had requested an exemption from the SEC that allowed it to skirt disclosure rules. But in early 2024, the mystery stock was revealed as Chubb (NYSE: CB).\nHere's the strange part: Chubb runs a business model very similar to Berkshire's. It was strange that Buffett would opt to buy shares of a close competitor instead of simply repurchasing Berkshire stock directly. Might Buffett believe that Chubb could become the next Berkshire -- signaling a huge growth runway ahead?\nOver the decades, Buffett has turned Berkshire into a behemoth organization now valued at nearly $1 trillion. While his exact tactics have varied over the years, the overarching strategy has remained consistent. At the core of Berkshire's operations sits a litany of insurance businesses. These companies produce investable cash flow whenever they write policy premiums. And because this money doesn't need to be paid out until a claim is filed, Berkshire essentially can invest this cash in the meantime free of interest. Berkshire now has holdings in dozens of companies spanning nearly every industry.\nIn many ways, Chubb is a miniature Berkshire. At its core also sits a portfolio of insurance companies that provide everything from property and casualty insurance to personal accident and supplemental health insurance. The firm even operates in the reinsurance market -- essentially providing insurance policies to insurers themselves. And like Berkshire, Chubb invests its \"float\" -- the term for the excess cash that insurance operators generate -- in securities that earn it a return on top of any underwriting profit it may also accrue.\nBerkshire and Chubb not only have similar business models, but also similar long-term track records. Over the past decade, the total returns for each stock have been nearly identical. However, there are two major differences to be aware of here. One suggests Chubb could very well be the next Berkshire, although the other creates a level of caution.\nThe biggest difference between Chubb and Berkshire is obviously size. After all, this is what makes it possible for Chubb to become the next Berkshire. Right now, Berkshire's market cap is around $1 trillion, yet Chubb's is only around $115 billion. If Chubb became the next Berkshire, it would signal roughly 900% in potential long-term upside.\nThis size difference should get investors excited. But there's a problem when you look under the hood. Over the past decade, Chubb has slightly underperformed Berkshire despite its small size. In theory, it should be much easier for it to generate higher growth rates as a small company. Yet over the last decade, Berkshire has generated an average return on equity of 10.6%, while Chubb has only managed an average return on equity of 9.9%.\nThis brings us to the major difference between Berkshire and Chubb: Berkshire has the direct benefit of Warren Buffett investing its capital. It's no small advantage to have one of the best investors in history on your side, plus all of his handpicked lieutenants who help manage the portfolio. Buffett's investing success has propelled Berkshire into a gigantic conglomerate, while Chubb remains mostly a pure-play insurance operator with a relatively smaller portfolio of investments.\nWill Chubb become the next Berkshire? It certainly has all of the core pieces in place. Yet, at the end of the day, it wasn't just the business strategy that made Berkshire what it is today. It was also the benefit of Buffett's investing acumen. Buffett clearly likes what he sees, given that Berkshire now owns nearly $7 billion of Chubb shares. But there's a reason why Berkshire was able to beat Chubb's total stock return over the past decade: It operates more like a hedge fund, while Chubb is closer to a classic insurer.\nBefore you buy stock in Chubb, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chubb wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nCould Chubb Become the Next Berkshire Hathaway? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-04T16:00:11.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Upgraded to Buy: What Does It Mean for the Stock?",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) could be a solid choice for investors given its recent upgrade to a Zacks Rank #2 (Buy). An upward trend in earnings estimates -- one of the most powerful forces impacting stock prices -- has triggered this rating change.\nThe Zacks rating relies solely on a company's changing earnings picture. It tracks EPS estimates for the current and following years from the sell-side analysts covering the stock through a consensus measure -- the Zacks Consensus Estimate.\nThe power of a changing earnings picture in determining near-term stock price movements makes the Zacks rating system highly useful for individual investors, since it can be difficult to make decisions based on rating upgrades by Wall Street analysts. These are mostly driven by subjective factors that are hard to see and measure in real time.\nTherefore, the Zacks rating upgrade for Berkshire Hathaway B basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. That's partly because of the influence of institutional investors that use earnings and earnings estimates for calculating the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their bulk investment action then leads to price movement for the stock.\nFundamentally speaking, rising earnings estimates and the consequent rating upgrade for Berkshire Hathaway B imply an improvement in the company's underlying business. Investors should show their appreciation for this improving business trend by pushing the stock higher.\nEmpirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, so it could be truly rewarding if such revisions are tracked for making an investment decision. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>.\nThis company is expected to earn $19.72 per share for the fiscal year ending December 2024, which represents a year-over-year change of 14.8%.\nAnalysts have been steadily raising their estimates for Berkshire Hathaway B. Over the past three months, the Zacks Consensus Estimate for the company has increased 5.4%.\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\nYou can learn more about the Zacks Rank here >>>\nThe upgrade of Berkshire Hathaway B to a Zacks Rank #2 positions it in the top 20% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-17T22:37:15.000Z",
        "Title": "Buffett's Berkshire continues to reduce Bank of America stake",
        "Author": "Reuters ",
        "Text": "(Reuters) - Billionaire Warren Buffett's Berkshire Hathaway (BRK-B) has unloaded more Bank of America (BAC) stock as it continues to trim stake in the U.S. banking giant, according to a regulatory filing.\nBerkshire sold nearly 8.7 million shares for $370 million, as of Oct. 15, the filing showed.\nLast week, Berkshire sold 9.5 million shares worth $382.4 million that brought its stake in the company to below 10%, according to a separate regulatory filing.\nThe investment giant began trimming its stake in mid-July when it sold about 33.9 million shares for around $1.48 billion. Since then, it has netted more than $10 billion from these sales.\nBuffett, one of the world's most revered investors, first invested in Bank of America back 2011 when he purchased $5 billion worth of its preferred stock.\n(Reporting by Jaiveer Singh Shekhawat in Bengaluru; Editing by Tasim Zahid)\n"
    },
    {
        "Date": "2024-10-11T12:00:42.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Reportedly Raises $1.9B Through Largest Samurai Bond Sale In 5 Years",
        "Author": "  Kaustubh Bagalkote ",
        "Text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nBerkshire Hathaway (NYSE:BRK) (NYSE:BRK) has successfully secured 281.8 billion yen, approximately $1.9 billion, via a yen-denominated bond offering. This represents the company’s largest bond sale in Japan’s currency in five years.\nDon’t Miss:\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nYour biggest returns may not come from the stock market. Invest the way colleges, pension funds, and the 1% do. Get started investing in commercial real estate today.\nWhat Happened: This issuance of Samurai bonds highlights Warren Buffett‘s increasing interest in Japan’s financial markets. Over the past four years, Berkshire Hathaway has invested in Japan’s top five trading houses, and this bond sale is part of its strategy to expand its exposure to Japanese assets, as per a term sheet reviewed by Reuters on Thursday.\nAccording to a filing with the U.S. Securities and Exchange Commission, Berkshire Hathaway will use the funds for general corporate purposes. The company initially announced plans to invest in Japan’s trading houses in 2020, with a goal to hold these stakes long-term and potentially increase ownership to 9.9%.\nBerkshire did not immediately respond to Benzinga's request for comment.\nTrending: This billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nThis year, Berkshire Hathaway has engaged in significant yen bond sales, with the latest issue featuring bonds with maturities ranging from 3 to 30 years. The largest tranche, a 3-year bond, raised 155.4 billion yen, while the 5-year bond secured 58 billion yen.\nWhy It Matters: Buffett’s strategic move into Japan’s financial markets aligns with his long-term investment philosophy. In a recent letter to investors, Buffett emphasized the importance of companies that consistently increase dividends. This approach has contributed to Berkshire Hathaway’s impressive returns.\nDespite global market volatility, Berkshire Hathaway’s Japanese investments have shown resilience. In early August, the Nikkei 225 index experienced a significant drop but managed to recover most of its losses. This underscores the strength of Buffett’s investments in Japan’s trading giants.\nWondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.\nKeep Reading:\nInterest rates are falling but you can still make high yields in real estate. Find out how.\nGet ‘em while you can — investing in this asset class may be reaching a high-water mark but you can still make returns right now.\nThis article Warren Buffett's Berkshire Hathaway Reportedly Raises $1.9B Through Largest Samurai Bond Sale In 5 Years originally appeared on Benzinga.com\n"
    },
    {
        "Date": "2024-10-08T21:45:21.000Z",
        "Title": "Here's Why Berkshire Hathaway B (BRK.B) Gained But Lagged the Market Today",
        "Author": "  Zacks Equity Research ",
        "Text": "In the latest market close, Berkshire Hathaway B (BRK.B) reached $453.80, with a +0.07% movement compared to the previous day. The stock lagged the S&P 500's daily gain of 0.97%. Meanwhile, the Dow experienced a rise of 0.3%, and the technology-dominated Nasdaq saw an increase of 1.45%.\nThe company's stock has dropped by 1.33% in the past month, exceeding the Finance sector's loss of 4.16% and lagging the S&P 500's gain of 5.41%.\nThe upcoming earnings release of Berkshire Hathaway B will be of great interest to investors. It is anticipated that the company will report an EPS of $4.57, marking a 7.86% fall compared to the same quarter of the previous year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $96.62 billion, up 3.66% from the year-ago period.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $19.72 per share and a revenue of $368.44 billion, representing changes of +14.78% and +1.09%, respectively, from the prior year.\nIt is also important to note the recent changes to analyst estimates for Berkshire Hathaway B. These revisions typically reflect the latest short-term business trends, which can change frequently. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, there's been no change in the Zacks Consensus EPS estimate. As of now, Berkshire Hathaway B holds a Zacks Rank of #2 (Buy).\nDigging into valuation, Berkshire Hathaway B currently has a Forward P/E ratio of 23. This valuation marks a premium compared to its industry's average Forward P/E of 13.21.\nWe can also see that BRK.B currently has a PEG ratio of 3.29. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. By the end of yesterday's trading, the Insurance - Property and Casualty industry had an average PEG ratio of 1.58.\nThe Insurance - Property and Casualty industry is part of the Finance sector. Currently, this industry holds a Zacks Industry Rank of 26, positioning it in the top 11% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow BRK.B in the coming trading sessions, be sure to utilize Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-01T21:45:22.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Moves -0.62%: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) ended the recent trading session at $457.41, demonstrating a -0.62% swing from the preceding day's closing price. This change was narrower than the S&P 500's 0.93% loss on the day. On the other hand, the Dow registered a loss of 0.41%, and the technology-centric Nasdaq decreased by 1.53%.\nShares of the company witnessed a loss of 3.29% over the previous month, trailing the performance of the Finance sector with its gain of 0.52% and the S&P 500's gain of 2.17%.\nThe upcoming earnings release of Berkshire Hathaway B will be of great interest to investors. In that report, analysts expect Berkshire Hathaway B to post earnings of $4.57 per share. This would mark a year-over-year decline of 7.86%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $96.62 billion, up 3.66% from the year-ago period.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $19.72 per share and a revenue of $368.44 billion, signifying shifts of +14.78% and +1.09%, respectively, from the last year.\nInvestors should also take note of any recent adjustments to analyst estimates for Berkshire Hathaway B. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Berkshire Hathaway B is holding a Zacks Rank of #2 (Buy) right now.\nLooking at valuation, Berkshire Hathaway B is presently trading at a Forward P/E ratio of 23.34. This signifies a premium in comparison to the average Forward P/E of 13.67 for its industry.\nWe can additionally observe that BRK.B currently boasts a PEG ratio of 3.33. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. As the market closed yesterday, the Insurance - Property and Casualty industry was having an average PEG ratio of 1.54.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This group has a Zacks Industry Rank of 16, putting it in the top 7% of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-14T19:56:48.000Z",
        "Title": "SiriusXM Stock Surges After Warren Buffett's Berkshire Hathaway Boosts Its Stake",
        "Author": "  Andrew Kessel ",
        "Text": "SiriusXM shares rallied Monday after Warren Buffett’s Berkshire Hathaway raised its stake in the satellite radio company.\nBerkshire Hathaway now holds a stake of nearly one-third in SiriusXM.\nEven with Monday's gains, SiriusXM shares have struggled this year, losing about half their value so far in 2024.\nSiriusXM (SIRI) shares rallied Monday after Warren Buffett’s Berkshire Hathaway (BRK.A, BRK.B) raised its stake in the satellite radio company.\nBerkshire Hathaway bought 3.6 million shares for roughly $97 million across four purchases from Wednesday to Friday, according to a Securities and Exchange Commission filing. The purchases bring Berkshire's stake to nearly one-third of SiriusXM.\nSiriusXM shares rose nearly 9% in afternoon trading Monday, though even with Monday's gains, they've lost about half of their value so far in 2024.\nIn August, SiriusXM signed a multi-year agreement with Alex Cooper to bring her popular \"Call Her Daddy\" show to its platform starting in 2025. The deal is reportedly for three years and worth $125 million, double her current arrangement with Spotify (SPOT).\nThe move is part of a “comprehensive programming development strategy for exclusive content with SiriusXM, expected to begin rolling out in 2025,” the company said.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-10-17T09:00:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Makes Leadership Appointments in the DACH Region",
        "Author": "Business Wire ",
        "Text": " \nBOSTON & MUNICH & COLOGNE, Germany, October 17, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced a pair of leadership promotions, naming Lars Messutat to Head of General Property, DACH, and Juliane Klein-Walbeck to Head of Energy & Construction, DACH.\n\"BHSI’s strength in the DACH region rests not only on our strong balance sheet, underwriting acumen and CLAIMS IS OUR PRODUCT philosophy, but also on the excellence of our team,\" said Andreas Krause, Head of DACH, BHSI. \"Lars and Juliane exemplify this excellence. I look forward to working with them in their expanded roles to continue to grow our business and our customer and broker relationships.\"\nLars joined BHSI in 2018 and was previously Head of Property, Corporate Customers. He has more than two decades of industry experience focused on property and spanning both the underwriting and brokerage sides of the business. He continues to be based in Munich and can be reached at Lars.Messutat@bhspecialty.com\nJuliane, who was previously Head of Construction, joined BHSI in 2021. She comes to her expanded role with more than 20 years of industry experience. She continues to be based in Cologne and can be reached at Juliane.Klein-Walbeck@bhspecialty.com.\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL), is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hamburg, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20241014266610/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    },
    {
        "Date": "2024-10-11T08:57:00.000Z",
        "Title": "The Zacks Analyst Blog Berkshire Hathaway, Canadian Pacific Kansas City, American International and Steel Partners",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – October 11, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include Berkshire Hathaway Inc. (BRK.B), Canadian Pacific Kansas City Ltd. CP, American International Group, Inc. AIG and Steel Partners Holdings L.P. SPLP.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 12 major stocks, including Berkshire Hathaway Inc., Canadian Pacific Kansas City Ltd. and American International Group, Inc., as well as micro-cap stock Steel Partners Holdings L.P.The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the year-to-date period (+27.8% vs. +26.7%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Canadian Pacific have outperformed the Zacks Transportation - Rail industry over the year-to-date period (+2.3% vs. -1.4%). Following the approval of the merger with Kansas City Southern, the company is known as Canadian Pacific Kansas City Ltd. The deal is anticipated to draw synergies (annually) of $1 billion within three years.The merged entity has started to offer a daily premium intermodal service between the U.S. Midwest and Mexico. We are impressed with Canadian Pacific Kansas City's efforts to reward its shareholders through dividends and share repurchases.On the flip side, high operating expenses continue to weigh on the company's bottom line. The positivity surrounding the stock is evident from the fact that the Zacks Consensus Estimate for current-year earnings has been revised upward over the past 60 days. In view of the positives surrounding the stock, investors would do well to bet on the same at current levels.(You can read the full research report on Canadian Pacific here >>>)American International’s shares have gained +13.3% over the year-to-date period against the Zacks Insurance - Multi line industry’s gain of +20.4%. The company’s cost-cutting efforts are driving operational efficiency, aiding the margins. It continues to make divestitures to streamline its operations, focus on the General Insurance unit and reduce portfolio volatility.American International’s robust cash generation abilities have enabled it to continue elevating shareholder value through share buybacks and dividend payouts. Its FCF increased 5.4% in the trailing 12-month period.However, deterioration in its North America Commercial Lines’ combined ratio is a headwind. Its net debt-to-capital is higher than the industry. Moreover, its ROE of 9.52% is lower than the industry’s average of 16.09%, reflecting inefficiency in utilizing shareholders’ funds. As such, the stock warrants a cautious stance.(You can read the full research report on American International here >>>)Shares of Steel Partners’ have gained +4.1% over the past six months against the Zacks Diversified Operations industry’s gain of +15.2%. This microcap company with market capitalization of $808.39 million reported strong financial results in second-quarter 2024, with revenues growing 6.4% year over year to $533.2 million and a 113.2% surge in net income to $124.9 million.Revenues for the six months ended Jun 30, 2024 also increased by 6.7% to $1 billion. This growth reflects the company's effective diversification across its industrial and financial services segments. SPLP's operational efficiency is highlighted by a 15.7% adjusted EBITDA margin, up from 14.7% in second-quarter 2023.The company's balance sheet is robust, with $256.4 million in cash and a $112-million debt reduction in the first half of 2024, enhancing financial stability. Investments in the Supply Chain segment, which saw 192% in revenues for the six months ended Jun 30, 2024, position SPLP for long-term growth, particularly as global supply chains evolve.(You can read the full research report on Steel Partners here >>>)\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmerican International Group, Inc. (AIG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nCanadian Pacific Kansas City Limited (CP) : Free Stock Analysis Report\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-10-03T13:06:40.000Z",
        "Title": "Berkshire unloads more Bank of America shares",
        "Author": "Reuters ",
        "Text": "(Reuters) - Berkshire Hathaway unloaded more Bank of America stock this week, boosting sales since mid-July to nearly $10 billion as Warren Buffett simplifies part of his conglomerate's vast portfolio.\nIn a regulatory filing on Wednesday night, Berkshire said it sold 8.55 million Bank of America shares this week for about $337.9 million. It has sold about 238.7 million shares, or about 23% of its holdings, since mid-July.\nBerkshire still owns about 10.2% of the second-largest U.S. bank, or a slightly higher percentage if Bank of America has yet to disclose recent stock buybacks.\nIt must continue reporting sales until and including thesale that drives its stake below 10%. Thereafter, investors must likely wait for Berkshire'squarterly financial reports or quarterly stock holdingsdisclosures to learn if the Omaha, Nebraska-based company soldmore. The U.S. Securities and Exchange Commission requires shareholders that own more than 10% of a company to disclose stock purchases and sales within two business days.\nBerkshire's selling reduces to a more manageable size whathad been its second-largest stock holding, which originated in a$5 billion investment in 2011.\nThe company also more than halved its largest stock holding,Apple, in the year's first half.\nBuffett, 94, tied up another loose end this week when the company agreed to buy the 8% it did not already own of its energy and utility business Berkshire Hathaway Energy from the estate of billionaire philanthropist Walter Scott.\nBerkshire ended June with $276.9 billion of cash. It will spend $2.37 billion of cash in the Berkshire Hathaway Energy transaction.\nBuffett has run Berkshire since 1965. His conglomerate's dozens of businesses include the BNSF railroad, Geico car insurance, and smaller operations such as Dairy Queen and See's Candies.\n(Reporting by Jonathan Stempel in New York; Editing by Nick Zieminski)\n"
    },
    {
        "Date": "2024-10-03T10:37:53.000Z",
        "Title": "Bank of America Corporation (BAC): Resilient Amidst Berkshire Hathaway’s Sell-Off",
        "Author": "  Talha Qureshi ",
        "Text": "We recently published a list of 7 Best Low Cost Stocks To Buy Under $50. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best low cost stocks to buy under $50.\nA lot has happened in the stock market during the last couple of weeks. The Fed cut rates by 50 basis points to help the weakening labor market. A few days ago we saw the Chinese stimulus being announced which included a series of positive measures by the government to ease the economic pressure.\nWe recently covered the Chinese stimulus and its expected impact on the global economy in 7 Cheap Internet Stocks To Invest In Now. Here’s an excerpt from the article:\n“Recently, China’s stock market has seen a sharp rally, driven by some aggressive measures by the government to revive the economy. China is the world’s second-largest economy and one of the key players in the technology industry. This huge economy has faced a series of challenges for the past few years in the shape of a sharp property market downturn and a lack of consumer confidence.\nThe Fed rate cut and the Chinese stimulus are expected to affect the market positively. Adam Parker, Trivariate Research founder and CEO; Lauren Goodwin, New York Life Investments chief market strategist; and Kristina Hooper, Invesco chief global market strategist joined CNBC recently to talk about the best opportunities in the current bull market.\nAdam Parker expressed that the market is outpacing the Federal Reserve’s action. He highlighted a sense of optimism surrounding AI deployment over the next few years, but he also raised concerns about market valuations exceeding economic realities. Parker likes the healthcare sector as it is driven by AI and believes that this will put the industry in a leading market position. He also believes that the Chinese Stimulus is a positive sign for the energy and industrial sectors.\nOn the other hand, Lauren Goodwin talked about how the rate cuts are supposed to affect the market. She thinks growth is the key indicator while analyzing the market. When the Fed is cutting rates, profit, and earnings margins typically stay where they are until growth starts to slow down. Moreover, she also pointed out that it is difficult to see the real economic catalyst that gives growth an upstart, without inflation. She also thinks that the upcoming period is going to be volatile between growth kicking up and then slowing down. Goodwin mentioned that she is going to be the buyer of the rally until unemployment starts rising and growth becomes a problem.\nLastly, Kristina Hooper mentioned the recent Fed cut to be a crisis cut in a non-crisis environment. She emphasized the Fed is cutting into growth, however, we will see a brief slowdown. The Fed has not only cut the rate by 50 basis points but is expected to cut by another 50 during the year and significantly more next year. These rate cuts are similar to throwing jet fuel in the market but that does not mean the stock market will go crazy. Hooper thinks that the fuel will help industries that have not rallied much recently benefit from the accelerating economy. She mentioned cyclicals to be one of the industries which are expected to enjoy the growth rally and also pointed out that the recent China stimulus will only help the cause.\nOur Methodology\nWe compiled the 7 best low cost stocks under $50 using the Finviz stock screener. Using the screener we first aggregated the list of stocks that were trading below the Forward Price-to-Earning ratio of 23.98 (the market’s forward P/E as per the Wall Street Journal) and a share price of under $50. We also took into account the EPS growth rate. Then we ranked the list by the number of hedge funds to get the best stocks. Please note that the list is ranked in ascending order of the number of hedge fund holders in Q2 2024.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA professional banker providing consultation to a customer in the security of his office.\nShare Price: $39.40\nForward P/E Ratio: 12.12 \nEarnings Growth This Year: 5.80%  \nNumber of Hedge Fund Holders: 92\nBank of America Corporation (NYSE:BAC) is the second-largest bank in the United States in terms of assets. It operates as a financial holding company that provides a range of banking services including deposits, cash management, and saving accounts among others.\nThe recent news of Berkshire Hathaway selling around 5.8 million shares of the company came in as a shock for its investors. As the reason behind the share sell-off was unknown, many investors wondered if it was a sign of the business of Bank of America Corporation (NYSE:BAC) going down.\nWhat we know from the company’s earnings call and overall financial performance does not point towards a weak business it suggests that the bank is doing well financially. The second quarter of 2024 revealed that the bank added around 278,000 new checking accounts to its portfolio. Moreover, it also announced adding more than 6,000 new relationships in the wealth management segment.\nThe loan portfolio of the Bank of America Corporation (NYSE:BAC) also witnessed a 2% growth year-over-year to $1.91 billion. All these positive highlights overshadowed the flat revenue growth rate of 1% for the bank.\nWhat’s more interesting about the stock is its cheap valuation. BAC is trading at only 12 times its forward earnings while analysts are expecting a 6% increase in its earnings during the year. This makes the banking stock one of the best low cost stocks to buy under $50.\nDiamond Hill Large Cap Strategy stated the following regarding Bank of America Corporation (NYSE:BAC) in its Q2 2024 investor letter:\n“Other top contributors in Q2 included Bank of America Corporation (NYSE:BAC) and Extra Space Storage. Shares of financial services company Bank of America rose in the quarter as it looks increasingly likely net interest income will inflect and begin growing again in 2024’s back half and into 2025.”\nOverall, BAC ranks 1st on our list of 7 Best Low Cost Stocks To Buy Under $50. While we acknowledge the potential of BAC to grow, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for a promising AI stock that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-07T13:25:50.000Z",
        "Title": "Vltava Fund’s Analysis of Taxes on Unrealized Gains Using Berkshire Hathaway (BRK-B) as an Example",
        "Author": "  Soumya Eswaran ",
        "Text": "Vltava Fund, an investment management company, recently released its third-quarter 2024 investor letter. A copy of the letter can be downloaded here. The portfolio had a surprisingly favorable July and a negative September. The last quarter saw significant movements in stocks overall. The first part of August saw the most market volatility. The major stock markets are currently experiencing an environment of interest rate reduction for the first time in a long time. In addition, please check the fund’s top five holdings to know its best picks in 2024.\nVltava Fund highlighted stocks like Berkshire Hathaway Inc. (NYSE:BRK-B), in the third quarter 2024 investor letter. Incorporated in 1998, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in the insurance, freight rail transportation, and utility businesses. The one-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 0.561%, and its shares gained 33.39% of their value over the last 52 weeks. On October 4, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $461.97 per share with a market capitalization of $996.054 billion.\nVltava Fund stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its Q3 2024 investor letter:\n\"The US presidential election is just around the corner. During the election campaign, one of the presidential candidates raised the idea of taxing unrealised capital gains of wealthy people with assets exceeding USD 100 million. Today, taxes are normally paid on realised capital gains. This means that tax liability arises only upon the sale of assets. A tax on unrealised gains would mean that even without selling anything a person could still be liable to taxation. One would simply compare how much assets had grown in value during the year and tax that difference. The plan, as proposed, is for a tax rate of 25%. Let us look at a simple example of what the impact would have been on Warren Buffett’s wealth if he had paid such a tax on unrealised gains all his life. Buffett is a relatively easy case to quantify. He has held almost all of his wealth for most of his life in shares of Berkshire Hathaway Inc. (NYSE:BRK-B). Although he does not buy and sell them personally, the shares are publicly traded and so their price is always known.\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 14th position on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 120 hedge fund portfolios held Berkshire Hathaway Inc. (NYSE:BRK-B) at the end of the second quarter which was 119 in the previous quarter. While we acknowledge the potential of Berkshire Hathaway Inc. (NYSE:BRK-B) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed Berkshire Hathaway Inc. (NYSE:BRK-B) and shared the list of best geothermal stocks to invest in. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-10-11T17:47:02.000Z",
        "Title": "Buffett's Berkshire cuts stake in BofA to below 10%",
        "Author": "Reuters ",
        "Text": "(This Oct. 10 story has been corrected to say that Berkshire has netted more than $10 billion since mid-July, not until mid-July, in paragraph 5)\n(Reuters) - Billionaire Warren Buffett's Berkshire Hathaway unloaded more Bank of America stock this week that takes its stake in the U.S. banking giant below 10%.\nBerkshire sold 9.5 million shares worth $382.4 million for this week, according to a regulatory filing on Thursday.\nThe U.S. Securities and Exchange Commission requires shareholders that own more than 10% of a company to disclose stock purchases and sales within two business days.\nNow investors at Bank of America must likely wait for Berkshire's quarterly financial reports or quarterly stock holdings disclosures to learn if the Omaha, Nebraska-based company sold more.\nIt started trimming the stake in mid-July when it sold about 33.9 million shares for around $1.48 billion. Since then, the investment giant has netted more than $10 billion.\nBofA, however, is not the only stock that Buffett has dumped recently. Earlier this year, Berkshire halved its stake in technology behemoth Apple.\nAt Berkshire Hathaway's annual meeting in May, Buffett said selling made sense as the federal tax rate on capital gains could grow depending on who wins the U.S. presidential election.\nBuffett, one of the world's most revered investors, first invested in Bank of America back in 2011 when he purchased $5 billion worth of its preferred stock.\nThe bank will report results next week, along with peer Citigroup, with investors keeping a close eye on the potential impact from higher deposit costs and tepid loan demand.\n(Reporting by Jaiveer Singh Shekhawat in Bengaluru; Editing by Shailesh Kuber)\n"
    },
    {
        "Date": "2024-10-04T03:19:51.000Z",
        "Title": "Berkshire Sounds Out Market for Yen Bonds as Yields Slide",
        "Author": "  Ayai Tomisawa ",
        "Text": "(Bloomberg) -- Berkshire Hathaway Inc. has started sounding out investors for its second yen bond deal this year, at a time when expectations for more rate hikes soon in Japan have receded.\nMost Read from Bloomberg\nThe Corner Store Comeback\nNYC Schools Reverse Course on Cell-Phone Ban After Parents Balk\nRoofs of Mexico City’s Massive Food Market Will Power Public Buses\nMexico City Restricts Airbnb Rentals to Curb ‘Gentrification’\nA Housing Crisis Brews in Rwanda’s Capital City\nWarren Buffett’s company is considering selling seven tranches including 30-year debt, with early guidance for the spread of those bonds around 95 basis points over mid-swaps, according to people familiar with the matter. The issuer is planning to price the deal as early as Oct. 10, said the people, who asked not to be identified because the matter is private.\nThe billionaire investor’s fundraising plans are closely watched by equity-market investors because Buffett has used yen funds raised in the bond market to purchase stakes in Japanese companies. His buying of stocks in Japan’s biggest trading firms helped drive up the Nikkei 225 share gauge to a record high earlier this year.\nA yen bond deal by Berkshire would come as Japanese corporate bond yields slide along with those of government notes on the shifting Bank of Japan policy outlook. Expectations have changed after newly selected Prime Minister Shigeru Ishiba took the unusual step of delivering what appeared to be a policy suggestion to the central bank, by saying Japan’s economy wasn’t ready for more rate hikes yet.\nYields on Japanese corporate bonds have fallen to about 0.92% from as high as around 1.07% at the end of July, according to Bloomberg-compiled data. Benchmark 10-year JGB yields dropped 17.5 basis points to 0.87% in that period.\nThe initial guidance for Berkshire’s yen bond spreads is wider on all tranches expect the three-year, after the BOJ surprised many in the market with a second rate increase of the year in July. It’s sounding out demand for 10-year bonds at about an 80 basis-point spread, for example, compared with around 70 basis points for similar-maturity notes sold in April.\n(Adds likely pricing date in the second paragraph, and a chart.)\nMost Read from Bloomberg Businessweek\nAdam Neumann’s Latest Project Is a WeWork Competitor\nHow Bogg Bags, the Crocs of Totes, Won Over America’s Moms\nRotting Rice in India Fuels Discontent About Modi’s Food Policy\nElon Musk’s Role in Reanimating the Far-Right Term ‘Remigration’\nThe Great €3 Billion Shipping Container Heist\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-10T03:54:31.000Z",
        "Title": "Berkshire’s ¥282 Billion Bond Fuels Japan Investment Hopes",
        "Author": "  Ayai Tomisawa and Takahiko Hyuga ",
        "Text": "(Bloomberg) -- Warren Buffett’s Berkshire Hathaway Inc. sold a ¥281.8 billion ($1.89 billion) multi-tranche bond on Thursday in a deal that’s fueling speculation the legendary investor will increase his exposure to Japanese assets.\nMost Read from Bloomberg\nSan Francisco to Shut 9% of Public Schools Amid Budget Woes\nChicago’s $1 Billion Budget Hole Exacerbated by School Turmoil\nUrban Heat Stress Is Another Disparity in the World’s Most Unequal Nation\nShould Evictions Be Banned After Hurricanes and Climate Disasters?\nFrom Cleveland to Chicago, NFL Teams Dream of Domed Stadiums\nThe firm priced a seven-part bond deal with tenors spanning three to 30 years in Berkshire’s biggest yen-denominated deal since its debut sale in 2019. The sale means Berkshire is the largest foreign issuer of yen bonds this year, raising a record ¥545.1 billion. All maturities except the three-year tranche offered higher premiums relative to its corresponding yen-note offering in April.\nThe billionaire’s fundraising in Japan is being closely watched by equity-market investors because Buffett has used yen funds raised in the bond market to purchase holdings in Japanese companies. His stake increases in five major trading houses helped drive up the Nikkei 225 Stock Average to a record high earlier this year. Should Berkshire’s investment choices widen to other stocks such as banks, insurers and shippers, as some analysts speculate, it could lead to more gains for the broader Japanese market.\n“The fact that the company was able to raise this much in a single year is a testament to the confidence that investors have in Berkshire,” said Haruyasu Kato, a fund manager in Tokyo at Asset Management One Co. “It is also a deal that demonstrates the strength of demand from Japanese investors for debt carrying good yields.”\nThe market is now focusing on what shares Buffett may buy and whether there are any stocks that meet his standards, said Mitsushige Akino, president of Ichiyoshi Asset Management.\nThat said, for foreign investors “the momentum of the appeal of Japanese stocks has passed, and it’s not like you will be left behind if you don’t buy now”, he said. Akino added that there are also benefits to investing in avenues other than Japanese stocks using funds raised in yen, thanks to cheaper costs.\nThe deal was a key test of investor demand for yen-denominated bonds given a shift in Bank of Japan policy this year away from ultra-easy rates, with the wider premiums on Berkshire’s longer-tenor debt reflecting investors’ caution about the outlook for interest rates. The 10-year part offered a spread of 82 basis points over mid swaps compared with 71 basis points in April, while the 20-year note carried a premium of 91 basis points versus 78 basis points.\nThe BOJ is widely expected to hold its settings steady when it next sets policy on Oct. 31., and some economists pushed back their forecasts for a year-end hike after new Prime Minister Shigeru Ishiba said last week that conditions are currently inappropriate for such action.\n‘Catchy Deal’\nThe highlight of the offering was a three-year tranche with a coupon of 1.031%, said Asset Management One’s Kato, calling it a “catchy deal”.\nThe average coupon offered for three-year yen bonds sold this year is around 0.865%, according to data compiled by Bloomberg.\nBerkshire raised ¥155.4 billion - more than half the total amount - from that tenor. The spread of 49 basis points was tighter than a comparable bond in April, reflecting strong appetite.\nBuffett’s firm is a regular issuer of yen bonds, tapping the market twice annually in recent years. Here’s a look at how much Berkshire paid on some maturities:\n(Updates with comments in fourth, fifth paragraphs, adds table on spreads.)\nMost Read from Bloomberg Businessweek\nLina Khan Is Just Getting Started (She Hopes)\nMusk Reveals Why He’s Jumping Into Trump’s Arms\nChina Is Playing Catch-Up to Elon Musk in Space\nHow Jellycat Plushies Became a Gen Z Obsession\nRate Cuts Need Time to Work Their Way Through the Economy\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-10-11T07:48:32.000Z",
        "Title": "Berkshire sells more BofA shares, stake falls below 10% - report",
        "Author": "Investing.com ",
        "Text": "Investing.com -- Warren Buffett's Berkshire Hathaway (NYSE:BRKb) (NYSE:BRKa) reduced its stake in Bank of America (NYSE:BAC), selling 9.5 million shares valued at $382.4 million this week, as per a regulatory filing, Reuters reported on Thursday.\nThis move brings Berkshire's ownership in the U.S. banking giant to below 10%.\nUnder U.S. Securities and Exchange Commission rules, shareholders with more than a 10% stake in a company must report stock transactions within two business days, the report added.\nNow that Berkshire's stake has fallen below this threshold, investors will likely need to wait for the company's quarterly financial reports or stock holdings disclosures to learn about any further sales.\nBerkshire began reducing its Bank of America holdings in mid-July, when it sold around 33.9 million shares for approximately $1.48 billion.\nPrior to this, the investment had generated over $10 billion in profits for the company.\nBank of America isn't the only stock Berkshire has been cutting back on. Earlier in 2024, the conglomerate halved its holdings in Apple (NASDAQ:AAPL) as well.\nDuring Berkshire Hathaway's annual meeting in May, Buffett explained that selling stocks made sense, particularly as federal capital gains taxes could rise depending on the outcome of the next U.S. presidential election.\nBuffett originally invested in Bank of America in 2011, purchasing $5 billion worth of its preferred stock, the report added.\nRelated Articles\nBerkshire sells more BofA shares, stake falls below 10% - report\nSanofi in talks to sell 50% stake in consumer health business to CD&R\nSainsbury's biggest investor QIA cuts holding\n"
    },
    {
        "Date": "2024-10-07T09:00:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Names Thomas Pache as Head of PI/Cyber Insurance, DACH Region and Kim Schumacher as Senior Property Underwriter; Opens Office in Hamburg",
        "Author": "Business Wire ",
        "Text": "BOSTON & HAMBURG, Germany, October 07, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced it has named Thomas Pache to lead its newly launched PI and Cyber Insurance lines in the DACH region, and Kim Schumacher as Senior Property Underwriter. Additionally, the organization has opened an office in Hamburg to be closer to its broker partners and customers – both Thomas and Kim will be located in the new Hamburg office.\n\"I am excited to continue to expand the expertise and solutions BHSI brings to the DACH region as we expand both our product lines and our local presence,\" said Andreas Krause, Head of DACH. \"The strength of our brand, our balance sheet, and our people, along with our CLAIMS IS OUR PRODUCT philosophy, is an excellent match for the local marketplace.\"\nThomas comes to BHSI with more than three decades of industry experience. In his newly created role, he will focus on delivering comprehensive PI and cyber solutions to customers, with a focus on the information technology and software industry segments. He can be reached at thomas.pache@bhspecialty.com\nKim Schumacher, who will focus on growing BHSI’s Mittelstand property business in Germany, comes to BHSI with almost 20 years of industry experience. She was most recently Property underwriter at another major insurer and, earlier in her career, was an insurance broker. She can be reached at kim.schumacher@bhspecialty.com.\nBHSI offers Property, Casualty and Executive & Professional Lines solutions in Germany and throughout the DACH region.\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL), is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hamburg, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20241003806651/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    },
    {
        "Date": "2024-10-12T15:05:00.000Z",
        "Title": "Berkshire Hathaway: Buy, Sell, or Hold?",
        "Author": "  Eric Volkman, The Motley Fool ",
        "Text": "Several months ago, I wrote an article discussing whether investors should plow some of their money into Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). Spoiler alert: I concluded that Warren Buffett's investment vehicle was more than worthy of a buy.\nMuch has happened to the company's vaunted equity portfolio since then, however, and it looks different now than it did such a short time ago. So I think it's time for a reassessment -- is the Berkshire of late 2024 still as much of a buy as it was before all those portfolio changes?\nThe major stock moves in the portfolio involve divestment in Berkshire's monster Apple and Bank of America positions. At one point, more than half of the Berkshire equity portfolio was stuffed with Apple stock; following a series of big share sales in recent months, that proportion fell to 29%.\nBerkshire amassed a huge stake in Bank of America following a 2011 deal in which Buffett agreed to inject it with $5 billion in return for a package of preferred shares and warrants. In mid-2017, Berkshire exercised the warrants, funding them from the sale of most of the preferred stock. By the end of that year alone, the resulting stake in Bank of America common shares was worth more than $20 billion -- quite an outsized return across that relatively thin stretch of time.\nYet even a finance industry aficionado such as Buffett didn't want to hang on to such a large position forever. Berkshire's Bank of America sell-offs this year have been aggressive; more than $10 billion worth of the lender's equity has flown from the company's hands since July, downsizing its share of the portfolio from 13% to 10%. Buffett is still doing very well with what remains -- that 10%-plus holding is worth a cool $31 billion these days.\nThose sales helped Berkshire fund its latest -- and to many observers, most unexpected -- major investment move. It loaded up on U.S. Treasuries, with the frequently adventurous Buffett and his gang plowing tens of billions of dollars into these ultra-safe investments. Berkshire's most recent quarterly earnings report revealed that its pile of short-term Treasuries amounted to a hard-to-imagine $234.6 billion. By the way, that's well more than the U.S. Federal Reserve's stash of $195 billion.\nWith that, the company's cash and equivalents tally (basically, greenbacks plus extremely liquid securities) ballooned to $277 billion according to that earnings report. That's quite the dramatic increase from the previous end-quarter figure of $189 billion.\nOther changes in Berkshire's portfolio are less Earth-shaking, and entirely in character for Buffett. The celebrated investor loves the concept of a moat, and he's got a pair in two new Berkshire positions: aerospace and medical device components supplier Heico, and Ulta Beauty, a cosmetics retailer that sets itself apart with its in-store salons.\nMeanwhile, existing Berkshire holdings that got a boost in share count last quarter included unique media company Sirius XM Holdings, energy giant Occidental Petroleum, and an enterprise operating in a sector near, dear, and very familiar to Buffett and his colleagues: insurance mainstay Chubb.\nFinally, we recently saw Berkshire fully exit its investments in troubled entertainment company Paramount Global and the far more popular stock of high-flying cloud data specialist Snowflake. Other sell-offs included chunks of its holdings in Capital One Financial and Occidental peer Chevron.\nTaking all these changes together, it seems Berkshire isn't as confident as it once was on the growth potential of stocks today. That would explain its recent thirst for Treasuries, one of the most conservative investments imaginable. Those new equity positions suggest a batten-down-the-hatches adherence to that economic moat philosophy, as do several of the add-ons of existing holdings (except for maybe Occidental, which could be more of a play on low valuations; Buffett is an ace bargain hunter).\nThe Apple and Bank of America sell-offs trim those positions to more reasonable levels, particularly with the former stock. It's a conservative move to reduce a stake to the point where it's far less dominant in the portfolio than it once was.\nIf anything, I think Berkshire's slimmed-down equity portfolio looks better than it did when I wrote the previous article. Apple is a fine company, but at its size, anchored as it is by a nearly 20-year-old product (the iPhone), it won't have an easy time posting meaningful growth numbers. Those other recent buys look both opportunistic and potentially quite rewarding, an admirable combination.\nSo given that Berkshire's current stock lineup is an improvement over the quarter-ago version, I'm still bullish on the company. It remains a definite buy to me.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 7, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Eric Volkman has positions in Apple. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Chevron, Snowflake, and Ulta Beauty. The Motley Fool recommends Heico and Occidental Petroleum. The Motley Fool has a disclosure policy.\nBerkshire Hathaway: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-04T14:00:16.000Z",
        "Title": "Warren Buffett-Led Berkshire Hathaway Pares Bank Of America Stake By $338M, Marking 13th Round Of Sales Amid Speculation On Strategic Shifts",
        "Author": "  Kaustubh Bagalkote ",
        "Text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nLegendary investor Warren Buffett-led Berkshire Hathaway (NYSE:BRK) (NYSE:BRK) has further reduced its stake in Bank of America Corp (NYSE:BAC), selling shares worth $338 million, as per a recent U.S. Securities and Exchange Commission filing.\nWhat Happened: This marks the 13th round of sales since mid-July, with shares sold at an average price of $39.40, one of the lowest prices received since the selling began.\nDon't Miss:\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nFinding a fiduciary financial advisor doesn’t have to be hard. SmartAsset’s free tool matches you with up to 3 financial advisors that serve your area in 5 minutes. Each advisor has been vetted by SmartAsset and is held to a fiduciary standard to act in your best interests.\nDespite these sales, Berkshire Hathaway remains the largest shareholder, holding 10.2% of the bank’s stock, valued at over $31 billion.\nThe pace of Berkshire’s sales has slowed, with recent transactions averaging $338 million, compared to previous rounds of about $750 million. The reasons for the sales remain undisclosed.\nTrending: This billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nWhy It Matters: Bank of America CEO Brian Moynihan has praised Buffett as an investor but admitted uncertainty about the reasons behind the share reduction, stating, “I don't know what exactly he is doing because frankly we can't ask.”\nBuffett’s recent actions have raised eyebrows, given his reputation for a long-term, patient investment approach. His decision to sell a significant portion of one of his favorite stocks, Bank of America, has sparked speculation about potential strategic shifts or market concerns.\nPrice Action: Bank of America Corp’s stock closed at $39.23 on Wednesday, up 0.025% for the day. Year to date, the stock has surged 15.72%, according to data from Benzinga Pro.\nWondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.\nKeep Reading:\nYour biggest returns may not come from the stock market. Invest the way colleges, pension funds, and the 1% do. Get started investing in commercial real estate today.\nInterest rates are falling but you can still make high yields in real estate. Find out how.\nThis article Warren Buffett-Led Berkshire Hathaway Pares Bank Of America Stake By $338M, Marking 13th Round Of Sales Amid Speculation On Strategic Shifts originally appeared on Benzinga.com\n"
    },
    {
        "Date": "2024-10-01T15:56:42.000Z",
        "Title": "Warren Buffett buys rest of Berkshire Hathaway's utilities, but investors must guess at the price",
        "Author": "  JOSH FUNK ",
        "Text": "OMAHA, Neb. (AP) — Warren Buffett's Berkshire Hathaway is buying the rest of its utility unit from the estate of a longtime board member who died three years ago, but it's not clear exactly how much it will pay for that 8% stake in the massive utility business.\nBerkshire Hathaway Energy said in a regulatory filing Tuesday that it will pay Walter Scott's family $2.4 billion cash and issue a number of Class B Berkshire shares that are equivalent to 1.6 million shares of the utility business, but since the utility's shares aren't publicly traded it is hard to estimate the total value of the deal that's expected to close later this year. Altogether, Berkshire is buying more than 4.4 million shares in the utilities to give it 100% ownership.\n“That filing left me with a number of questions, but they don’t have an investor relations function so I don’t expect those questions to be answered,” CFRA Research analyst Cathy Seifert said. “The hope is that when they report earnings there will be more details.”\nDes Moines, Iowa-based Berkshire Hathaway Energy includes MidAmerican Energy, Pacificorp and NV Energy in Nevada and a Canadian electricity transmission provider called AltaLink, among other businesses.\nBuffett doesn't like to disclose any more than he has to, and the Berkshire Hathaway parent company didn't issue a press release or file anything with the Securities and Exchange Commission, leaving investors to speculate.\nApparently, Buffett doesn't believe this transaction is big enough to have a material impact on Berkshire Hathaway given that it just reported more than $30.3 billion in earnings and was sitting on $277 billion cash in the second quarter.\nBut a similar transaction when Berkshire bought out Vice Chairman Greg Abel's 1% stake in the utility business two years ago for $870 million suggests this deal with the Scott family is sizeable. Abel is slated to eventually replace Buffett as Berkshire Hathaway's CEO. If Berkshire agreed to pay the same price for the shares the Scott family is selling, the deal should be worth $6.96 billion.\nOf course in the past two years, one of Berkshire's biggest utilities, PacifiCorp, has paid out hundreds of millions in settlements related to wildfires in Oregon and California that damaged thousands of homes in 2020, and Berkshire Hathaway has recorded $2.7 billion in wildfire losses.\nBuffett was down on the utility industry's prospects in this year's letter to Berkshire Hathaway shareholders. But it's not clear what the current value of the utility divisions shares are today. Buffett didn't immediately respond to questions about the deal with the Scott family, and the utility unit declined to comment beyond what is in the regulatory filing.\nIn addition to utilities, Berkshire Hathaway owns BNSF railroad, a number of large insurance companies including Geico and a varied assortment of manufacturing and retail firms that includes aviation parts maker Precision Castparts and more well-known brands like Dairy Queen and See's Candy.\n"
    },
    {
        "Date": "2024-10-01T18:48:21.000Z",
        "Title": "Berkshire Hathaway buys full control of its energy unit",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) -Berkshire Hathaway will take full ownership of Berkshire Hathaway Energy, after Warren Buffett's conglomerate agreed to acquire the 8% it did not already own from the family of late billionaire philanthropist Walter Scott.\nAccording to a Tuesday regulatory filing, Berkshire Hathaway Energy will pay $2.37 billion in cash for about 4.42 million of its shares.\nThe Scott family will also swap 1.6 million of the energy unit's shares for an unspecified number of Berkshire Class B shares. Berkshire Hathaway Energy is also exchanging some debt.\nFollowing the transaction, Omaha, Nebraska-based Berkshire will own 100% of the energy unit, up from 92% now.\nThe transaction is expected to be completed after regulatory approvals in the current quarter. Its total value is unclear because the energy unit's shares are not publicly traded.\nBerkshire Hathaway Energy declined additional comment, while Berkshire did not immediately respond to a request for comment.\nScott, an Omaha native, was a longtime Berkshire director and Buffett friend who died in Sept. 2021 at age 90.\nAnalysts had expected Berkshire to buy out Scott's family, though Edward Jones' analyst James Shanahan said it took longer than expected.\nIn June 2022, Berkshire Vice Chairman Greg Abel, who led Berkshire Hathaway Energy for a decade, sold his 1% stake to Berkshire for $870 million. That suggested that the Scott family's stake was worth nearly $7 billion at the time.\nBut the energy unit's PacifiCorp utility has since faced many lawsuits from homeowners and business owners who blame it for causing wildfires in Oregon and northern California in 2020.\nThe purchase also lets Berkshire spend some of its cash, which totaled $276.9 billion as of June 30.\n\"It makes sense,\" said Cathy Seifert, an analyst at CFRA Research. \"Berkshire has a significant pile of cash to deploy, at a time U.S. Treasury yields are falling and likely to continue to fall.\"\nShe said the energy unit nonetheless \"has had its fair amount of challenges since Abel sold his stake, not the least of which is the wildfire litigation.\"\nBerkshire Hathaway Energy owns energy, utility and pipeline businesses, and one of the largest U.S. residential real estate brokerages.\nBuffett's conglomerate originally bought a 76% stake in 2000, when the unit was known as MidAmerican Energy. The unit adopted the Berkshire Hathaway Energy name in 2014.\nBerkshire also owns dozens of other businesses, including the BNSF railroad and Geico car insurance, and common stocks including Apple.\nAbel, 62, is expected to eventually succeed Buffett, 94, as Berkshire's chief executive.\n(Reporting by Jonathan Stempel in New York; Editing by Nick Zieminski)\n"
    },
    {
        "Date": "2024-10-15T11:00:00.000Z",
        "Title": "2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Most investors know that Berkshire Hathaway (NYSE: BRK. A)(NYSE: BRK.B) has been one of the best-performing investments of all time. Its key to success has been to invest consistently, holding for years or even decades at a time.\nBut Berkshire's run is far from over. And right now, there are two exciting reasons nearly every investor should consider jumping into this legendary stock.\nWarren Buffett acquired Berkshire Hathaway back in 1965. Over the first few decades of operation, the company soared in value. In the 1980s, for example, Berkshire stock rose in value by at least 30% most years, with annual returns reaching as high as 90%.\nEven though Berkshire's biggest days of growth are behind it, the shares have still performed quite well over more recent decades. During the past 30 years, for instance, Berkshire's total return has greatly outperformed that of the S&P 500 index. Even over just the past three years, Berkshire stock has risen by roughly 60%, besting the S&P 500's return of just 38% over the same time period.\nBRK. B Total Return Level data by YCharts\nWhat has allowed Berkshire stock to beat the market again and again, even as its valuation has soared to nearly $1 trillion? The biggest key has been Buffett's investing prowess. Buffett and his investing team have repeatedly invested shareholder capital successfully, whether by buying shares of a publicly traded company, acquiring a private company, or simply buying back Berkshire's own stock.\nBut there's another advantage that Berkshire has that few other investments offer: the advantage of permanent capital. That is, Berkshire has a pool of capital that it can invest regardless of market conditions. During the 2008 financial crisis, for example, it was able to spend billions of dollars on blue chip companies at discounts simple because so many other competing pools of capital had already dried up.\nThis permanent capital is generated by Berkshire's insurance businesses -- an industry that doesn't necessarily see demand plummet during recessions or bear markets. While underwriting profits may not be very high during certain market cycles, insurers provide a steady stream of investable cash because premiums are paid up front while claims are paid out after the fact. Many other investment vehicles have copied this business model in recent years, but it has remained a durable competitive advantage for Berkshire, especially when paired with Buffett's investment acumen.\nDiverting more cash that could be used for lifestyle expenses into your investment account is not always fun, but it's a wise long-term decision. Investing in Berkshire can eliminate some of the friction involved in upping your savings rate.\nFirst, every time you buy more Berkshire stock, you know you're betting on one of the most successful investment vehicles in history. Putting more money to work in the market is significantly more fun when you have the confidence that these investments will match or even outpace the overall market's returns.\nSecond, by buying shares of Berkshire, you become a partner in one of America's most iconic businesses. You quite literally become an investing partner with Buffett and the rest of this team. Whenever they make a move, so are you. Except in this case, they're doing all of the groundwork for you, while you sit back and enjoy life. If they see opportunities in a certain industry or region of the world, Buffett and company are empowered to invest your money where it has the best chance of growing. Whereas with other investments, your capital may be limited to a certain industry or geography.\nIn a nutshell, investing in Berkshire can be more fun than nearly any other investment vehicle. Who wouldn't want to be investment partners with Warren Buffett? And any trick you can use to up your savings rate is nearly as important as choosing the right investment. With Berkshire, you can accomplish both, making it an attractive choice for nearly every investor.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of October 14, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\n2 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-10-11T12:00:42.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Reportedly Raises $1.9B Through Largest Samurai Bond Sale In 5 Years",
        "Author": "  Kaustubh Bagalkote ",
        "Text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nBerkshire Hathaway (NYSE:BRK) (NYSE:BRK) has successfully secured 281.8 billion yen, approximately $1.9 billion, via a yen-denominated bond offering. This represents the company’s largest bond sale in Japan’s currency in five years.\nDon’t Miss:\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nYour biggest returns may not come from the stock market. Invest the way colleges, pension funds, and the 1% do. Get started investing in commercial real estate today.\nWhat Happened: This issuance of Samurai bonds highlights Warren Buffett‘s increasing interest in Japan’s financial markets. Over the past four years, Berkshire Hathaway has invested in Japan’s top five trading houses, and this bond sale is part of its strategy to expand its exposure to Japanese assets, as per a term sheet reviewed by Reuters on Thursday.\nAccording to a filing with the U.S. Securities and Exchange Commission, Berkshire Hathaway will use the funds for general corporate purposes. The company initially announced plans to invest in Japan’s trading houses in 2020, with a goal to hold these stakes long-term and potentially increase ownership to 9.9%.\nBerkshire did not immediately respond to Benzinga's request for comment.\nTrending: This billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10.This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\nThis year, Berkshire Hathaway has engaged in significant yen bond sales, with the latest issue featuring bonds with maturities ranging from 3 to 30 years. The largest tranche, a 3-year bond, raised 155.4 billion yen, while the 5-year bond secured 58 billion yen.\nWhy It Matters: Buffett’s strategic move into Japan’s financial markets aligns with his long-term investment philosophy. In a recent letter to investors, Buffett emphasized the importance of companies that consistently increase dividends. This approach has contributed to Berkshire Hathaway’s impressive returns.\nDespite global market volatility, Berkshire Hathaway’s Japanese investments have shown resilience. In early August, the Nikkei 225 index experienced a significant drop but managed to recover most of its losses. This underscores the strength of Buffett’s investments in Japan’s trading giants.\nWondering if your investments can get you to a $5,000,000 nest egg? Speak to a financial advisor today. SmartAsset’s free tool matches you up with up to three vetted financial advisors who serve your area, and you can interview your advisor matches at no cost to decide which one is right for you.\nKeep Reading:\nInterest rates are falling but you can still make high yields in real estate. Find out how.\nGet ‘em while you can — investing in this asset class may be reaching a high-water mark but you can still make returns right now.\nThis article Warren Buffett's Berkshire Hathaway Reportedly Raises $1.9B Through Largest Samurai Bond Sale In 5 Years originally appeared on Benzinga.com\n"
    },
    {
        "Date": "2024-10-03T13:06:40.000Z",
        "Title": "Berkshire unloads more Bank of America shares",
        "Author": "Reuters ",
        "Text": "(Reuters) - Berkshire Hathaway unloaded more Bank of America stock this week, boosting sales since mid-July to nearly $10 billion as Warren Buffett simplifies part of his conglomerate's vast portfolio.\nIn a regulatory filing on Wednesday night, Berkshire said it sold 8.55 million Bank of America shares this week for about $337.9 million. It has sold about 238.7 million shares, or about 23% of its holdings, since mid-July.\nBerkshire still owns about 10.2% of the second-largest U.S. bank, or a slightly higher percentage if Bank of America has yet to disclose recent stock buybacks.\nIt must continue reporting sales until and including thesale that drives its stake below 10%. Thereafter, investors must likely wait for Berkshire'squarterly financial reports or quarterly stock holdingsdisclosures to learn if the Omaha, Nebraska-based company soldmore. The U.S. Securities and Exchange Commission requires shareholders that own more than 10% of a company to disclose stock purchases and sales within two business days.\nBerkshire's selling reduces to a more manageable size whathad been its second-largest stock holding, which originated in a$5 billion investment in 2011.\nThe company also more than halved its largest stock holding,Apple, in the year's first half.\nBuffett, 94, tied up another loose end this week when the company agreed to buy the 8% it did not already own of its energy and utility business Berkshire Hathaway Energy from the estate of billionaire philanthropist Walter Scott.\nBerkshire ended June with $276.9 billion of cash. It will spend $2.37 billion of cash in the Berkshire Hathaway Energy transaction.\nBuffett has run Berkshire since 1965. His conglomerate's dozens of businesses include the BNSF railroad, Geico car insurance, and smaller operations such as Dairy Queen and See's Candies.\n(Reporting by Jonathan Stempel in New York; Editing by Nick Zieminski)\n"
    }
]