[
    {
        "Date": "2024-01-14T14:45:00.000Z",
        "Title": "Berkshire Hathaway Is Great. Here's Why You Shouldn't Buy It.",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Everyone on Wall Street knows and respects Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) and its CEO, Warren Buffett. There are a lot of reasons to buy the stock, and if history is any guide, it wouldn't be a mistake to do so. However, no stock is perfect for every investor. Here are a few reasons why you might not want to buy or own Berkshire Hathaway.\nOver the past decade, Berkshire Hathaway's stock is up roughly 215%, versus a stock advance of 155% for the S&P 500 Index. That's pretty impressive, but if you add dividends into the equation, the numbers are a lot less compelling. Berkshire Hathaway doesn't pay dividends, so its return remains at 215%. But if you reinvested dividends into the S&P 500, your total return would be about 205%. Berkshire Hathaway's lead isn't quite as compelling anymore.\nOver the past year, meanwhile, Berkshire Hathaway has lagged the S&P 500, with a gain just shy of 15% versus the S&P's price advance of around 20% and total return of about 22%. Clearly, an investment in Berkshire Hathaway isn't exactly a slam dunk.\nThings start to shift far more dramatically in Berkshire Hathaway's favor when you look further back in time. For example, since the turn of the century, Berkshire Hathaway is up nearly 900%, versus stock-only gain of nearly 220% and a total return gain of nearly 400% for the S&P 500. To justify buying Berkshire Hathaway, you need to be prepared to own it for a fairly long time and believe that the future will be similar to the very long-term past.\nMost companies do one or two things and do those things well. Berkshire Hathaway isn't like that. It's a holding company that invests in other companies, either by buying them or investing in them, like other investors but at a much larger scale. For example, it owns insurance companies, utilities, train companies, furniture stores, and a paint maker, among many other things. Then it invests in publicly traded stocks, notably using the premiums paid to its insurance company subsidiaries.\nCEO Warren Buffett treats all these businesses, including the ones Berkshire Hathaway owns outright, much like an investor would. He looks for good businesses with good managers and lets the managers do their jobs. He checks in on the businesses to make sure they are performing well, or at least as well as could be hoped given the business environment, and only makes changes when there's a problem. It's unlikely that most investors could track all the businesses and industries that exist in Berkshire Hathaway's portfolio, so you are, basically, trusting that Buffett and his team are doing it for you.\nWhat you can't do is go in thinking that this is a simple business. It just isn't, no matter how folksy and easy to read Berkshire Hathaway annual reports are. If you prefer simple, then Berkshire Hathaway probably won't be a good fit for your portfolio.\nIt's already been noted, but Berkshire Hathaway doesn't pay a dividend. It has a huge cash pile, so it could pay a dividend if it wanted to. However, Buffett doesn't like to pay dividends (even though he does like to collect them). So there's no reason to expect a dividend to be paid anytime soon, given the level of control and ownership Buffett has at the company.\nThus, if you are an investor trying to live off the income you can generate from your portfolio, then Berkshire Hathaway would be a bad option for you. You could simply sell some of your Berkshire Hathaway position to generate cash for living costs, which is a perfectly reasonable approach. However, in a year like 2023, when Berkshire Hathaway lagged the market, you might not want to sell those shares and risk ending up short on cash. Once again, it isn't exactly a slam-dunk investment choice.\nWhen you look at the long-term performance of Berkshire Hathaway, you can see that it clearly deserves the accolades that are lavished upon it and CEO Buffett. But hindsight is 20/20, and not every year is a good one. The company is also very complex, and it requires a huge amount of trust in management. And if you like dividends, well, don't bother looking at Berkshire, since it pays none. Overall, this is a great company, but it may not be a great fit for every investor.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Berkshire Hathaway wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 8, 2024\n \nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Is Great. Here's Why You Shouldn't Buy It. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-25T13:45:00.000Z",
        "Title": "Berkshire Hathaway: Buy, Sell, or Hold?",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Many people consider Warren Buffett the most famous investor of all time. The remarkable decades-long performance of his holding company, Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), is a big reason why.\nThe stock traded at roughly $19 when Buffett took control in 1965. Today, those Class A shares trade at $559,000, an amazing 29,421-fold return on your initial investment over the past six decades. Don't worry: Investors can also purchase Class B shares for $367 apiece.\nBut should investors buy Berkshire at a time when the stock is at all-time highs? There are many moving parts inside Buffett's Wall Street empire, so valuing the shares can be tricky. Check out the data below to decide whether the stock is a buy, sell, or hold today.\nMost companies have a core focus on one business model. A conglomerate can own various brands but often operates within an industry. For example, Procter & Gamble owns dozens of brands related to household goods.\nBerkshire Hathaway is a holding company. It owns a mix of businesses across many industries. The profits accumulate on Berkshire Hathaway's balance sheet, and Buffett and his team then use those funds to grow the company, make new investments, and the like.\nSo, what's inside Berkshire Hathaway today? The company reports in a few primary segments. First, you have insurance and \"other.\" This is headlined by GEICO insurance, followed by various businesses and brands, including Dairy Queen, Duracell, See's Candies, and more.\nBerkshire also owns railways, oil and gas pipelines, renewable energy projects, and utilities, which it reports under a different unit called railroad, utilities, and energy.\nLastly, it holds a portfolio of stakes in a few dozen publicly traded companies, which are the parts of Berkshire most investors probably follow the closest. The portfolio's total value is roughly $370 billion, including prominent positions in Apple, Bank of America, American Express, and Coca-Cola.\nConcentrating on the company's bottom-line earnings might be investors' biggest mistake when evaluating Berkshire Hathaway. The energy businesses, railways, and utilities require occasional large investments to maintain or upgrade them. And the share prices in the company's portfolio can go up or down over time. These two factors can easily skew its reported earnings.\nInstead of earnings, consider valuing the stock on Berkshire's book value. A company's book value is its assets minus liabilities. In other words, what do you have left over after you pay everyone you owe? Ideally, a business grows and accumulates assets faster than it does debt.\nPeople might ask why Berkshire Hathaway has $157 billion in cash on its balance sheet and doesn't pay dividends to shareholders. The answer, from Buffett himself, is that he believes Berkshire's profits can be spent in better ways.\nThat means investments, acquisitions, and things that add to Berkshire's assets. Once a dividend is paid, that cash leaves the business forever. That willingness to keep profits inside Berkshire and continue putting them to work is the secret ingredient for the stock's massive returns.\nIf you compare Berkshire Hathaway's share price to its book value over the past several decades, you'll see that the stock trades at its historical average today:\nComparing how well Berkshire Hathaway generates profits can help put the stock's valuation into perspective and aid your investment decision. Below is its return on equity, measured as a three-year median over time. Notice how it has climbed beyond its historical average in recent years?\nOne might argue that the stock is valued at its long-term norms, but the business has been generating higher returns. In that case, there's a solid argument to buy and hold the stock today.\nDon't underestimate Berkshire's flexibility. With $157 billion in cash on its balance sheet, Buffett and team have a war chest to create long-term value in the business. The stock isn't flashy, but investors can buy and hold this proven winner and let it continue building wealth.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Berkshire Hathaway wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 22, 2024\n \nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-31T15:23:00.000Z",
        "Title": "Warren Buffett-Led Berkshire Hathaway's $371 Billion Portfolio Owns 51 Stocks, but Over 80% Is Invested in These Sensational 6",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Warren Buffett might have the all-time most extraordinary investment track record when all is said and done. His holding company, Berkshire Hathaway, has beaten the S&P 500 by a wide margin for decades.\nBerkshire is a holding company with dozens of private businesses and investments. However, investors follow the company's massive $371 billion stock portfolio the closest. Despite holding 51 stocks, just six make up over 80% of the portfolio's value. What does this mean, and how can investors apply Warren Buffett's wisdom to their investment strategy?\nBerkshire Hathaway, one of the world's largest corporations, has over 80% of its stock portfolio in just six companies. Here they are:\nCompany\nPosition Size (% of Berkshire portfolio)\nApple\n47.5\nBank of America\n9.3\nAmerican Express\n8.2\nCoca-Cola\n6.4\nChevron\n4.4\nOccidental Petroleum\n3.8\nData source: CNBC. Table by author.\nWhile each stock has risen to the top of Berkshire's portfolio, they all have unique stories explaining how that came to be. Here's a look at each.\nBuffett first bought iPhone maker Apple (NASDAQ: AAPL) in 2016. It's worked out very well for Berkshire. The stock has returned roughly 700% since the beginning of that year, with reinvested dividends along the way. That outsized return helps explain the stock's massive weighting in Berkshire's portfolio today.\nWe all make mistakes. Berkshire bought Bank of America (NYSE: BAC) in 2007, just before the financial crisis. By 2010, Buffett had bailed on the bank's shares. However, he would eventually come back to the stock, building a new position starting a decade later. It's remained in the portfolio since and is Berkshire's second-largest holding today.\nWarren Buffett is famous for having a long-term mindset, reflected in his ownership of Coca-Cola (NYSE: KO) and American Express (NYSE: AXP). Berkshire bought these two stocks in 1988 and 1991, respectively, and has let them grow, repurchase shares, and pay dividends for decades. Given each company's brand recognition with consumers, it's hard to see Berkshire selling these stocks anytime soon, if ever at all.\nLastly, energy is a popular theme in Berkshire's business. The company owns private assets in oil and gas, including pipelines and utilities, but has also amassed large stakes in Chevron (NYSE: CVX) and Occidental Petroleum (NYSE: OXY). Buffett has bought most of the shares in these companies over the past four years as part of a bet on long-term oil prices, though he's sold some of Berkshire's Chevron stock over time.\nNo investor gets it right every time, even Buffett. Time will tell whether Berkshire's most significant holdings continue to perform, but Buffett's actions hint at his general investment philosophy. You shouldn't mindlessly copy his stock picks, but incorporating some of his beliefs can help you invest to the best of your ability.\nBuffett is famous for saying that his No. 1 rule is never to lose money, and that his second rule is remembering the first one. Buffett has done very well investing in blue chip stocks at reasonable valuations, letting proven winners grow and create steady returns for investors. He doesn't chase speculative, unprofitable stocks. He embodies the tortoise, not the hare.\nBuffett has stated that a long time horizon is critical to successful investing. Berkshire doesn't always hold stocks for very long. However, recognizing and selling when you pick wrong is far different from selling an excellent investment to realize a profit. As Buffett has with Coca-Cola and American Express, you can hold the right stocks for decades.\nIt's hard to invest for a long time if the companies you hold aren't around. You'll notice that Berkshire's portfolio focuses on the economy's fundamental pillars, like consumer spending, finances, and energy. These industries have been around for decades, even centuries. Disruptive growth stocks can add a spark to a diversified portfolio, but remember, they haven't proven their staying power yet.\nThe size of Berkshire's Apple investment jumps off the page when you see it. It's for good reason. Berkshire's total Apple position is worth over $176 billion. That's an enormous amount of money for a single investment -- even for Buffett.\nHowever, it didn't start that large. It's grown as the stock has appreciated so much over the past eight years. So why not sell? Buffett has stated that he believes Apple is better than any other business Berkshire owns. In other words, he doesn't want to sell it to buy something inferior.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Berkshire Hathaway wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 22, 2024\n \nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Bank of America is an advertising partner of The Ascent, a Motley Fool company. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool recommends Chevron and Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett-Led Berkshire Hathaway's $371 Billion Portfolio Owns 51 Stocks, but Over 80% Is Invested in These Sensational 6 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-23T11:12:00.000Z",
        "Title": "How Big Is Berkshire Hathaway's Cash Hoard? Here Are 7 Companies You Might Be Shocked to Know It Could Buy Right Now.",
        "Author": "  Matthew Frankel, CFP®, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B), the massive conglomerate led by Warren Buffett, is best known for its $365 billion stock portfolio and for its subsidiary businesses like GEICO, Duracell, and many others.\nHowever, there's a third major component to Berkshire Hathaway's assets – its cash. Berkshire ended the third quarter of 2023 with $157 billion in cash on its balance sheet, an all-time high. And there's a high probability that this figure grew even larger by the end of last year. We'll find out when the company reports results.\nIt can be tough for investors to truly understand how much money that is, and how much financial flexibility it gives Berkshire. So, with that in mind, let's have some fun and look at companies Berkshire could potentially buy with its cash, and a few other key points investors should know.\nTo be perfectly clear, I have no idea if Buffett and his team have even a mild interest in investing in any of these businesses. But just to illustrate how much cash Berkshire has, here are seven businesses with market caps lower than the $157 billion in cash Berkshire is holding.\nCompany\nMarket Cap\nNike\n$154 billion\nCaterpillar \n$145 billion\nGeneral Electric\n$141 billion\nUnited Parcel Service\n$134 billion\nBoeing\n$130 billion\nLowe's \n$127 billion\nStarbucks \n$107 billion\nData source: CNBC. Market cap data as of Jan. 21, 2024.\nAgain, I don't know if Buffett would be interested in any of these (although I've said before that Starbucks could be an especially good fit for Buffett's style). And this is just a tiny fraction of the publicly traded companies Berkshire could buy. In fact, out of thousands of public companies on the major U.S. exchanges, there are only 59 that have market caps greater than Berkshire's cash.\nThere are three important caveats to keep in mind when it comes to Berkshire's cash stockpile, two of which lower the company's buying power and one that increases it.\nBuffett insists on always keeping a minimum of $30 billion in cash reserves, so the actual spending power is about $127 billion. This way, Buffett would maintain adequate liquidity no matter what the economy or stock market were doing.\nIf Berkshire were to acquire a large, publicly traded company in its entirety, it would likely have to pay a premium to its current market cap to do it. For example, when Berkshire acquired mid-cap insurance company Alleghany Corporation in 2022, it paid a 29% premium to Alleghany's average stock price over the prior 30-day period.\nBerkshire has excellent credit that gives it access to (relatively) low interest rates if it chooses to borrow money. Not that I expect it to happen, but if Buffett wanted to make a $200 billion acquisition, Berkshire could probably do it with a combination of cash and borrowed money.\nBuffett has made it very clear that he has no interest in making a large acquisition unless he thinks he's getting a good deal, and that's especially true in the current environment. While interest rates are high, most of Berkshire's \"cash\" is actually invested in short-term Treasuries, which currently have interest rates above 5%. So, Berkshire's cash is actually generating billions of dollars in additional cash for the company. And Berkshire's risk-adjusted returns would have to be significantly higher than the yield it gets from its cash in order to get Buffett interested.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Berkshire Hathaway wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 16, 2024\n \nMatthew Frankel, CFP® has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway, Nike, and Starbucks. The Motley Fool recommends Lowe's Companies and United Parcel Service and recommends the following options: long January 2025 $47.50 calls on Nike. The Motley Fool has a disclosure policy.\nHow Big Is Berkshire Hathaway's Cash Hoard? Here Are 7 Companies You Might Be Shocked to Know It Could Buy Right Now. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-05T10:50:30.000Z",
        "Title": "Will the Growth of Berkshire Hathaway (BRK-B) Continue to Accelerate?",
        "Author": "  Soumya Eswaran ",
        "Text": "Vltava Fund, an investment management company, recently released its fourth-quarter 2023 investor letter. A copy of the same can be downloaded here. 2023 proved to be a prosperous year for the fund. The letter concentrates on outlining the more noteworthy changes that have occurred within the businesses that the fund owns. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nIn its Q4 2023 investor letter, Vltava Fund featured stocks such as Berkshire Hathaway Inc. (NYSE:BRK-B). Headquartered in Omaha, Nebraska, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in the insurance, freight rail transportation, and utility businesses. On January 4, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $363.68 per share. One-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 3.00%, and its shares gained 14.12% of their value over the last 52 weeks. Berkshire Hathaway Inc. (NYSE:BRK-B) has a market capitalization of $797.768 billion.\nIn its fourth quarter 2023 investor letter, Vltava Fund stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B):\n\"Entire books have been published on Berkshire Hathaway Inc. (NYSE:BRK-B) transactions. One of the best that I can highly recommend is Adam Mead’s 2021 book, The Complete Financial History of Berkshire Hathaway. The book is excellent and detailed, but it, too, will need updating over time. In fact, Berkshire Hathaway writes another interesting chapter in its history every year. A chapter describing 2023 would be quite extensive. At the turn of the year, Berkshire completed its $11.6 billion acquisition of the insurer Alleghany Corporation. A little later, Berkshire increased its stake in Pilot Flying J to 80% and its holdings in five Japanese “sogo shosha” conglomerates to 8.5% (a total investment at current prices of about $20 billion). Through the course of the year, Berkshire also steadily increased its stake in Occidental Petroleum to 37% (including warrants). Berkshire Hathaway continues to be a very unique type of conglomerate whose investments generate huge amounts of cash and which can successfully reinvest that cash again and again over the long term. It is an almost perfect case of a snowball in the markets. Here is one interesting fact: we estimate that the intrinsic value of a single Berkshire share is currently growing at a rate of about $178 per day. When we bought the shares 12 years ago, this was less than $50 a day. The rate of growth is accelerating gradually and with minimal fluctuations. Moreover, Berkshire has additional decades of similar growth still ahead of it.\"\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 12th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 116 hedge fund portfolios held Berkshire Hathaway Inc. (NYSE:BRK-B) at the end of third quarter which was 109 in the previous quarter.\nWe discussed Berkshire Hathaway Inc. (NYSE:BRK-B) in another article and shared the list biggest multinational companies headquartered in the US. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n17 Countries With Best Universities In Asia\n25 Cheapest Online Business Degree Programs Heading Into 2024\n30 Countries With Best Universities In The World\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-01-09T14:45:00.000Z",
        "Title": "Warren Buffett's Biggest AI Bets in 2024: 47.2% of Berkshire Hathaway's $358 Billion Stock Portfolio Is in These 3 Artificial Intelligence Stocks",
        "Author": "  Keith Noonan, The Motley Fool ",
        "Text": "Berkshire Hathaway CEO Warren Buffett has built an incredible track record of market-crushing returns by identifying high-quality companies that are worth investing in for the long term. Taking this approach to investing in the artificial intelligence (AI) revolution could prove hugely rewarding for retail investors as well.\nIf you're looking to score wins in the AI space, these three Buffett-backed stocks could help take your portfolio to the next level.\nWith a market capitalization of roughly $2.8 trillion, Apple (NASDAQ: AAPL) stands as the world's most valuable publicly traded company. It's also the largest stock position by far in the Berkshire Hathaway portfolio, accounting for about 47% of the investment conglomerate's total stock holdings.\nWhile Apple has been somewhat secretive about its AI initiatives, it has some big advantages in the space. For starters, the tech giant has a massive base of users who love its mobile devices, computers, other hardware, software, and services.\nThat large and highly engaged user base provides it with a loyal group of customers eager to adopt new offerings within its ecosystem. It also provides the tech giant with a trove of valuable data that can be fed into artificial intelligence algorithms.\nApple continues to dominate the smartphone market and has been an early mover in the voice-based assistant space. If AI-powered personal assistants come to be a revolutionary new service category in the way that some tech luminaries and analysts are predicting, Apple could wind up being a big winner in the space.\nAfter sitting on the sidelines for years, Berkshire Hathaway finally opened a position in Amazon (NASDAQ: AMZN) in 2019. Buffett has said he regrets not buying into the e-commerce and cloud computing giant's growth story earlier.\nBerkshire owns roughly $1.5 billion worth of Amazon stock -- a position that works out to about 0.4% of the investment conglomerate's total stock portfolio.\nArtificial intelligence looks poised to play a huge role in Amazon's growth from here on out. Amazon Web Services has the leading share of the cloud infrastructure market and is a go-to destination when developers want to build, launch, and scale AI services. As more artificial intelligence applications are released and used, this will add to the demand tailwinds for Amazon's cloud offerings.\nArtificial intelligence also has the potential to transform the company's e-commerce business. With AI opening the door for increased warehouse automation and packages being delivered by self-driving vehicles, Amazon's online retail business could see its margins and profitability soar.\nThese days, the vast majority of large organizations rely on services from different cloud providers. While multi-cloud setups have become the norm, they actually put substantial barriers in the way of combining and analyzing all the data those organizations generate. That creates some significant challenges.\nSnowflake's Data Cloud platform helps organizations transcend the barriers between cloud-infrastructure platforms. In order to build and run high-performance AI applications, being able to access and analyze the biggest possible pool of relevant data is crucial. Snowflake's software makes that possible, and the company looks poised to play an important role in pushing AI forward.\nFor its fiscal 2024, which will end on Jan. 31, the company expects product revenue of $2.65 billion and a non-GAAP (adjusted) free cash flow margin of 27%. Jump ahead to the company's fiscal 2029, and Snowflake anticipates recording roughly $10 billion in sales and an adjusted free cash flow margin of approximately 30%.\nWhile Berkshire Hathaway's Snowflake position accounts for just 0.3% of its stock portfolio, it has the potential to be one of the most explosive stocks owned by Buffett's company.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Apple wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of December 18, 2023\n \nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Berkshire Hathaway, and Snowflake. The Motley Fool has a disclosure policy.\nWarren Buffett's Biggest AI Bets in 2024: 47.2% of Berkshire Hathaway's $358 Billion Stock Portfolio Is in These 3 Artificial Intelligence Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-01-29T23:52:47.000Z",
        "Title": "Berkshire Hathaway Inc. Sees a 427.27% Increase in Shares by Fairholme Fund",
        "Author": "  GuruFocus Research ",
        "Text": "Warning! GuruFocus has detected 2 Warning Sign with JOE.\nFairholme Fund (Trades, Portfolio), under the stewardship of founder Bruce Berkowitz (Trades, Portfolio), has disclosed its N-PORT filing for the fourth quarter of 2023. Berkowitz, known for his value investing approach, has led the fund to impressive gains, outperforming the S&P 500 in its first decade. The fund's strategy is characterized by a concentrated portfolio, seeking out companies with strong management and robust cash flow, guided by the principle of \"Ignore the Crowd\".\nFairholme Fund (Trades, Portfolio) initiated positions in a new stock during the quarter:\nEnergy Transfer LP (NYSE:ET) was the notable new addition, with 10,000 shares purchased. This holding represents 0.01% of the portfolio, with a total value of $138,900.\nThe fund also bolstered its stake in existing holdings:\nBerkshire Hathaway Inc (NYSE:BRK.B) saw a substantial increase of 14,100 additional shares, bringing the total to 17,400 shares. This represents a 427.27% increase in shares held, impacting the portfolio by 0.46%, and a total value of $6,264,000.\nAs of the end of Q4 2023, Fairholme Fund (Trades, Portfolio)'s portfolio consisted of 6 stocks. The top holdings were heavily weighted in The St. Joe Co (NYSE:JOE) at 90.37%, followed by Enterprise Products Partners LP (NYSE:EPD) at 7.17%, Imperial Metals Corp (TSX:III) at 1.04%, Federal Home Loan Mortgage Corp (FMCC) at 0.84%, and Berkshire Hathaway Inc (NYSE:BRK.B) at 0.57%. The investments are predominantly focused in four industries: Real Estate, Energy, Financial Services, and Basic Materials.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-01-09T17:00:00.000Z",
        "Title": "Three New Countries Top Berkshire Hathaway Travel Protection’s Safest Places to Travel in 2024 List",
        "Author": "Business Wire ",
        "Text": "Canada, Switzerland and Norway ranked top three safest countries\nSTEVENS POINT, Wis., January 09, 2024--(BUSINESS WIRE)--Travel insurance provider Berkshire Hathaway Travel Protection (BHTP) has announced the findings of its ninth annual State of Travel Insurance Safest Destinations report, the longest-running and most trusted research project tracking U.S. travelers’ attitudes toward travel safety and travel insurance.\nTravelers planning their getaways for 2024 should consider destinations like Canada, Switzerland and Norway as they took the top three spots on the list of safest countries. The report also featured the world’s safest cities which saw Honolulu, Montreal and Reykjavik leading the Top 15 Safest Cities.\nTo determine these rankings, BHTP analyzes a combination of the State of Travel Insurance survey responses compiled in September from travelers who have been to the destinations along with several third-party data sources. These additional sources evaluate safety concerns such as terrorism, weather emergencies, health measures and the safety of underrepresented groups.\nTop 15 Safest Countries\nCanada\nSwitzerland\nNorway\nIreland\nNetherlands\nUnited Kingdom\nPortugal\nDenmark\nIceland\nAustralia\nNew Zealand\nJapan\nFrance\nSpain\nBrazil\nTop 15 Safest Cities\nHonolulu\nMontreal\nReykjavik\nSydney\nAmsterdam\nDubai\nCopenhagen\nLondon\nSeoul\nVenice, Italy\nTokyo\nBerlin\nParis\nBarcelona\nOrlando\nThe 2024 list saw a few shifts from last year’s safest destinations, with Canada breaking into the top five and taking the lead spot as the safest destination. Each of last year’s top three destinations – Netherlands, Denmark and Iceland – dropped out of the top three this year, but all remained in the top 10. The list of safest cities also saw a few shake ups with Honolulu making it into the top 10 cities and securing the number one spot.\nWhile the list has traditionally been dominated by Scandinavian nations, Northern Europe and English-speaking countries in Oceania, this year noted Asian and South American nations in the Top 15, with Japan and Brazil making the list.\nBHTP’s State of Travel Insurance research has been conducted each fall since 2016 by Polymath Research + Marketing, using independent national panels surveying thousands of consumers on future expectations in travel insurance and travel habits. The lists of the world’s safest countries and cities were created using an index that synthesizes results from multiple sources, including the U.S. State Department, the British financial magazine The Economist, safety-app creator GeoSure Global, Vision of Humanity, Numbeo, and Global Finance magazine. Past rankings also are factored in.\nClick here to read more on the safest cities ranking and here to read more on safest countries. To request a full report, members of the media can email the contact below.\nAbout the State of Travel Insurance\nState of Travel Insurance (SOTI), a joint project of Berkshire Hathaway Travel Protection (BHTP) and Polymath Research + Marketing (PRM), is the longest-running and most trusted research project tracking U.S. travelers’ attitudes toward travel safety and travel insurance. SOTI has been conducted since 2016, and continues to provide category-leading research on key travel issues. This year’s survey involved a total of 1,702 travelers who were surveyed by PRM from August 24 to September 13, 2023.\nAbout Berkshire Hathaway Travel Protection\nBerkshire Hathaway Travel Protection (BHTP) is a registered trademark and a subsidiary of Berkshire Hathaway Specialty Insurance Company, a leader in specialized casualty and liability insurance. Berkshire Hathaway Specialty Insurance Company provides underwriting and claims administration services for some of the largest distributors of travel insurance in the United States. Created under the Berkshire Hathaway Travel Protection trade name is the ExactCare® line of travel insurance, AirCare® flight, WaveCare®, AdrenalineCare®, LuxuryCare® and other travel-related protections. The AirCare® and ExactCare® products are provided by Berkshire Hathaway Specialty Insurance Company. Visit bhtp.com for more information.\nAbout Polymath Research + Marketing\nPolymath Research + Marketing is a full-service market-research and marketing agency that specializes in crafting custom research and content to help organizations reach their business and marketing goals. PRM currently services firms in the insurance, travel, sports, and manufacturing industries, and provides research and content support to several top agencies. To learn more visit www.polymathpower.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240108988279/en/\nContacts\nCarol Mueller, Vice PresidentBerkshire Hathaway Travel ProtectionCarol.Mueller@bhspecialty.com\n"
    }
]