[
    {
        "Date": "2024-02-28T12:30:09.000Z",
        "Title": "Is Berkshire Hathaway Stock a Good Buy? What To Know About Warren Buffett’s Holding Company",
        "Author": "  Adam Palasciano ",
        "Text": "In 1964, Warren Buffett took over as the majority owner of Berkshire Hathaway, which started as a small Massachusetts-based textile company. As of February 2024, his net worth hovers around $135 billion, according to Forbes.\nWarren Buffett Says Make Money While You Sleep: 5 ‘Forever Assets’ To Buy NowExplore: 6 Genius Things All Wealthy People Do With Their Money\nAt the time Buffett became majority owner, the company was trading at about $11.40 per share. Fast forward 60 years and the conglomerate is one of the world’s 10 largest publicly traded companies, with an impressive market cap of about $769 billion. Its Class A shares are currently trading at about $605,965 per share, while its Class B shares hover at a more reasonable $402 per share, as of February 27, 2024.\nAt age 93, Buffett still serves as CEO and Chairman of the company. Today, Berkshire Hathaway is a conglomerate that owns about 65 subsidiaries, some of which are fully or partly owned by the company. They include brands like Duracell, Dairy Queen, Jordan’s Furniture, Benjamin Moore, and GEICO Insurance — to name a few. Berkshire Hathaway takes profit from its insurance company holdings and invests them in a portfolio of about 50 different stocks valued at around $380 billion.\nThe company’s wide range of products and brands makes it one of the most consistent stocks on the market today.\nSponsored: Owe the IRS $10K or more? Schedule a FREE consultation to see if you qualify for tax relief.\nSince the company debuted its less expensive Class B shares in May 1996, the stock has averaged an annual return of about 10.4%. By comparison, the S&P 500 has had a total annualized return of about 9.5%.\nBerkshire Hathaway’s diverse blend of products provides a hedge against market ups and downs when compared to other stocks that can be focused on one type of product or industry. If you’re looking for upside potential and a long-term investment, then Berkshire Hathaway should certainly be a consideration in your portfolio.\nMore From GOBankingRates\n5 Dollar Tree Items Frugal People Always Buy\n5 Used Cars You Shouldn't Buy\nWhat Makes a Good Bank in 2024, According to a Banking Expert\nI'm a Personal Finance Writer: These Are the Worst Money Mistakes I Made in 2023\nThis article originally appeared on GOBankingRates.com: Is Berkshire Hathaway Stock a Good Buy? What To Know About Warren Buffett’s Holding Company\n"
    },
    {
        "Date": "2024-02-28T19:05:53.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Nears $1 Trillion Market Capitalization, But He Refers To It As 'The Dumbest Stock I Ever Bought' — It Could Have Been Worth Twice As Much Today If He Had Cut His Losses Sooner",
        "Author": "  Jeannine Mancini ",
        "Text": "Renowned investor and Berkshire Hathaway Inc. Chairman Warren Buffett has built a financial empire reaching a nearly $1 trillion market capitalization, a milestone that places the conglomerate on the verge of joining an elite global club. Despite this achievement, Buffett regards his investment in Berkshire Hathaway, a then-struggling textile company, as the \"dumbest stock I ever bought\" believing that the company’s value could have potentially doubled.\nDon't Miss:\nThe average American has $65,100 in their savings account — How do you compare?\nThis startup is accepting investors for as little as 25 cents – what’s the catch?\nBerkshire Hathaway’s ascent to the brink of the $1 trillion valuation follows a surge in its stock price, fueled by a strong quarterly earnings report. The company, with holdings ranging from insurance (Geico) to fast food (Dairy Queen Inc.), saw its market capitalization reach $905 billion, with class B stock climbing 2% in premarket trading.\nIts share price has increased by 17% since the year’s start, positioning Berkshire Hathaway to join the ranks of tech giants like Microsoft Corp. and Apple Inc., alongside other behemoths such as Saudi Arabian Oil Group (Aramco) and Amazon.com Inc. in the trillion-dollar market cap sphere.\nDuring a 2010 interview with CNBC’s Becky Quick Buffett shed light on what he considers his most regrettable investment decision: acquiring Berkshire Hathaway. Initially, Buffett was drawn to the company, a declining textile manufacturer, for its practice of buying back its own stock using proceeds from the sale of its mills. Seeing an opportunity, Buffett began purchasing shares, planning to sell them back to the company at a profit.\nTrending: Fortnite’s creator company greenlights partial ownership for up to 100 accredited investors in the upcoming series.\nThe critical turn of events occurred in 1964 when, after agreeing to tender his stock at $11.50 per share, Buffett received an offer at $11.375 per share. Feeling slighted by this lower offer, he reacted by buying more stock, eventually taking control of the company and dismissing the then-CEO Seabury Stanton. This decision led to Buffett’s extensive investment in a failing industry, which he later recognized as a significant error.\nAt the time of the interview, Berkshire Hathaway’s valuation stood at approximately $200 billion. Buffett humorously remarked, \"And — so there you have it, the story of — a $200 billion — incidentally, if you come back in 10 years, I may have one that's even worse.\"\nThis comment reflects the magnitude of the missed opportunity; Buffett believed that had he initially steered his investment toward the insurance sector rather than the textile industry, Berkshire Hathaway’s worth could have been double its existing value. He underscored the lesson learned from this experience, saying, \"If you get in a lousy business, get out of it\" and highlighting the importance of recognizing and rectifying investment mistakes to avoid substantial financial losses.\nBuffett's ability to transform a struggling textile business into a near trillion-dollar conglomerate is a testament to his strategic foresight and managerial acumen. As Berkshire Hathaway continues to thrive, Buffett’s legacy as one of the world’s most astute investors remains intact, serving as a beacon for investors worldwide.\nRead Next: \nCopy and paste Mark Cuban’s startup investment strategy according to his colorful portfolio.\nDiscover why high-profile names like Leonard Dicaprio are turning to diamond assets and how you can get involved with just $100.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Warren Buffett's Berkshire Hathaway Nears $1 Trillion Market Capitalization, But He Refers To It As 'The Dumbest Stock I Ever Bought' — It Could Have Been Worth Twice As Much Today If He Had Cut His Losses Sooner originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-02-16T18:02:08.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Acquires New Stake in Liberty Media Corp Junk",
        "Author": "  GuruFocus Research ",
        "Text": "Warren Buffett (Trades, Portfolio)'s investment firm, Berkshire Hathaway, has recently expanded its portfolio by purchasing a new holding in Liberty Media Corp Junk (NASDAQ:LLYVA). On August 3, 2023, the firm acquired 5,051,918 shares in the media conglomerate. This transaction marks a new investment avenue for Berkshire Hathaway, although the trade impact on the portfolio and the trade price data are currently not applicable.\nWarren Buffett (Trades, Portfolio), often referred to as \"The Oracle of Omaha,\" is a towering figure in the investment world. His firm, Berkshire Hathaway, is a testament to his investment acumen, having evolved from a textile company into a colossal insurance and investment conglomerate. Buffett's value investing strategy, influenced by his mentor Benjamin Graham, emphasizes understanding a business, investing with a margin of safety, and choosing companies with favorable long-term prospects. Berkshire Hathaway's portfolio includes significant stakes in major companies across various sectors, with top holdings such as Apple Inc (NASDAQ:AAPL), American Express Co (NYSE:AXP), and Coca-Cola Co (NYSE:KO), showcasing the firm's diverse and strategic investments.\nLiberty Media Corp Junk, with the stock symbol LLYVA, operates within the diversified media industry in the United States. Since its IPO on August 4, 2023, the company has been involved in managing investments in Live Nation and other media-related assets. Despite the lack of sufficient data to evaluate the company's GF Value, Liberty Media Corp Junk has a market capitalization of $3.42 billion and a current stock price of $36.34. However, the stock's GF Score stands at a low 18 out of 100, indicating potential challenges in future performance.\nThe designation of \"New Holdings\" signifies that Berkshire Hathaway has initiated a position in Liberty Media Corp Junk for the first time. Given the absence of trade impact and price data, it is challenging to assess the immediate influence of this transaction on the stock's performance or Berkshire Hathaway's portfolio. However, the firm's decision to invest in Liberty Media Corp Junk could be indicative of Buffett's confidence in the company's long-term value proposition.\nBerkshire Hathaway's equity portfolio is valued at $347.36 billion, with a strong presence in the technology and financial services sectors. The addition of Liberty Media Corp Junk to its portfolio diversifies its investments further into the media industry. Although the new holding's position size is not disclosed, it represents a strategic move within Berkshire Hathaway's broad investment landscape.\nLiberty Media Corp Junk's stock has seen a price increase of 3.98% since its IPO, with a year-to-date change of 1.74%. However, the company's PE percentage is not applicable, indicating that it is currently not profitable. The lack of data on the GF Valuation and other ranking metrics such as Financial Strength, Profitability Rank, and Growth Rank, suggests that investors may need to rely on future performance and strategic developments for valuation insights.\nAside from Berkshire Hathaway, other prominent investors such as Seth Klarman (Trades, Portfolio), Tom Gayner (Trades, Portfolio), and Wallace Weitz (Trades, Portfolio) have also taken positions in Liberty Media Corp Junk. The comparison of their stakes with that of Berkshire Hathaway could provide a broader perspective on the stock's appeal to value investors.\nIn summary, Warren Buffett (Trades, Portfolio)'s Berkshire Hathaway has made a notable entry into Liberty Media Corp Junk, reflecting a potential strategic interest in the media sector. While the immediate impact of this transaction is not quantifiable due to the lack of trade impact and price data, the investment firm's track record suggests a calculated move based on long-term value. As the company's financial and performance metrics evolve, investors will be watching closely to understand the implications of this new holding within Berkshire Hathaway's diverse and influential portfolio.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-20T10:45:00.000Z",
        "Title": "Warren Buffett Has 51% of Berkshire Hathaway's $370 Billion Portfolio Invested in 2 Stocks",
        "Author": "  Trevor Jennewine, The Motley Fool ",
        "Text": "Warren Buffett took control of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) in 1965. Since then, his value-oriented investment philosophy has helped the company grow at an astonishing pace, with Berkshire shares compounding twice as fast as shares of the S&P 500. The company is currently worth $780 billion, and a substantial portion of that value comes from its $370 billion stock portfolio.\nBuffett and his co-investment managers have 51% of that total spread across two stocks: Apple (NASDAQ: AAPL) is the largest holding at 45% of the portfolio, and Coca-Cola (NYSE: KO) is the fourth-largest holding at 6.4% of the portfolio. That asset allocation is a clear sign of confidence.\nDoes that mean the stocks are worth buying?\nApple dominates the global smartphone market in terms of revenue and profits, but last year (for the first time) it displaced Samsung as the leader in smartphone shipments. Apple is also the market leader in tablets, smartwatches, and personal audio devices (think AirPods), and the fourth-largest personal computer vendor by shipments. That success is a product of brand authority.\nApple pairs appealing hardware with patented software to create an enjoyable user experience that becomes increasingly compelling with additional devices. The company also designs its own chips, which extends its ability to control costs and create a differentiated user experience. Ultimately, consumers are willing to pay a premium for Apple products. The average iPhone costs twice as much as the average Android smartphone, according to Insider Intelligence.\nOn the whole, Apple performed well in the first quarter (ended Dec. 30, 2023), beating expectations on the top and bottom lines. Revenue increased 2% to $119.5 billion as iPhone sales rose 6% and services revenue rose 11%. Meanwhile, GAAP net income increased 16% to $2.18 per diluted share. That was due to stock buybacks and a 290-basis-point expansion in gross margin driven by strong growth in services. To elaborate, services earn higher margins than hardware, so Apple becomes more profitable when services revenue outpaces total revenue.\nHowever, there was one important blemish in the first-quarter report. Sales in China declined 13%, fueling concern that Apple is struggling with competition. Indeed, Huawei and Xiaomi reported more robust smartphone sales and Apple lost market share in the region last year, according to Jeffries. Investors should monitor the situation closely. China represents nearly one-fifth of Apple's total revenue.\nGoing forward, Wall Street expects Apple to grow earnings at 8.6% annually. That consensus estimate makes its current valuation of 28.6 times earnings look expensive. Personally, I would avoid this stock at its current price and wait for a much cheaper entry point. But Warren Buffett may disagree.\nCoca-Cola is the largest nonalcoholic beverage company in the world. It is best known for carbonated soft drink (CSD) brands like Diet Coke, Fanta, and Sprite, not to mention its namesake Coca-Cola. The company dominates the CSD market in virtually every geographic region, and it has actually gained share in recent years. But Coca-Cola also has a strong presence in other corners of the nonalcoholic beverage market.\nSpecifically, its portfolio includes popular brands like Costa coffee, Dasani water, Minute Maid juices, and Powerade sports drinks. The company also earns fees from its distribution agreement with leading energy drink brand Monster Beverage. In the future, Coca-Cola has room to grow its CSD business, especially in emerging markets, but the company has a more substantial opportunity to gain share in other categories.\nCoca-Cola reported solid financial results in the fourth quarter (ended Dec. 31, 2023). Revenue rose 7% to $10.8 billion on pricing power and a modest increase in case volume. Growth was particularly strong in emerging markets across Latin America and the Asia Pacific, an encouraging sign given the long-term opportunity there. Meanwhile, non-GAAP net income increased 10% to $0.49 per share as the company achieved a 180-basis-point expansion in non-GAAP operating margin.\nGoing forward, management expects revenue to grow between 4% annually and 6% annually over the long-term, while earnings per share increase between 7% annually and 9% annually. In that context, its current valuation of 24 times earnings falls somewhere between reasonable and expensive.\nFrom that starting point, I'm not convinced Coca-Cola can beat the market over an extended period. The stock underperformed over the last three, five, and 10 years. But income investors willing to trade outperformance for a reliable dividend should consider buying the stock. Coca-Cola has increased its dividend for 62 consecutive years, meaning it is part of an elite group known as dividend kings.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, and Monster Beverage. The Motley Fool has a disclosure policy.\nWarren Buffett Has 51% of Berkshire Hathaway's $370 Billion Portfolio Invested in 2 Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-12T11:02:00.000Z",
        "Title": "Meet the Most Ridiculously Cheap Stock in Warren Buffett's Berkshire Hathaway Portfolio",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "Warren Buffett studied under Benjamin Graham, the father of value investing. Even though he's not as much a purist as he was in the past, Buffett remains a value investor at heart.\nIt's not surprising, therefore, that his Berkshire Hathaway portfolio includes quite a few stocks with attractive valuations. But one of them stands out more than any. Meet the most ridiculously cheap stock in Buffett's Berkshire Hathaway portfolio.\nDialysis provider DaVita (NYSE: DVA) is the cheapest of the cheap among Buffett's stocks on one key valuation metric. Its price-to-earnings-to-growth (PEG) ratio is only 0.45.\nTo be sure, Buffett owns other stocks with lower forward price-to-earnings ratios than DaVita's multiple of nearly 12.4x. For example, Ally Financial trades at close to 8.9 times forward earnings. Hewlett Packard is even more inexpensive with its forward P/E of a little over 8x. However, the PEG ratios of these stocks are well above DaVita's.\nThere are also a handful of stocks in Berkshire's portfolio with lower forward P/E multiples than DaVita for which financial technology and data company LSEG, formerly known as Refinitiv, doesn't currently have PEG values. I excluded those stocks from contention.\nWhy do I like the PEG ratio so much? It incorporates companies' growth prospects. LSEG's PEG ratios factor in five years of projected growth. Granted, analysts' growth expectations could be way off. However, using the PEG ratio helps weed out stocks that have low valuations based on their near-term growth but are more expensive looking farther into the future.\nWhy is DaVita's valuation so low? It's not because the stock has performed poorly. DaVita's share price has jumped more than 30% over the last 12 months. That's well above the gains delivered by the S&P 500 during the same period.\nIt's not because healthcare stocks, in general, are especially cheap, either. The average forward P/E for the healthcare sector is 19x, not much lower than the forward earnings multiple of nearly 20.8x for the overall S&P 500. (I used forward P/E values for comparison in this case, by the way, because PEGs by sector weren't available.)\nThe primary reason behind DaVita's low PEG ratio is that Wall Street expects strong average earnings growth of more than 18% annually from the company over the next five years. In the U.S., kidney disease is the fastest-growing non-infectious disease. This is driving demand for dialysis services.\nBut what about the potential for drugs such as Ozempic, Wegovy, Mounjaro, and Zepbound to slow the dialysis growth rate? That could perhaps occur over a long period of time -- 15 to 20 years or more. However, DaVita projects a minimal impact on dialysis growth over the next 10 years.\nI think that many value investors will like DaVita. Even if analysts' growth projections are overly optimistic, the stock does appear to be trading at a discount. Income investors will have to look elsewhere, though. DaVita doesn't currently offer a dividend.\nSome growth investors might be tempted to scoop up shares of DaVita. The overall trends related to kidney dialysis over the next decade seem to be favorable. My view, however, is that there are plenty of other stocks that offer even more compelling growth prospects.\nBuffett seems to agree. He's bought several stocks in recent years, but the last time he added to Berkshire's stake in DaVita was way back in 2014.\nShould you invest $1,000 in DaVita right now?\nBefore you buy stock in DaVita, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and DaVita wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nAlly is an advertising partner of The Ascent, a Motley Fool company. Keith Speights has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway and HP. The Motley Fool has a disclosure policy.\nMeet the Most Ridiculously Cheap Stock in Warren Buffett's Berkshire Hathaway Portfolio was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-27T05:01:44.000Z",
        "Title": "Beyond the Balance Sheet: What SWOT Reveals About Berkshire Hathaway Inc (BRK.A)",
        "Author": "  GuruFocus Research ",
        "Text": "Strengths: Robust Insurance Operations and Decentralized Management\nWeaknesses: Key Person Dependency and Concentrated Investments\nOpportunities: Expansion of Non-Insurance Businesses and Technological Advancements\nThreats: Geopolitical Risks and Intense Market Competition\nOn February 26, 2024, Berkshire Hathaway Inc (NYSE:BRK.A) filed its annual 10-K report, revealing a diverse conglomerate with significant operations in insurance, freight rail transportation, utilities, energy, and manufacturing. With a market value of $625.5 billion as of mid-2023, Berkshire Hathaway's financial health remains robust, supported by a decentralized management structure and a strong emphasis on ethical business conduct. The company's insurance segment, led by GEICO, continues to be a major contributor to its success, with a market share of approximately 13.8% in the private passenger automobile insurance sector. Despite the challenges posed by geopolitical events and reliance on key individuals, Berkshire Hathaway's strategic investments and commitment to operational excellence position it well for future growth.\nWarning! GuruFocus has detected 6 Warning Signs with BRK.A.\nDiversified Business Model and Strong Insurance Operations: Berkshire Hathaway Inc (NYSE:BRK.A) boasts a diversified portfolio of businesses, with its insurance operations serving as the cornerstone. The company's insurance subsidiaries, including GEICO, Berkshire Hathaway Reinsurance Group, and Berkshire Hathaway Primary Group, provide a stable source of revenue and \"float\" the funds available for investment before claims are paid. This float provides Berkshire with a significant advantage, allowing it to invest in a variety of assets and businesses, fueling further growth. The acquisition of Alleghany Corporation in 2022 has further strengthened its insurance and reinsurance capabilities, adding to the company's robust financial foundation.\nDecentralized Management and Strong Corporate Governance: Berkshire Hathaway's decentralized management approach empowers individual subsidiaries to operate independently, fostering an entrepreneurial spirit and swift decision-making. This structure has enabled the company to maintain a lean corporate overhead and adapt quickly to changing market conditions. Additionally, Berkshire's strong corporate governance, with a focus on ethical behavior and compliance, has earned it a reputation for integrity and reliability among investors and within the industries it operates.\nDependence on Key Executives: The company's success is closely tied to the investment acumen and leadership of Warren E. Buffett, whose unique vision and capital allocation strategies have been pivotal. However, at 93 years old, the question of succession poses a potential risk. While the Board of Directors has identified Gregory Abel as the successor, any transition may lead to uncertainty and could impact investor confidence and the company's strategic direction.\nConcentrated Investment Portfolio: Berkshire Hathaway's investment strategy involves a high concentration in a select number of equity securities, which exposes the company to market volatility. A significant decline in the value of these investments could adversely affect the company's earnings and shareholders' equity. This concentration risk is compounded by the fact that a large portion of these investments is held by insurance subsidiaries, which are subject to stringent regulatory capital requirements.\nExpansion of Non-Insurance Businesses: Berkshire Hathaway's non-insurance businesses, including its energy and utility operations, manufacturing, and service companies, offer significant growth potential. The company's ability to leverage its strong balance sheet to make strategic acquisitions, as seen with the purchase of Alleghany, positions it to capitalize on opportunities across various sectors and geographies.\nTechnological Advancements and Innovation: As technology continues to disrupt traditional business models, Berkshire Hathaway has the opportunity to invest in emerging technologies and innovative companies. By staying abreast of technological trends and adapting its business practices, the company can enhance its competitive edge and explore new revenue streams.\nGeopolitical Risks and Regulatory Changes: Berkshire Hathaway operates in a global environment where geopolitical events, such as trade disputes and Brexit, can impact its operations. Regulatory changes, particularly in the insurance industry, can also pose challenges. The company must navigate these risks carefully to maintain its profitability and operational efficiency.\nIntense Competition and Market Disruption: The company faces intense competition across its diverse business segments. In the insurance sector, competitors like State Farm, Allstate, Progressive, and USAA are vying for market share, while technological advancements could disrupt established business models. Berkshire Hathaway must continue to innovate and adapt to remain competitive in this dynamic landscape.\nIn conclusion, Berkshire Hathaway Inc (NYSE:BRK.A) stands as a testament to the power of a diversified business model, strong corporate governance, and strategic investment. Its strengths in the insurance sector and decentralized management approach provide a solid foundation for growth. However, the company must address its reliance on key executives and the risks associated with a concentrated investment portfolio. Opportunities for expansion and technological innovation present exciting prospects, while geopolitical risks and intense competition pose significant challenges. As Berkshire Hathaway navigates these dynamics, it remains a formidable player in the global marketplace, poised to capitalize on its strategic advantages and mitigate its vulnerabilities.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-26T10:32:24.000Z",
        "Title": "Berkshire Hathaway Full Year 2023 Earnings: EPS: US$66,412 (vs US$15,494 loss in FY 2022)",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Revenue: US$364.5b (up 21% from FY 2022).\nNet income: US$96.2b (up from US$22.8b loss in FY 2022).\nProfit margin: 26% (up from net loss in FY 2022). The move to profitability was primarily driven by higher revenue.\nEPS: US$66,412 (up from US$15,494 loss in FY 2022).\nAll figures shown in the chart above are for the trailing 12 month (TTM) period\nLooking ahead, revenue is expected to decline by 2.0% p.a. on average during the next 2 years, while revenues in the Diversified Financial industry in the US are expected to grow by 4.0%.\nPerformance of the American Diversified Financial industry.\nThe company's shares are up 3.1% from a week ago.\nJust as investors must consider earnings, it is also important to take into account the strength of a company's balance sheet. We've done some analysis and you can see our take on Berkshire Hathaway's balance sheet.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-09T22:31:00.000Z",
        "Title": "Berkshire Hathaway Stock Hits New Highs: What Does it Mean?",
        "Author": "  Tracey Ryniec ",
        "Text": "(0:30) - Should You Be Adding Berkshire Hathaway To Your Portfolio As It Hits All-Time Highs?\n(5:55) - Breaking Down The Performance of The Berkshire Hathaway Stock: What Is Pushing It Higher?\n(21:10) - Episode Roundup: BRK.B, CVX, OXY, UNP, FAST, SHW\n Podcast@Zacks.com\n \nWelcome to Episode #357 of the Value Investor Podcast.\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nGrowth stocks are breaking out again in 2024, especially technology companies involved in AI and big pharmaceuticals which are making weight loss drugs.\nBut while many are arguing that it is ONLY big tech that is hitting multiple new highs, there are others outside of tech doing it too including Chipotle, Deckers and the ultimate in old economy companies, Warren Buffett’s Berkshire Hathaway.\nBerkshire Hathaway at New Highs\nBerkshire Hathaway (BRK.B)has a big position in Apple. It’s over 50% of the company’s equity portfolio. But that doesn’t make it a technology company.\nMost of Berkshire Hathaway’s actual company holdings are old economy type companies like Geico Insurance, See’s Candies, and BNSF Railway, one of the largest railroads in the United States.\nYet, it’s making new all-time highs. Shares of Berkshire Hathaway are up 11.5% year-to-date and have gained 29% over the last year, which is easily beating the S&P 500, Buffett’s benchmark, up just 22%.\nShares are not cheap though. Berkshire Hathaway trades with a forward P/E of 21.7 but it does have a P/B ratio of just 1.6. A P/B ratio under 3.0 usually indicates value.\nWhat is a record high in Berkshire Hathaway saying about the rest of the stock market?\nThe old economy isn’t dead yet.\n4 Old Economy Stocks for 2024\n1.       Chevron Corp. (CVX)\nChevron is a large energy company with a market cap of $280 billion. It’s currently a Zacks Rank #5 (Strong Sell) as earnings estimates are being cut on lower oil prices. Earnings of Chevron are expected to fall 0.8% in 2024.\nChevron shares are down 9.4% over the last year. It’s cheap with a forward P/E of 11.7. Chevron pays a dividend, currently yielding 4%. Chevron is also a top 5 holding in Berkshire Hathaway’s equity portfolio.\nShould investors be considering Chevron for an old economy portfolio?\n2.       Occidental Petroleum (OXY)\nBerkshire Hathaway continues to buy more shares of Occidental Petroleum in 2024 as the shares have sunk. Occidental Petroleum, a large energy producer, is down 9.2% over the last year.\nShares of Occidental Petroleum have gotten cheaper. It is trading with a forward P/E of 13.2. Occidental Petroleum pays a dividend, yielding 1.5%.\nShould investors be buying Occidental Petroleum because Berkshire is?\n3.       Union Pacific Corp. (UNP)\nUnion Pacific is one of the largest railroads in the United States. Shares of Union Pacific are hitting new 52-week highs in 2024, up 20.2% over the last year.\nIt’s not cheap. Union Pacific trades with a forward P/E of 22.8. Earnings are expected to grow 4.9% in 2024 and another 11% in 2025.\nShould a railroad like Union Pacific be on your short list?\n4.       Fastenal Co. (FAST)\nFastenal is in two old economy industries: manufacturing and construction. But shares of Fastenal are up 31.5% over the last year, easily beating the S&P 500 return of 22.1%. It’s also been making new all-time highs in 2024.\nFastenal is pricey on a P/E basis, however. It trades with a forward P/E of 32.4. Earnings are expected to rise 6.4% in 2024.\nIs Fastenal too hot to handle in 2024?\nWhat Else Do You Need to Know About Old Economy Stocks?      \nTune into this week’s podcast to find out.\n[In full disclosure, Tracey owns shares of CVX in her own personal portfolio.]\n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nFastenal Company (FAST) : Free Stock Analysis Report\nUnion Pacific Corporation (UNP) : Free Stock Analysis Report\nOccidental Petroleum Corporation (OXY) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-21T13:45:00.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Buys More Chevron Stock. Should You?",
        "Author": "  Daniel Foelber, The Motley Fool ",
        "Text": "Last week, Berkshire Hathaway filed its 13F report for the end of 2023. Berkshire's 14.4% increase in its Chevron (NYSE: CVX) position was the standout move. With 126.09 million shares held, Berkshire has a Chevron stake worth over $19 billion -- its fifth-largest public equity holding.\nHere's what you need to know about Berkshire's Chevron stake, how it relates to other moves, and whether the dividend stock is worth buying now.\nEven since Berkshire opened a stake in the fourth quarter of 2020, its Chevron position has arguably been its most active in terms of sizable buying and selling.\nBerkshire Hathaway's Chevron Shares\nFile Date\nHoldings as of This Date\n126.09 million\nFeb. 14, 2024\nDec. 31, 2023\n110.25 million\nNov. 16, 2023\nSept. 30, 2023\n123.12 million\nAug. 14, 2023\nJune 30, 2023\n132.41 million\nMay 15, 2023\nMarch 31, 2023\n162.98 million\nFeb. 14, 2023\nDec. 31, 2022\n165.36 million\nNov. 14, 2022\nSept. 30, 2022\n161.44 million\nAug. 15, 2022\nJune 30, 2022\n159.18 million\nMay 16, 2022\nMarch 31, 2022\n38.25 million\nFeb. 14, 2022\nDec. 31, 2021\n28.70 million\nNov. 15, 2021\nSept. 30, 2021\n23.12 million\nAug.16, 2021\nJune 30, 2021\n23.67 million\nMay 17, 2021\nMarch 31, 2021\n48.5 million\nFeb. 16, 2021\nDec. 31, 2020\n0\nNov. 16, 2020\nSept. 30, 2020\nData source: Berkshire Hathaway SEC Filings.\nThe real acceleration in buying occurred in the first quarter of 2022, undoubtedly in response to Russia's invasion of Ukraine and geopolitical tensions. But Berkshire cut its Chevron stake every quarter between the fourth quarter of 2022 and the third quarter of 2023. All told, the position was reduced by exactly one-third in that time period.\nThe 2023 fourth-quarter purchase of 15.85 million Chevron shares breaks the selling trend. When Berkshire first entered Chevron, it looked more like a value play. And when it loaded up on Chevron in 2022, it resembled more of a trade than a true long-term investment. I think Buffett and his team are trying to find a balance of what allocation makes sense for Chevron in the long term.\nBerkshire's purchase in the 2023 fourth quarter is a stamp of approval on Chevron's $53 billion merger with Hess, which was announced on Oct. 23. This is a big vote of confidence for Chevron investors and oil and gas investors in general because it shows that the Oracle of Omaha likely supports the wave of consolidation that is sweeping the oil and gas industry.\nThis idea is further supported by Berkshire's Occidental Petroleum (NYSE: OXY) stock moves. Between Feb. 1 and Feb. 5, Berkshire bought 4.3 million shares of Occidental Petroleum, a 1.8% increase. Oxy is now Berkshire's sixth-largest public equity holding and is valued at $14.2 billion. But Berkshire owns 28.3% of Oxy and 6.8% of Chevron, since Oxy is a far smaller company.\nOxy also announced a sizable acquisition in the fourth quarter with intentions to buy Permian Basin producer CrownRock.\nBerkshire has been buying Occidental Petroleum stock consistently for a while now. So that move alone wouldn't have necessarily verified that Berkshire approves of oil and gas mergers and acquisitions. However, the decision to reverse the selling trend with Chevron by making a sizable purchase paired with more Oxy stock purchases is a clearer sign that Berkshire views the energy sector as an excellent value play and supports consolidation.\nOutside of the usual repurchasing of Berkshire Hathaway stock, buying a boatload of Apple stock from 2016 and 2018 (and then selling some in 2020), and then the moves with Chevron and Occidental Petroleum, Berkshire has not made any other sizable changes to its public equity portfolio.\nThis tells me that Berkshire doesn't see better values out there than Apple -- which Buffett has praised as an elite business -- and the energy sector, which remains a steep discount to the market. Oxy trades at a mere 12.5 price-to-earnings (P/E) ratio, while Chevron trades at a 13.3 P/E. Meanwhile, the S&P 500 P/E ratio is 27.1.\nDealing with P/E ratios for oil and gas stocks is a bit tricky. If oil and gas prices crash, then earnings will plummet or could even be negative, as we saw in 2020. A better question is whether the business can improve and do well even at lower oil prices.\nChevron's blowout 2023 earnings proved that the company can do extremely well when Brent crude is around $80 per barrel. The company was able to use operating cash flow for a sizable capital expenditure program and record buybacks and dividends, including boosting its dividend by 8%. So that's what investors can expect from Chevron at $80 Brent crude. The merger with Hess will boost cash flow even further.\nOn its fourth-quarter earnings call, Chevron said it can cover its capital expenditures and dividend with Brent crude in the low $50 range. It would probably eliminate buybacks in that environment. But still, Chevron could fund a massive dividend program and invest in its long-term growth even if oil prices fell significantly.\nThe company reduced its outstanding share count by nearly 5% last year. Given the size of the Hess merger, Chevron will likely pull back on stock repurchases in the short term. But overall, it is incredibly committed to buybacks, which Berkshire loves.\nChevron's ability to invest in its long-term growth, grow its dividend, and buy back a ton of stock when oil prices are around their current levels are key parts of the energy company's investment thesis and is likely a big reason why Berkshire likes the stock.\nMirroring the trades of even the greatest investors isn't necessarily a good idea because their motives, position history, and structure are so different than an individual's. But tracking Berkshire Hathaway's moves could be useful to get a feel for Buffett and his team's opinions on the market.\nThe real insight won't come until May 4, when Berkshire holds its annual meeting. But for now, I think it gave investors a very clear sign that energy is the preferred sector for value, especially considering that the company trimmed its Apple position in the fourth quarter while adding to Chevron.\nBarring a 30% or steeper decline in oil prices, Chevron will have a good year. If oil prices stay even remotely around where they are today, it will have an excellent year. If they rally, the company could have a near-record year.\nGiven its valuation, the risk/potential reward for Chevron stock makes a lot of sense right now. The 4.1% dividend yield is a sizable incentive to buy and hold these shares over time.\nShould you invest $1,000 in Chevron right now?\nBefore you buy stock in Chevron, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chevron wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 20, 2024\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett's Berkshire Hathaway Buys More Chevron Stock. Should You? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-24T14:53:56.000Z",
        "Title": "Warren Buffett: Charlie Munger was the 'architect' of the modern Berkshire Hathaway",
        "Author": " Myles Udland    · Head of News",
        "Text": "Warren Buffett's annual letter to Berkshire Hathaway (BRK-A, BRK-B) shareholders published Saturday morning marked the first missive sent to his investors since his longtime right-hand man, Charlie Munger, died last November at 99 years old.\nTo begin his letter to Berkshire shareholders, Buffett reminded readers of the role Munger played in creating what is now the country's largest conglomerate. A conglomerate, Buffett wrote Saturday, that has \"by far...the largest GAAP net worth recorded by any American business.\"\n\"In reality, Charlie was the 'architect' of the present Berkshire, and I acted as the 'general contractor' to carry out the day-by-day construction of his vision,\" Buffett wrote.\n\"Charlie never sought to take credit for his role as creator but instead let me take the bows and receive the accolades. In a way his relationship with me was part older brother, part loving father. Even when he knew he was right, he gave me the reins, and when I blundered he never — never — reminded me of my mistake.\"\n\"In the physical world, great buildings are linked to their architect while those who had poured the concrete or installed the windows are soon forgotten,\" Buffett wrote.\n\"Berkshire has become a great company. Though I have long been in charge of the construction crew; Charlie should forever be credited with being the architect.\"\nBuffett and Munger both grew up in Omaha, where Berkshire is still headquartered. The two, however, didn't meet until 1959, when Buffett was 29 and Munger 35.\nA lawyer by trade and a founding partner at the law firm Munger, Tolles, & Olson which bears his name, Munger was named vice chairman at Berkshire Hathaway in the late '70s.\nBut Munger and Buffett's investing relationship began long before this formal engagement, with Buffett writing Saturday it was Munger who told him in 1962, \"that I had made a dumb decision in buying control of Berkshire.\"\nAt the time, Berkshire Hathaway was a struggling textile manufacturer in New England. Textile operations later ended, but the Berkshire Hathaway of today still bears the company's name.\nBuffett wrote Saturday that, \"Charlie, in 1965, promptly advised me: 'Warren, forget about ever buying another company like Berkshire. But now that you control Berkshire, add to it wonderful businesses purchased at fair prices and give up buying fair businesses at wonderful prices. In other words, abandon everything you learned from your hero, Ben Graham. It works but only when practiced at small scale.' With much back-sliding I subsequently followed his instructions.\"\nElsewhere in his letter to shareholders, Buffett wrote, \"Our goal at Berkshire is simple: We want to own either all or a portion of businesses that enjoy good economics that are fundamental and enduring.\"\nBut Buffett noted the advice from Munger offered nearly 60 years ago to only buy \"wonderful businesses purchased at fair prices\" means the days Buffett and Berkshire Hathaway had plenty of investment opportunities to choose from are \"long behind us.\"\n\"This combination of the two necessities I've described for acquiring businesses has for long been our goal in purchases and, for a while, we had an abundance of candidates to evaluate,\" Buffett wrote.\n\"If I missed one — and I missed plenty — another always came along. Those days are long behind us; size did us in, though increased competition for purchases was also a factor.\"\nBerkshire purchased insurance company Alleghany for $11.6 billion in 2022 and took full control of rest stop operator Pilot earlier this year. Prior to these deals, the company hadn't made a sizable acquisition since its 2015 purchase of Precision Castparts for $37 billion.\n\"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others,\" Buffett continued.\n\"Some we can value; some we can't. And, if we can, they have to be attractively priced. Outside the U.S., there are essentially no candidates that are meaningful options for capital deployment at Berkshire. All in all, we have no possibility of eye-popping performance.\"\nBuffett also touched on the struggles at Berkshire's railroad and utilities businesses in 2023, with the latter serving as a \"severe earnings disappointment last year.\"\nIn Buffett's view, a shifting regulatory outlook in some states has \"broken\" a model that relied on private investment backed by what Buffett called a \"fixed-but-satisfactory-return\" for these operators. Agreements were made on a state-by-state basis.\n\"Whatever the case at Berkshire, the final result for the utility industry may be ominous: Certain utilities might no longer attract the savings of American citizens and will be forced to adopt the public-power model,\" Buffett wrote. \"Nebraska made this choice in the 1930s and there are many public-power operations throughout the country. Eventually, voters, taxpayers and users will decide which model they prefer.\n\"When the dust settles, America’s power needs and the consequent capital expenditure will be staggering. I did not anticipate or even consider the adverse developments in regulatory returns and, along with Berkshire’s two partners at BHE, I made a costly mistake in not doing so.\"\nAs he does most years, Buffett also took extensive time in this year's letter to write about his overarching investment philosophy and how it impacts the current iteration of Berkshire Hathaway.\nFor aspiring investors looking to Buffett for insights on how to manage their own portfolios, these passages are the main draw.\nThe modern Berkshire Hathaway, in Buffett's view, is built to both protect against and take advantage of the inevitable seizures and panics that have, and will again, gripped markets.\n\"Indeed, markets can — and will — unpredictably seize up or even vanish as they did for four months in 1914 and for a few days in 2001,\" Buffett wrote. \"If you believe that American investors are now more stable than in the past, think back to September 2008. Speed of communication and the wonders of technology facilitate instant worldwide paralysis, and we have come a long way since smoke signals. Such instant panics won't happen often — but they will happen.\"\nIn turn, Berkshire holds a pile of cash and highly-liquid Treasury bills that Buffett called \"far in excess of what conventional wisdom deems necessary.\"\nBerkshire also does not pay dividends — a preordained cash outlay for companies — and makes no commitment on the size of any future stock buybacks. Buffett runs Berkshire Hathaway in a manner that keeps cash on hand for the sake of keeping cash on hand, not for some planned future deployment.\n\"During the 2008 panic, Berkshire generated cash from operations and did not rely in any manner on commercial paper, bank lines or debt markets,\" Buffett wrote. \"We did not predict the time of an economic paralysis but we were always prepared for one.\n\"Extreme fiscal conservatism is a corporate pledge we make to those who have joined us in ownership of Berkshire.\"\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-02-15T17:26:23.000Z",
        "Title": "Warren Buffett’s Berkshire Hathaway sells off some Apple stock",
        "Author": "  Nicole Goodkind, CNN ",
        "Text": "Warren Buffett’s Berkshire Hathaway sold off 10 million shares of Apple stock in the final three months of 2023, representing about 1% of its holdings in the company.\nThe tech titan has become a major holding for the Oracle of Omaha’s company and is known as one of the so-called “four giants” – alongside its insurance, railroad and energy operations – that Buffett says drives most of Berkshire’s value.\nBut the Omaha-based conglomerate announced on Wednesday it had slightly trimmed its position in Apple in a regulatory filing with the Securities and Exchange Commission.\nThe selloff is notable for Buffett, who is known to hold onto stocks for long periods of time. “If you aren’t willing to own a stock for 10 years, don’t even think about owning it for 10 minutes,” he’s said.\nBerkshire still owns more than 905 million shares of the company, worth about $174 billion. That represents 6% of all Apple shares and one-fifth of Berkshire’s entire portfolio.\nMany investors, hoping to duplicate the success of Berkshire’s portfolio, closely watch and often copy Buffett’s market moves.\nThis isn’t the first time Berkshire, which began investing in Apple in 2016, has pared back some of its holdings in the tech company.\nIn the second half of 2020, the company sold off about $11 billion worth of the stock, a move that Buffett, 93, later said was “probably a mistake,” in a shareholder meeting.\nBuffett went on to praise Apple CEO Tim Cook as “one of the best managers in the world” and last year said that the company “just happens to be a better business than any we own.”\nBerkshire Hathaway purchased an additional $31 billion in Apple shares in 2022.\nShares of Apple fell by about 1.2% in morning trading on Thursday. Shares of Berkshire Hathaway were 0.7% higher.\nApple reported earlier this month that sales grew year-on-year during the December quarter, following a streak of four consecutive quarters of revenue declines caused by slower device sales amid an uncertain economic environment. But while product sales have ticked up, revenue from the key China region slid, a sign of growing competition weighing on the iPhone maker.\nThe company’s stock is essentially flat from the start of this year.\nAs it works to right the ship, Apple has taken a bold bet and rolled out its first new product in nearly a decade: the Vision Pro mixed reality headset. The device, which cost Apple billions in research and development, is being touted by the company as the future of computing, but for now, it remains a costly and clunky piece of hardware with limited uses.\nFilings also showed that Berkshire sold 80 million shares of printer company HP in the fourth quarter of 2023, reducing its holdings by 78%. It also pared off 32% of its holdings in media company Paramount.\nBuffett’s annual letter to shareholders is due out on February 24. It will be the first letter since his long-time business partner, Charlie Munger, died last November.\nAdditional reporting by Clare Duffy\nFor more CNN news and newsletters create an account at CNN.com\n"
    },
    {
        "Date": "2024-02-19T11:45:00.000Z",
        "Title": "Nearly 50% of Warren Buffett-Led Berkshire Hathaway's $367 Billion Portfolio Is Invested in Only 1 Stock",
        "Author": "  Neil Patel, The Motley Fool ",
        "Text": "I don't think many people question that Warren Buffett is one of the greatest investors ever. He continues to prove this, as one of his biggest investments clearly demonstrates.\nBerkshire Hathaway, the conglomerate Buffett heads up, first purchased shares in Apple (NASDAQ: AAPL) in the first quarter of 2016. And since the start of that year to Feb. 14 of this year, the top FAANG stock has skyrocketed 599%. This gain crushes the Nasdaq Composite.\nLet's try to figure out what exactly about Apple, which today represents just under 46% of Berkshire's entire portfolio, first drew Buffett's attention. Then investors can decide if the stock is still a smart buy today.\nIf you look through Berkshire's numerous holdings, you'll easily find businesses that have strong brands. But there might be no other company that has greater brand recognition than Apple. I'm sure this was the case eight years ago, too.\nApple sells some of the most in-demand hardware and software on the face of the planet. The beautiful designs and ease-of-use resonate with consumers. Buffett recognized this several years ago.\nHe probably also appreciated Apple's proven pricing power. The Oracle of Omaha has even said that the top indicator of a quality business is its ability to raise its prices. Apple's hardware devices are certainly at the premium end of the spectrum, but even with consistent price increases, consumer demand remains robust.\nInvestors would struggle to find companies that are in better financial shape than Apple. In fiscal 2015, the year right before Buffett first bought the stock, it reported an operating margin of 30% and generated $70 billion of free cash flow (FCF). Fast forward to fiscal 2023, and the operating margin has remained steady. Even better, the company produced $100 billion of FCF, and it currently sits on $65 billion of net cash.\nIt wasn't as if Buffett was making a speculative bet on an unknown technology company. There were clear signs that Apple was a superior enterprise back then. Its market capitalization at the start of 2016 was around $580 billion. So, the business definitely wasn't flying under the radar, either.\nThat's why it's a shocker that during the first quarter of 2016, Apple's price-to-earnings (P/E) ratio averaged a ridiculously low 10.6. The market was presenting Buffett with a rare buying opportunity, one that he took full advantage of and that resulted in huge gains.\nApple has undoubtedly worked out as a fantastic investment, but is now a good time to buy the stock if you've been sitting on the sidelines? The characteristics I discussed above -- namely the strong brand, pricing power, and incredible profitability -- all hold true today. And I'm extremely confident that these factors will still be present a decade from now.\nBut there is one key difference between now and the time when Buffett first bought the stock. That's the valuation. Apple shares currently trade at a P/E multiple of 28.7. This is 37% higher than the stock's trailing-10-year average ratio, and it's in the stratosphere when compared to the valuation Buffett paid.\nI think investors need to be critical of the expensive valuation. It's safe to say that Apple doesn't have the same growth potential that it did when it was a much smaller company. In fact, revenue declined last fiscal year as many of its popular products reach a more mature stage of their lifecycles.\nI would be surprised if over the next five years, Apple shares outperformed the broader market. The steep P/E ratio creates a major headwind to produce strong returns going forward. So, it's best to wait for a better entry point.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nNeil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nNearly 50% of Warren Buffett-Led Berkshire Hathaway's $367 Billion Portfolio Is Invested in Only 1 Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-26T15:14:00.000Z",
        "Title": "Berkshire Hathaway (BRK.B) Q4 Earnings Rise Year Over Year",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway Inc. (BRK.B) delivered fourth-quarter 2023 operating earnings of $8.5 billion, which increased 28% year over year. The increase was driven by higher earnings in Insurance-underwriting and Insurance-investment income.\nBerkshire Hathaway Inc. price-consensus-eps-surprise-chart | Berkshire Hathaway Inc. Quote\nCosts and expenses increased 20.5% year over year to $321.1 billion, largely due to an increase in expenses at Insurance and Other as well as Railroad, Utilities and Energy. Operating earnings from the Railroad business decreased 7.7% year over year to $1.3 billion.\nRevenues increased 20.7% year over year to $364.5 billion, attributable to higher revenues at Insurance and Other, as well as Railroad, Utilities and Energy.Berkshire Hathaway’s Insurance and Other segment revenues increased 5.2% year over year to $263 billion in the reported quarter on the back of higher insurance premiums earned, leasing revenues and Interest, dividend and other investment income.Insurance underwriting after-tax earnings were $5.4 billion in 2023 against losses of $30 million in the year-ago quarter. Earnings in 2023 benefited from relatively low losses from significant catastrophe events during the year and improved underwriting results at GEICO.Railroad, Utilities and Energy operating revenues increased 94.5% year over year to $101.4 billion, attributable to higher freight rail transportation revenues, utility and energy operating revenues and service revenues and other income.Pre-tax earnings of Railroad decreased 14.2% year over year to $6.6 billion.Total revenues at Manufacturing, Service and Retailing increased 0.4% year over year to $168 billion. Pre-tax earnings increased 2.5% year over year to $16.6 billion.In 2023, earnings from the Manufacturing, Service and Retailing businesses rose 1.9% year over year.\nAs of Dec 31, 2023, consolidated shareholders’ equity was $561.3 billion, up 18.5% year over year. At quarter-end, cash and cash equivalents were $38.6 billion, up 6.2% from the level at 2022 end.Berkshire exited the fourth quarter of 2023 with a float of about $169 billion, up from $164 billion reported at the end of 2022.Cash flow from operating activities totaled $49.2 billion in 2023, up 31.7% from the year-ago period.Berkshire Hathaway bought back shares worth $9.2 billion in 2023.\nBerkshire currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nAXIS Capital Holdings Limited AXS posted fourth-quarter 2023 operating income of $2.94 per share, in contrast to the Zacks Consensus Estimate of a loss of $1.25. The bottom line increased 50.8% year over year. Total operating revenues of $1.5 billion beat the Zacks Consensus Estimate by 2.7%. The top line, however, declined 2.1% year over year on lower premiums earned. Net premiums written decreased 2% to $1.1 billion, attributable to a 51% decline in the Reinsurance segment, partially offset by a 9% increase in the Insurance segment. Our estimate was $1 billion.Net investment income improved 27.2% year over year to $187 million. Our estimate was $185.2 million. Catastrophe and weather-related losses and net of reinsurance were $25.9 million, narrower than the year-ago loss of $63.6 million. AXIS Capital incurred an underwriting loss of $274.1 million against the year-ago income of $132 million.Kinsale Capital Group KNSL delivered fourth-quarter 2023 net operating earnings of $3.87 per share, which outpaced the Zacks Consensus Estimate by 12.5%. The bottom line increased 48.8% year over year. Operating revenues jumped 41.5% year over year to about $351.2 million. Revenues beat the consensus estimate by 3.8%. Gross written premiums of $395.2 million rose 33.8% year over year, driven by strong submission flow from brokers and a favorable pricing environment. Our estimate was $372.9 million.Net written premiums climbed 26.5% year over year to $306.3 million in the quarter. Our estimate is pegged at $308.8 million. Net investment income increased 71.2% year over year to $30.4 million in the quarter and beat our estimate of $29.8 million. The Zacks Consensus Estimate was pegged at $28.7 million. Total expenses increased 34.8% year over year to $221.1 million. Our estimate was pegged at $235.6 million. Kinsale Capital’s underwriting income was $84.8 million, which grew 42.6% year over year. Our estimate was $68.6 million.Arch Capital Group Ltd. ACGL reported fourth-quarter 2023 operating income of $2.49 per share, which beat the Zacks Consensus Estimate by 28.4%. The bottom line increased 16.4% year over year. Gross premiums written improved 12% year over year to $4.3 billion. Net premiums written climbed 7.4% year over year to $3.3 billion on higher premiums written across its Insurance and Reinsurance segments as hard market rates and rising inflation drove clients’ demand for many of its property and casualty products. Our estimate for the metric was $4.9 billion.Net investment income increased 73% year over year to $313 million and beat our estimate of $303.2 million. The Zacks Consensus Estimate was pegged at $287 million. Operating revenues of $3.7 billion rose 24.5% year over year. It beat the Zacks Consensus Estimate by 0.2%. Pre-tax current accident year catastrophic losses, net of reinsurance and reinstatement premiums, were $137 million. Arch Capital’s underwriting income dropped 2.6% year over year to $715 million.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAxis Capital Holdings Limited (AXS) : Free Stock Analysis Report\nArch Capital Group Ltd. (ACGL) : Free Stock Analysis Report\nKinsale Capital Group, Inc. (KNSL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-01T12:59:00.000Z",
        "Title": "Berkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why",
        "Author": "  Collin Brantmeyer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) recently released its annual report, revealing that the conglomerate holding company held a record high of $168 billion in cash and cash equivalents at the end of 2023. With that staggering amount of cash, many investors may question how Chairman and Chief Executive Officer Warren Buffett might put it to work. Lucky for us, Buffett outlined why he is hoarding the cash in his annual letter to shareholders.\nLet's look at how Berkshire built its unprecedented cash hoard, what the company currently does with its cash, and what it might take for Buffett to deploy it meaningfully.\nBuffett's preferred metric for Berkshire's success is operating earnings -- a measurement of a company's profit from its core operations after expenses. In 2023, Berkshire generated $37.4 billion in operating earnings, an increase of 21% from $30.9 billion in 2022.\nAs a result of Berkshire's strong business performance, and being a net seller of its stock holdings in 2023, the company's cash position soared from $128.5 billion to $167.8 billion, or an increase of 31%.\nIn the near term, Buffett appears content with holding the majority of Berkshire's cash in Treasury bills -- a short-term security backed by the U.S. Treasury Department with a maturity of one year or less.\nAs of Dec. 31, Berkshire held an astounding $133.4 billion in Treasury bills, with yields in the neighborhood of 5% to 5.4%. If yields remain on the low end of that range throughout 2024 and Berkshire maintains its current position, the company will generate about $7 billion from those investments.\nIn past annual shareholder letters, Buffett has emphasized that Treasury bills serve as Berkshire's \"default\" choice for the company's cash when compelling investment opportunities are scarce, owing to their liquidity and safety.\nAdditionally, Buffett once wrote: \"Over the long term, however, [Treasury bills] are riskier investments -- far riskier investments -- than widely diversified stock portfolios that are bought over time.\" The risk Buffett is referring to isn't that the U.S. government won't pay, but that Treasury bills often lose money to inflation. That isn't the case in the short term, with the current inflation rate in the U.S. at 3.1% during the past 12 months, according to the consumer price index.\nAnother way Buffett utilizes its mountain of cash is by repurchasing shares of Berkshire Hathaway. In 2023, Berkshire spent $9.2 billion on share repurchases, lowering its shares outstanding by 1.1%. During the past 10 years, Berkshire has lowered its shares outstanding by 12.2%. By reducing its share count, Berkshire rewards existing shareholders by increasing their ownership stake.\nBerkshire could return capital to its shareholders through dividends, but that route seems unlikely, considering the company has never paid one during Buffett's tenure.\nOtherwise, Berkshire could continue to make acquisitions -- it bought insurer Alleghany Corporation for about $11.6 billion in 2022, and it recently purchased the final 20% ownership interest in the travel center network Pilot Flying J for a total investment of roughly $13.6 billion.\nBerkshire also holds a portfolio of stocks estimated to be worth $372 billion, including a $165 billion stake in Apple, and can continue to add to it with its mountain of cash.\nOne downside Berkshire faces, given its market capitalization of nearly $900 billion, is that Buffett may struggle to find stocks worth buying that will make a meaningful return. Buffett touched on this point in his most recent annual shareholder letter: \"Given Berkshire's present size, building positions through open-market purchases takes a lot of patience and an extended period of \"friendly\" prices. The process is like turning a battleship. That is an important disadvantage which we did not face in our early days at Berkshire.\"\nDespite having a mountain of cash at his disposal, Warren Buffett is unlikely to deploy the majority of it any time soon. In part, that's because, as an insurance company, Berkshire will always need a cash reserve in the event of catastrophic losses. The company's float, or premiums that its insurance customers paid upfront, can be used for investments, but it is also needed to settle claims. To that effect, Buffett has frequently stated that Berkshire will never hold less than $30 billion in cash and cash equivalents.\nIn addition, Buffett does not want to see his beloved company fall victim to an economic crisis similar to the Great Recession in 2008. The Oracle of Omaha recently explained his stance on Berkshire's current cash position:\nExtreme fiscal conservatism is a corporate pledge we make to those who have joined us in ownership of Berkshire. In most years -- indeed in most decades -- our caution will likely prove to be unneeded behavior -- akin to an insurance policy on a fortress-like building thought to be fireproof. But Berkshire does not want to inflict permanent financial damage.\nBerkshire Hathaway has generated an incredible compound annual gain of 19.8% from 1965, when Buffett took control, to 2023, significantly outpacing the S&P 500's compound annual gain of 10.2%. While Berkshire's growth prospects may be limited in some regards, there is simply no other public company in the market as well-positioned for a market downturn. That alone makes Berkshire Hathaway a solid addition to any stock portfolio.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nCollin Brantmeyer has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-12T10:01:00.000Z",
        "Title": "Warren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "While Warren Buffett hasn't seen a whole lot to like in the stock market recently, there's one stock he seemingly can't get enough of.\nOver the last couple of years, he's built up a 28% stake in Occidental Petroleum (NYSE: OXY) for Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). That makes it one of Berkshire's top holdings, just behind fellow oil and gas company Chevron (NYSE: CVX).\nThe Oracle of Omaha has added to his Occidental position on three separate occasions since the start of December. His most recent purchase for Berkshire Hathaway's portfolio amounted to about $246 million. That follows purchases of about $589 million and $312 million in December. Meanwhile, Berkshire still owns about $8.5 billion worth of preferred shares in Occidental, which pay an 8% dividend.\nHere's why Occidental has become Buffett's favorite energy stock and could soon top Chevron as Berkshire's biggest investment in the industry.\nOccidental and Chevron are both integrated oil and gas companies. However, where Chevron makes most of its money from downstream operations like refineries and chemical plants, Occidental is heavily invested in drilling oil out of the ground. As a result, Occidental's business is much more closely tied to the price of oil.\nIts strong position in the Permian Basin gives it a cheap source of oil production. It strengthened that position with the acquisition of Anadarko, supported by Berkshire's $10 billion investment in the company. More recently, it added CrownRock last December, when Buffett started buying up shares again.\nOccidental's big investments in the Permian Basin have put pressure on its balance sheet. The company now holds a significant amount of debt. Management plans to divest non-core assets to accelerate the paydown of that debt. It did something similar following the Anadarko acquisition in 2019 and the subsequent drop in oil prices in 2020.\nThe moves to add more cheap sources of oil make sense in light of Occidental CEO Vicki Hollub's extreme bullishness on the price of the commodity. For one, she said the CrownRock acquisition will generate an additional $1 billion in cash flow in its first year as long as oil prices remain above $70. That was exactly the spot price of oil at the time of the acquisition, and it's only climbed to the mid-70s since.\nMore recently, Hollub has noted the potential for an oil supply shortage as soon as 2025. A production cut from OPEC combined with growing demand from China will push oil prices higher, she says. As a result, she sees oil climbing to $80 per barrel by the end of the year.\nBuffett has a lot of confidence in Hollub. He called her \"an extraordinary manager\" at Berkshire's 2023 Shareholder meeting in May. After managing the company through the depressed oil prices of 2020 right after acquiring Anadarko, she seems to be up for almost any task.\nShares of Occidental have gotten off to a poor start in 2024. While Chevron shares have climbed about 2% since the start of the year, Occidental is down about 3.5%.\nMoreover, the valuation for Occidental is extremely attractive. Shares currently trade for an enterprise value/earnings before interest, taxes, depreciation, and amortization (EV/EBITDA) multiple of just 5x. By comparison, Chevron trades for a 6.6x multiple.\nThat said, there's a lot more risk in buying Occidental than competing oil and gas companies. For one, it's heavily reliant on the price of oil. As explained, the bulk of its revenue comes from drilling, not downstream operations. Moreover, Occidental's balance sheet includes substantial levels of debt following the CrownRock acquisition. That leverage puts added pressure on management if oil prices decline in the future, making it less profitable to drill.\nIt's important to note that while Buffett is very confident in the future of Occidental, it's still less than 4% of Berkshire's equity portfolio and an even smaller percentage of the conglomerate's total holdings when you include its cash position and wholly owned subsidiaries. So, remaining diversified is key.\nShould you invest $1,000 in Occidental Petroleum right now?\nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nAdam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-24T17:13:20.000Z",
        "Title": "Berkshire paid $2.6 billion for Haslam family's remaining 20% Pilot stake",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nNEW YORK (Reuters) - Berkshire Hathaway, the conglomerate led by billionaire Warren Buffett, paid $2.6 billion last month for the 20% of the Pilot Travel Centers truck stop business it did not already own, after resolving a lawsuit over the price.\nThe price means Berkshire paid about $13.6 billion for Pilot, which operates more than 725 locations in the U.S. and Canada, and sold 13 billion gallons of fuel in 2022.\nBerkshire disclosed the purchase price in its annual report on Saturday.\nPilot, sometimes known as Pilot Flying J, had been founded in 1958 by Jim Haslam after he paid $6,000 for a Virginia gas station. It was later run by Jimmy Haslam, the billionaire owner of the Cleveland Browns football team.\nBerkshire paid $2.76 billion in 2017 for 38.6% of Pilot and $8.2 billion for another 41.4% in January 2023, and subsequently overhauled its management.\nPilot, based in Knoxville, Tennessee, added $603 million to Berkshire's profit in 2023.\nThe Haslams had an annual 60-day window to sell their last 20% of Pilot, with the price based on its profits.\nIn competing lawsuits in Delaware Chancery Court, each side accused the other of manipulating Pilot's accounting in bad faith, with the Haslams saying Berkshire was undervaluing its stake, and Berkshire concerned it might overpay.\nBuffett did not mention Pilot in his annual letter to Berkshire shareholders, also released on Saturday, but offered an anecdote about the risk of disappointment in acquisitions.\nHe recalled how Hugh McCulloch, the first comptroller of the United States, warned national banks in 1863 not to deal with a \"rascal\" even if they believed they could avoid being cheated.\n\"Many bankers who thought they could 'manage' the rascal problem have learned the wisdom of Mr. McCulloch's advice--and I have as well,\" Buffett said. \"People are not that easy to read. Sincerity and empathy can easily be faked. That is as true now as it was in 1863.\"\nBerkshire did not immediately respond to a request for comment on Saturday.\nBuffett said last May that he wished he could have bought all of Pilot in 2017, but the Haslams did not want to sell.\n(Reporting by Jonathan Stempel in New York; Editing by Daniel Wallis)\n"
    },
    {
        "Date": "2024-02-27T12:02:32.000Z",
        "Title": "Berkshire shares end in red as US threatens to sue unit over wildfire costs (Feb. 26)",
        "Author": "  Niket  Nishant ",
        "Text": "(This Feb. 26 story has been refiled to fix the syntax in the headline)\nBy Niket Nishant\n(Reuters) - Warren Buffett-led Berkshire Hathaway's shares closed down by more than 2% on Monday, slowing its march to $1 trillion market value on investor worries after the U.S. government warned of a lawsuit against its power company, PacifiCorp.\nBerkshire disclosed the risk of a lawsuit against its unit over its alleged failure to cover $356 million in costs associated with the 2020 Slater wildfire in southern Oregon and northern California.\nThe investment conglomerate had warned on Saturday that the parent of PacifiCorp and one of Berkshire's biggest businesses outside insurance, Berkshire Hathaway Energy, was under pressure.\n\"It will be many years until we know the final tally from BHE's forest-fire losses and can intelligently make decisions about the desirability of future investments in vulnerable western states,\" Buffett wrote in his annual letter to shareholders.\nHe also toned down expectations for Berkshire's share price, saying it did not have many lucrative investment opportunities left, while reassuring investors that the biggest financial firm by market value was \"built to last\".\nThe 93-year-old investing legend told shareholders that Berkshire would perform slightly better than the \"average American corporation\", but anything beyond that is \"wishful thinking\", even though it had a cash pile of $167.6 billion.\n\"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others... All in all, we have no possibility of eye-popping performance,\" Buffett wrote.\nTRILLION-DOLLAR MILESTONE\nInvestors closely watch Berkshire as its results are often seen as a bellwether for the U.S. economy.\n\"While this reads as if Buffett is saying that global equities are fairly valued, the truth is more nuanced than that,\" Nicholas Colas, co-founder of DataTrek Research, wrote in a note.\n\"Berkshire is a huge business and needs to take substantial positions in large companies in order to 'move the needle'. Markets are generally good at pricing those sorts of stocks, hence the lack of opportunities.\"\nBerkshire's annual operating profit climbed 21%, to $37.4 billion on improved underwriting and higher investment income from the insurance segment. Operating profit for the fourth quarter also came in ahead of analysts' expectations.\nA $1 trillion market value would put Berkshire among a rarefied list of American businesses, which currently includes tech giants like Microsoft and Apple.\nBerkshire's Class A shares dropped 2.16%, while its Class B shares, which carry higher voting rights and whose value is 1/1,500th of Class A shares, slipped 1.94%. That left the conglomerate with a stock market value below $900 billion.\n\"We continue to believe shares are an attractive stock in an uncertain macro environment,\" UBS analyst Brian Meredith said.\nBuffett in his letter also mourned the passing of his longtime second-in-command Charlie Munger, while assuring investors that vice chairman and designated successor Greg Abel was \"ready to be CEO of Berkshire tomorrow\".\n(Reporting by Niket Nishant, Manya Saini and Jaiveer Singh Shekhawat in Bengaluru and additional reporting by Noel Randewich in San Francisco; Editing by Arun Koyyur and Pooja Desai)\n"
    },
    {
        "Date": "2024-02-16T21:20:00.000Z",
        "Title": "57% of Warren Buffett's Berkshire Hathaway Portfolio Is Invested in These 2 Spectacular Stocks",
        "Author": "  Parkev Tatevosian, CFA, The Motley Fool ",
        "Text": "Fool.com contributor Parkev Tatevosian highlights the two stocks comprising a large part of Warren Buffett's Berkshire Hathaway portfolio.\n*Stock prices used were the afternoon prices of Feb. 14, 2024. The video was published on Feb. 16, 2024.\nShould you invest $1,000 in Apple right now?\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nParkev Tatevosian, CFA has positions in Apple. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy.\nParkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\n57% of Warren Buffett's Berkshire Hathaway Portfolio Is Invested in These 2 Spectacular Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-16T21:30:10.000Z",
        "Title": "Is Warren Buffett Warming Up To Bitcoin? Berkshire Hathaway Profits Big From Crypto Investment",
        "Author": "  Caden Pok ",
        "Text": "Perhaps the most famous value investor of all time, Warren Buffett is strongly against Bitcoin and other cryptocurrencies, saying, \"You can’t value Bitcoin because it’s not a value-producing asset.\" Buffett and his holding company Berkshire Hathaway Inc. have been well-known for their investments in stable and profitable companies.\nBuffett believes in investments that create value, instead of relying on investor sentiment. \"If you buy something like Bitcoin or some cryptocurrency, you don’t really have anything that has produced anything. You’re just hoping the next guy pays more.\"\nThis strategy has been profitable for decades, allowing Berkshire Hathaway to become one of the largest and most profitable companies in the world. Investors around the globe look to Buffett and his companies for investment advice and recommendations.\nDon't Miss:\nBitcoin has jumped another 25% already this year – how much would you need to get started today?\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, so how much did the miners earn?\nHowever, Buffett’s strong anti-crypto stance may change after reviewing the firm's performance in 2023. The top performing investment in 2023 for Berkshire Hathaway was a Brazilian fintech Nu Holdings Ltd.. The company owns Nubank, a neobank that offers credit cards and banking as well as crypto trading for users. It offers 15 different tokens, as well as its own utility token called Nucoin.\nThe company went public in December 2021 but had received backing from Buffett and Berkshire during series G funding when Berkshire invested $500 million in the company. Buffett later increased his stake by another $500 million for a total of $1 billion invested in early 2022.\nThe investment has paid extremely well, as Brazil has had a very open and accepting stance on crypto. In 2023, the price of Nu Holdings appreciated by 93%. These huge gains made Nu Holdings the most profitable investment in Berkshire Hathaway's portfolio for 2023. This investment is especially surprising given the strong performance of stocks in other sectors, such as technology.\nBuffett has not sold his investment in Nu Holdings, potentially implying that he is bullish on the stock for the months or years to come.\nConsidering Buffett's hesitancy to invest in crypto directly, this could be an eye-opener for the legendary investor. As the company looks back on 2023, the strong performance of its crypto-related investment could cause it to look into other crypto stocks or even cryptocurrencies themselves.\nWhile cryptocurrency and digital tokens don't adhere to Buffett's main investment theses, it is impossible to argue with the gains they can provide investors. For example, Bitcoin appreciated more than 150% in 2023, beating every investment in Buffett's portfolio.\nAs crypto becomes more pervasive and part of mainstream investing, it will be interesting to see whether Buffett and Berkshire will give in and further their investments into crypto stocks or even major tokens like Bitcoin.\nRead Next: \nThis brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\nThe last-standing top crypto exchange without a major security breach offers what now?\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Is Warren Buffett Warming Up To Bitcoin? Berkshire Hathaway Profits Big From Crypto Investment originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-02-26T10:03:48.000Z",
        "Title": "3 pieces of investment advice from Warren Buffett's annual letter to Berkshire Hathaway shareholders",
        "Author": "  Katherine Tangalakis-Lippert ",
        "Text": "Warren Buffett on Saturday released his annual letter to Berkshire Hathaway shareholders.\nIn the letter, the centibillionaire offered several pieces of investing advice.\nPlay the long game, he says, and ignore pundits offering their financial forecasts.\nWarren Buffett on Saturday released his annual letter to Berkshire Hathaway shareholders, offering subtle investment advice to readers who may be looking to grow their wealth the way the centibillionaire has.\nBuffett has written an annual letter since 1965, offering an analysis of the performance of the holding company's investments along with his observations of financial trends and pitfalls.\nHe has also given advice over the years, The Wall Street Journal noted in an analysis of each of his letters, including cautioning investors on fast-growing companies, which he calls \"the worst sort of business,\" and describing fear and greed as two, inevitable \"super-contagious diseases\" plaguing the investment community. Buffett suggested in 1987 that savvy investors should attempt to invert the two, writing, \"We simply attempt to be fearful when others are greedy and to be greedy only when others are fearful.\"\nHere's what Buffett suggested to investors in this year's letter:\nBuffett begins by lauding his sister, Bertie, whom he describes as extremely well-read and understanding of many accounting terms, though by no means an economic expert or prepared for a CPA exam. Her instincts make up his first key piece of advice.\nHe writes: \"She is sensible — very sensible — instinctively knowing that pundits should always be ignored. After all, if she could reliably predict tomorrow's winners, would she freely share her valuable insights and thereby increase competitive buying? That would be like finding gold and then handing a map to the neighbors showing its location.\"\nBuffett then details some of Berkshire's \"long-duration partial-ownership\" investment successes: American Express and Coca-Cola, which began operations in 1850 and 1886, respectively.\nBerkshire Hathaway made significant investments in Coca-Cola in 1988 and American Express in 2001, which Buffett noted have not been touched in the decades since, despite each company's occasional failed attempts at expansion and moments of mismanagement.\n\"The lesson from Coke and AMEX? When you find a truly wonderful business, stick with it,\" Buffett writes. \"Patience pays, and one wonderful business can offset the many mediocre decisions that are inevitable.\"\nBuffett goes on to say that the stock market is becoming more and more like a casino, offering daily temptations to ignore his long-term investment strategy and quickly turn over holdings when \"feverish activity\" brings all number of uninformed or ill-intentioned actors out of the woodwork.\nHe writes: \"At such times, whatever foolishness can be marketed will be vigorously marketed — not by everyone but always by someone.\"\nHe notes do not fall for the marketing of the foolishness, or the scene could turn ugly, and the average investor may walk away \"bewildered, poorer, and sometimes vengeful.\"\n\"One investment rule at Berkshire has not and will not change: Never risk permanent loss of capital. Thanks to the American tailwind and the power of compound interest, the arena in which we operate has been — and will be — rewarding if you make a couple of good decisions during a lifetime and avoid serious mistakes.\"\nRead the original article on Business Insider\n"
    },
    {
        "Date": "2024-02-14T21:37:48.000Z",
        "Title": "Berkshire trims Apple, sheds four stocks, mum on new investment",
        "Author": "  Jonathan Stempel ",
        "Text": "(Reuters) — Berkshire Hathaway on Wednesday said it has trimmed its huge stake in Apple and shed four common stock holdings, and kept investors guessing on what could be a major new investment by Warren Buffett.\nIn a regulatory filing describing its U.S.-listed stock holdings at the end of 2023, Berkshire said it sold 10 million Apple shares in the fourth quarter, but still owned more than 905 million shares worth about $174 billion.\nThough Buffett has been driving Berkshire's investment in Apple, the stock sales in the iPhone maker could have been made by one of his portfolio managers Todd Combs and Ted Weschler, who oversee some Berkshire investments.\nBerkshire reported no holdings in homebuilder DR Horton, insurer Globe Life, insurance and investment company Markel and Brazilian credit card processor StoneCo, after holding more than $1 billion of those stocks at the end of September.\nThe Omaha, Nebraska-based conglomerate also boosted its stake in oil company Chevron, one of its biggest holdings, and reduced its stakes in computer and printer maker HP and media company Paramount Global.\nFor a second straight quarter, Berkshire obtained permission from the U.S. Securities and Exchange Commission to temporarily keep one or more of its holdings confidential.\nIt occasionally requests such treatment when it is making big investments, including multibillion-dollar stakes in Chevron, Exxon Mobil, IBM and Verizon Communications.\nThis is because investors often try to piggyback on what Berkshire does, reflecting Buffett's reputation as one of the world's greatest investors. Berkshire prefers not to have investors pile into its stocks before it's done buying.\nIn its third-quarter report in November, Berkshire hinted that its confidential investment may involve a bank, finance company or insurer because it had recently spent $1.2 billion on stock in that sector. It has yet to reveal where the money went.\nBerkshire did not immediately respond to a request for comment. It no longer invests in Exxon, IBM and Verizon.\nBuffett, 93, has run Berkshire since 1965.\nThe conglomerate also owns dozens of businesses including the Geico car insurer, BNSF railroad, energy and industrial companies, and consumer brands such as Benjamin Moore, Dairy Queen, Duracell, Fruit of the Loom and See's Candies.\nIt also owns the Pilot truck stop chain, after buying the 20% it didn't already own from the billionaire Haslam family in January.\nBerkshire will reveal more about its investing and businesses when it releases its annual report and Buffett's annual letter to shareholders, expected on Feb. 24.\n(Reporting by Jonathan Stempel in New York; editing by Jonathan Oatis and Diane Craft)\n"
    },
    {
        "Date": "2024-02-27T17:57:57.000Z",
        "Title": "A widow unexpectedly received $1 billion of Berkshire Hathaway stock. Now, she's covering Bronx med students' tuition forever.",
        "Author": "  Grace Eliza Goodwin ",
        "Text": "Ruth Gottesman is donating her late husband's $1 billion in Berkshire stock to a Bronx medical school.\nThe donation is set to cover students' tuition in perpetuity.\nA video posted Monday shows students cheering and crying when they hear the news.\nWhen the 96-year-old Ruth Gottesman's husband died in 2022, he left behind something that surprised even his wife: $1 billion in Berkshire Hathaway stock.\n\"He left me, unbeknownst to me, a whole portfolio of Berkshire Hathaway stock,\" Gottesman told The New York Times. Her husband's only instructions? \"Do whatever you think is right with it,\" she told the outlet.\nAt first, Gottesman couldn't decide what to do with the massive bequest, but after her children advised her not to wait too long, she had a realization, The New York Times reported.\nShe would donate the money in full to the Albert Einstein College of Medicine in the Bronx, New York City's poorest borough, the Times reported.\n\"I wanted to fund students at Einstein so that they would receive free tuition,\" she told the Times.\nHer gift is so large that it's set to cover students' tuition for the medical school in perpetuity, the college said in a press release.\n\"This is a monumental day for our affiliated medical school and for values-based medical education,\" Rabbi Dr. Ari Berman, the president of Yeshiva University, said in a statement shared with Business Insider.\nAll current fourth-year students are set to be reimbursed for their spring 2024 tuition, the school said, and beginning in August, all current and future students will attend for free.\nGottesman broke the news to the current students in person on Monday morning. The second the words \"tuition-free\" came out of her mouth, students in the auditorium erupted into cheers, clapping and jumping out of their seats, with some crying, a video from the school's hospital affiliate, Montefiore Health System, shows.\nGottesman, a clinical professor emerita of pediatrics at Einstein, began her career at the college in 1968, according to the school's press release. She serves as the chair of the school's board of trustees, a role she also held from 2007 to 2014. Gottesman has also been an active philanthropist for nearly 60 years, investing in the Jewish community, education, and health programs since setting up The Gottesman Fund in 1965, according to the Foundation Guide.\nGottesman's husband, David \"Sandy\" Gottesman, began his career in the '60s with a friendship with Warren Buffett, leading him to become one of the earliest investors in Buffett's holding company, Berkshire Hathaway, according to the Foundation Guide. He went on to found his own investment firm, First Manhattan Co., which his son now runs, according to the Foundation Guide.\nGottesman's bequest will likely help the Albert Einstein College of Medicine attract a more diverse pool of applicants, the school said in its press release. And that was exactly Gottesman's goal, she told the Times.\nA year's tuition at the school is over $59,000, leaving many graduates with more than $200,000 in debt, the Times reported.\n\"This donation radically revolutionizes our ability to continue attracting students who are committed to our mission, not just those who can afford it,\" Dr. Yaron Tomer, the Marilyn and Stanley M. Katz dean at Albert Einstein College of Medicine, said in the school's press release. \"Additionally, it will free up and lift our students, enabling them to pursue projects and ideas that might otherwise be prohibitive.\"\nRead the original article on Business Insider\n"
    },
    {
        "Date": "2024-02-15T01:13:57.000Z",
        "Title": "Bruce Berkowitz Bolsters Berkshire Hathaway Stake by 139.81%",
        "Author": "  GuruFocus Research ",
        "Text": "Warning! GuruFocus has detected 2 Warning Sign with JOE.\nBruce Berkowitz (Trades, Portfolio), the esteemed founder and Managing Member of the Fairholme Fund (Trades, Portfolio), has made notable changes to his investment portfolio in the fourth quarter of 2023. Known for his concentrated investment approach and admiration for Benjamin Graham's \"The Intelligent Investor,\" Berkowitz seeks out companies with exceptional management, robust free cash flow, and attractive valuations. His latest N-PORT filing reveals strategic adjustments, including a significant increase in his Berkshire Hathaway Inc. position and the complete exit from Home BancShares Inc.\nBruce Berkowitz (Trades, Portfolio) has augmented his holdings in two stocks during the last quarter. Notably:\nBerkshire Hathaway Inc (NYSE:BRK.B) saw an addition of 71,685 shares, bringing the total to 122,958 shares. This move marks a substantial 139.81% increase in share count and a 1.64% impact on the current portfolio, valued at $43,854,200.\nEnterprise Products Partners LP (NYSE:EPD) also experienced an increase with an additional 144,200 shares, resulting in a total of 5,208,400 shares. This adjustment signifies a 2.85% increase in share count, with a total value of $137,241,340.\nIn a decisive move, Berkowitz has completely divested from one holding in the fourth quarter of 2023:\nHome BancShares Inc (NYSE:HOMB) was entirely sold off, with 103,400 shares liquidated, impacting the portfolio by -0.15%.\nAdditionally, Berkowitz trimmed positions in three stocks, with significant reductions in:\nBank OZK (NASDAQ:OZK) by 96,300 shares, leading to a -65.29% decrease in shares and a -0.25% impact on the portfolio. The stock's average trading price was $41.21 during the quarter, with a 3-month return of 5.15% and a year-to-date decline of -13.78%.\nThe St. Joe Co (NYSE:JOE) by 32,600 shares, resulting in a -0.14% reduction in shares and a -0.13% impact on the portfolio. The stock's average trading price was $52.62 during the quarter, with a 3-month return of 4.37% and a year-to-date decrease of -9.94%.\nAs of the fourth quarter of 2023, Bruce Berkowitz (Trades, Portfolio)'s portfolio comprises 7 stocks, with the top holdings being 87.58% in The St. Joe Co (NYSE:JOE), 8.81% in Enterprise Products Partners LP (NYSE:EPD), 2.81% in Berkshire Hathaway Inc (NYSE:BRK.B), 0.57% in WR Berkley Corp (NYSE:WRB), and 0.16% in Bank OZK (NASDAQ:OZK). The investments are primarily concentrated in four industries: Real Estate, Energy, Financial Services, and Technology.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-24T13:55:26.000Z",
        "Title": "Buffett's Berkshire posts record profit, quarterly results also rise",
        "Author": "Reuters ",
        "Text": "Feb 24 (Reuters) - Warren Buffett's Berkshire Hathaway Inc on Saturday posted its second straight record annual profit, bolstered by gains from its common stock investments and as rising interest rates helped its insurance businesses generate more income.\nFourth-quarter operating profit rose 28% to $8.48 billion, or about $5,884 per Class A share, from $6.63 billion a year earlier.\nNet income for the quarter more than doubled to $37.57 billion, or $26,043 per Class A share, from $18.08 billion a year earlier.\nBuffett considers net results misleading because they include gains and losses on investments that Berkshire has not sold.\nFor all of 2023, Berkshire posted a net profit of $96.2 billion, topping the old record $89.9 billion set in 2021. Berkshire lost $22.8 billion in 2022, when the stock market fell.\n(Reporting by Jonathan Stempel in New York Editing by Tomasz Janowski)\n"
    },
    {
        "Date": "2024-02-27T13:00:01.000Z",
        "Title": "Berkshire Business Unit Focus: Pilot Flying J",
        "Author": "  Horse Poor Investor ",
        "Text": "On Jan. 16, Berkshire Hathaway Inc. (NYSE:BRK.A) (NYSE:BRK.B) announced the purchase of the remaining 20% of Pilot Travel Centers (PTC) from the Haslem family. A week and a half before the sale, the Delaware court lawsuit over accounting methods disputing the value of the balance of the company owned by the Haslems was settled by both parties. Both A and B shares had closed slightly below the previous day's price after the transaction was announced. Berkshire's 80% of the company before the purchase comprised 20.80% of Berkshire's revenues in the third quarter of 2023. This discussion aims to provide background information on this now wholly-owned subsidiary that makes up a large portion of the Berkshire Hathaway portfolio.\nWarning! GuruFocus has detected 6 Warning Signs with BRK.A.\nTruck stops, travel centers and travel plazas are part of the highly fragmented and competitive retail defensive industry. Most truck stops and travel centers are privately owned chains or single-location enterprises. Target customers are professional truck drivers and distance motorists who travel long distances and are looking for convenience, quick service and opportunities to rest and replenish both themselves and their fuel tanks. Most truck stops offer fuel rewards or loyalty programs to attract repeat customers.\nThe truck stops and travel industry began in the 1920s and was aligned with the development of the automotive industry. The first truck stops consisted mainly of simple rest stops and basic facilities such as gas stations, small buildings and diners. The industry grew rapidly during the 1950s and 1960s to include larger and more sophisticated facilities offering additional services and merchandise. In the late '80s and early '90s, truck stops combined fuel stations with convenience or travel stores and full-serve restaurants. The '90s began to attract more consumer travelers with RVs and automobiles. Truck stop operators noted that professional drivers and these new gasoline smaller vehicle customers preferred quick, convenient services and amenities, so sit-down restaurants were exchanged for quick, grab-and-go style eateries, otherwise known as quick-serve restaurants with less sit-down space. Truck stops began carrying a wider arrangement of merchandise including perfume, electronics and gift items displayed in convenient store layouts that appealed to their customer base. Some stops even feature hotels or cinemas.\nTypically truck stops are conveniently located near large interstate highways. The average truck stop occupies approximately 75 acres of land to provide plenty of parking for weary professional drivers who must comply with the hours-of-service rules mandated by the Federal Motor Carrier Safety Administration.\nTruck stops often engage in franchise partnerships to roll out their convenience stores and restaurant services. Warren Buffett (Trades, Portfolio) discussed the characteristics of strong economic franchise operations in his 1991 chairman's letter. Both Pilot Flying J and Travel Centers of America also offer franchise opportunities for truck stop site owners. Common FSR and QSRs franchise operations within large truck stops include Black Bear Diner, IHOP, Starbucks (NASDAQ:SBUX), Taco Bell, Dairy Queen, KFC, Subway, Pizza Hut, Dunkin' Donuts (DNKN) and many others.\nThe U.S. trucking market size is expected to grow at a 3% compound annual growth rate through 2027, according to Zippia.com, which leaves a modest opportunity for truck stop providers to capture additional shares of this modestly growing market.\nThe largest truck stop in the U.S., off Interstate 80 in Walcott, Iowa, is three times larger than the size of an average truck stop and has 5,000 visitors per day. It has been a Travel Centers of America franchised operation since 1992, after the death of then-owner Bill Moon (the site is still owned by the Moon family.)\nThe oldest truck stop in the U.S. is Dixie Travel Plaza, which was established in 1928 and is just off Interstate 55 in McLean, Illinois. Since 2012, Dixie Travel Plaza has been owned by Road Ranger, which was purchased by Chilean company Enex, a subsidiary of Quinenco SA (XSGO:QUINENCO), in 2018.\nThe charts below roughly depict the distribution of geographic footprint and 2022 revenue estimates for major truck stop players in the U.S. and Canada. These data from publicly available sources contain caveats in terms of accuracy as all these establishments are either privately owned or are subsidiaries of larger corporations, so do not comply with SEC filing guidelines. Also, chains often consist of both large truck stops that accommodate professional rigs and heavy traffic as well as smaller, traditional gas stations or related businesses, so comparisons between the number of locations and revenue estimates are not reflective of the differences in individual receipts and volume of traffic per each location. For example, Love's Truck Stop's geographical footprint also includes its Speedco subsidiary of oil change specialty shops acquired in 2017. The location map may also conceal an overlap in the number of sites for Pilot and Town Pump as the companies have a notable relationship in Montana. Pilot lists 36 Town Pump sites in its list of locations and Town Pump acquired three Montana Pilot Flying J locations, which it still operates under the Pilot brand as part of a Federal Trade Commission agreement designed to reduce competition in a 2010 merger between Pilot Travel Centers and Flying J Inc.\nNevertheless, Pilot appears to be the clear leader both in terms of its geographic footprint and estimated revenue. The most formidable competitor is Love's Truck Stops. Pilot Travel Centers LLC (doing business as Pilot Flying J) is now wholly owned by Berkshire Hathaway. Travel Centers of America operated as a publicly traded company until February of 2023, when BP (NYSE:BP) purchased the company. As stated above, Road Ranger is owned by the Enex subsidiary of Quinenco. Other players in this field are privately held.\nBerkshire started investing in Pilot Flying J when Buffett bought a 38.60% stake in the company in October 2017 for $3 billion and bought an additional 41.40% stake in January 2023 for an estimated value of roughly $8.20 billion, with the remaining 20% of the company bought for an estimated $11 billion in January of this year.\nBefore Berkshire's investment, Pilot Travel Centers had many of the large-moat business characteristics that attracted the Oracle of Omaha, including a long, family-centric operating history, market dominance and good brand recognition. Forbes ranked Pilot as the fifth-largest private U.S. company before Berkshire Hathaway's investment in 2017 and the large influx of the conglomerate's cash flow resources has improved the company's debt rating and expanded its geographical footprint.\nSince Berkshire's initial stake, Pilot Flying J has grown by nearly 15% in terms of its North American footprint. The company had an annual increase in revenues between 2021 and 2022 of nearly 58%. Thus, Berkshire Hathaway has paid approximately $22 billion for a company that generates as much as $42 billion annually and may generate more than $1 billion in cash flow this year. However, revenue and profits of the company have both decreased since 2022. In April 2023, Berkshire replaced the Haslem-selected CEO and chief financial officer positions with two well-entrenched Berkshire executives.\nPilot's contribution to Berkshire's profitability is a tall order considering the sheer size of its entire portfolio and operations. The company has admittedly struggled in recent years to find acquisitions that can solidly benefit its investment value position. As Pilot Travel Centers comprised a large percentage of Berkshire's revenues in the third quarter of 2023, one way to gauge the impact of this acquisition is by looking at its stock performance since the time of the company's initial investment and comparing it to the performance of the stock's performance before that time. Another way is to gauge Berkshire's total return since the acquisition against a larger market index.\nTo apply the first gauge, I compared various point-in-time metrics of third-quarter 2017 (a snapshot from a time before Berkshire's initial investment in Pilot) with its current metrics:\nPERFORMANCE\n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nSHARE PRICE TTM\n$270,430.00\n$610,086.00\n14.52%\nREVENUE TTM\n$235.14B\n$349.271B\n7.10%\nNET INCOME TTM\n$18.675B\n$76.813B\n22.00%\nFCF TTM\n$33.001B\n$26.723B\n3.90%\nTOTAL RETURN TTM\n21.05%\n30.56%\n6.41%\nVALUATION \n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nPE RATIO TTM\n20.44\n11.57\n6.41%\nPB RATIO TTM\n1.51\n1.68\n1.79%\nPFCF TTM\n14.15\n33.04\n15.18%\nEV/SALES\n2.08\n2.79\n5.02%\nEV/EBITA\n11.73\n16.92\n6.30%\nEARNINGS YIELD\n5.05%\n8.72%\n9.53%\nFCF YIELD\n7.40%\n3.03%\n16.05%\nCAPITAL ALLOCATION \n3RD-QUARTER 2017\nCURRENT\nCHANGE (CAGR)\nROA TTM\n2.87%\n7.81%\n18.16%\nROE TTM\n6.06%\n14.62%\n15.81%\nROIC TTM\n3.22%\n3.97%\n3.55%\nTo apply the second gauge, I compared the growth of shares and dividends (a proxy for total return) for Berkshire against the Vanguard S&P Value Index Fund ETF (VOOV) and the Vanguard 500 Index Fund (VOO) from Oct. 2, 2017 (a snapshot from a time before the initial investment in Pilot) until today.\nKeep in mind these results have been convoluted by changes and events that occurred to Berkshire Hathaway's greater portfolio during that time. Since 2017, the conglomerate has made sizable investments in Apple (NASDAQ:AAPL) and Bank of America (NYSE:BAC) in addition to those made in Pilot.\nDespite the Pilot acquisition, Berkshire Hathaway is currently not attractive as a value investment prospect. GuruFocus gives the Class A stock an overall score of 69 and a value rank of just 1 priced over 36% above its GF Value.\nPilot Travel Centers is a longtime market leader in the heavily competitive truck stop and travel center business. The company has all the aspects of a quality business that Buffett loves, was bought at a screaming deal and will likely positively affect Berkshire Hathaway's business in the coming years. Unfortunately, with its huge size and cash position, a lot is needed from an acquisition to move the needle of profitability and value upward, and Pilot's ability to do that may fall short.\nCurrently, Berkshire stock is not an attractive buy. However, if the company can find more diamonds like Pilot in the future, its prospects as a viable investment will be rosy.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-19T17:30:11.000Z",
        "Title": "Amazon, JP Morgan And Berkshire Hathaway Bet Big And Failed — Will Google Be Successful In Making Healthcare Accessible?",
        "Author": "  Caleb Naysmith ",
        "Text": "Alphabet Inc.'s (NASDAQ:GOOGL) Google is on a mission to make healthcare more accessible and believes everyone should have access to useful health resources.\nAmazon.com Inc. (NASDAQ:AMZN), Berkshire Hathaway Inc. (NYSE:BRK) and JPMorgan Chase & Co. (NYSE:JPM) took on a similar mission with the launch of Haven, which aimed to \"transform healthcare to create better outcomes and overall experience, as well as lower costs for you and your family.\" But three years into the joint venture, the company abandoned the effort.\nGoogle is trying to make the detection and diagnosis of healthcare issues more efficient and user-friendly and has already launched products to support the mission.\nDon't Miss:\nWhat decision made this 20-year-old a millionaire in 1 year?\nCopy and paste Mark Cuban’s startup investment strategy according to his colorful portfolio.\nOne of its recent strides in healthcare technology is the introduction of the Thermometer app on its latest Pixel 8 Pro. This groundbreaking feature, approved by the Food and Drug Administration (FDA), allows users to take their temperature or someone else’s through a simple forehead scan. The innovation complements Google’s broader initiative to leverage technology for medical advancements.\nThis comes just as Google announced Articulate Medical Intelligence Explorer (AMIE) earlier this year, an initiative set to transform healthcare through advanced technology. AMIE focuses on diagnostic reasoning and medical conversations, demonstrating Google’s commitment to employing cutting-edge solutions to enhance healthcare accessibility.\nFitbit, a popular watch-like device developed by Google, plays a pivotal role in the company’s healthcare portfolio. Users can track real-time health and activity progress while monitoring critical health measures such as heart rate variability (HRV), blood oxygen saturation (SpO2) and skin temperature. Fitbit exemplifies Google’s commitment to providing people with tools to monitor and improve their overall health.\nTrending: This startup is accepting investors for as little as 25 cents – what’s the catch?\nGoogle’s foray into healthcare extends to addressing critical issues such as cancer detection.\nThe company uses artificial intelligence (AI) to emulate the diagnostic capabilities of radiologists, aiming to streamline and expedite the cancer diagnosis process.\n\"We're working with clinicians, patients and partners to build an AI system for mammography, which could help radiologists detect breast cancer more accurately, quickly and consistently,\" according to the Google Health website.\nGoogle’s healthcare initiatives span a wide range of health issues, demonstrating a comprehensive approach to improving overall well-being. Whether it’s tackling breast cancer or addressing eye diseases, Google’s application of AI and technology showcases its commitment to advancing healthcare solutions for diverse medical challenges.\nAs Google continues to blur the lines between technology and healthcare, its initiatives are transforming the landscape of medical accessibility.\nFrom the Thermometer app on Pixel 8 Pro to the AMIE project and the use of AI for cancer detection, Google is pioneering innovative solutions that prioritize accuracy, speed and consistency in healthcare diagnostics. With products like Fitbit, the tech giant is empowering people to actively monitor and improve their health, reflecting a vision where advanced technology plays a pivotal role in making healthcare accessible to all.\nRead Next:\nThis startup in the climate tech industry could unlock the riches flowing 30 feet above your head.\nA startup that solves the age-old paywall problem is growing exponentially and looking for new shareholders.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Amazon, JP Morgan And Berkshire Hathaway Bet Big And Failed — Will Google Be Successful In Making Healthcare Accessible? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-02-02T13:00:00.000Z",
        "Title": "Berkshire Hathaway HomeServices Georgia Properties’ President and CEO DeAnn Golden Ranks in Swanepoel’s Power 200",
        "Author": "Business Wire ",
        "Text": "ATLANTA, February 02, 2024--(BUSINESS WIRE)--T3 Sixty, a trusted advisor and management consultant in the residential brokerage industry, analyzes and ranks North America’s residential real estate brokerage’s 200 most powerful leaders and each year publishes the Swanepoel Power 200. Berkshire Hathaway HomeServices Georgia Properties (BHHSGA) is pleased to announce that President and CEO, DeAnn Golden, recently ranked in the top 200 and 39th among Women Executives.\nGolden leads Berkshire Hathaway HomeServices Georgia Properties 1500 sales associates across 28 Georgia locations. The company, a market leader, achieved $4.08 billion in sales in 2023. With 29 years of experience, DeAnn excels in leadership, training, coaching, and marketing, driving innovation and success in the industry.\n\"Recognition such as the esteemed Swanepoel’s Power 200, alongside some of the most talented individuals in the real estate industry, is a reflection of everyone in our company,\" said Golden. \"One of the best parts of my position is being able to motivate others to challenge the status quo and find out-of-the-box solutions that progress our company forward in today's competitive market. This recognition would not be possible without the endless dedication and support by everyone I have the privilege to work with and serve.\"\nGolden’s unwavering commitment to the real estate sector is evident through her recent role as President of the Atlanta Board of Realtors and her appointment by Governor Brian Kemp to the Georgia Real Estate Commission, underscoring her significant impact in the industry. A graduate of Tulane University, she holds an MBA from University of Georgia in Real Estate, Strategic Management and Marketing.\nABOUT BERKSHIRE HATHAWAY HOMESERVICES GEORGIA PROPERTIES\nBerkshire Hathaway HomeServices Georgia Properties is a full-service real estate brokerage company offering residential, commercial and property management services. With over $4.08 billion in sales in 2023, 28 office locations and more than 1,500 sales associates, the company continues to expand its footprint in the Atlanta Metro market, including North Georgia Mountain and Lakes and the Southern Crescent. To learn more, visit www.BHHSGA.com.\nAbout Berkshire Hathaway HomeServices\nBerkshire Hathaway HomeServices is the only global real estate brokerage franchise that is boldly focused on building a personally connected future through relationship-driven business, with best-in-class leadership, mentorships, business tools and a worldwide network that is committed to making a lasting impact through lifelong relationships. With more than 50,000 real estate professionals and nearly 1,600 offices across 4 continents and 13 countries and territories including the U.S., Canada, Mexico, Europe, the Middle East, The Caribbean and India, the network completed more than USD$154.7 billion in real estate sales in 2022. Among the few organizations entrusted to use the world-renowned Berkshire Hathaway name, the network brings to the real estate market a definitive mark of trust, integrity, stability, and longevity.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240202880418/en/\nContacts\nBerkshire Hathaway HomeServicesGeorgia PropertiesNicola Schwab404.580.9755Nicola.Schwab@bhhsga.com\n"
    },
    {
        "Date": "2024-02-26T18:25:49.000Z",
        "Title": "Pilot’s drop in profits led to lower valuation in final Berkshire purchase",
        "Author": "  John Kingston ",
        "Text": "The final tranche of Pilot Travel Centers purchased by Berkshire Hathaway appears to have put the enterprise value of the travel center chain significantly lower than it was just a year earlier.\nIn the company’s 10-K report filed with the Securities and Exchange Commission over the weekend, Berkshire Hathaway revealed that it had paid $2.6 billion for the final 20% of Pilot it did not already own. That would give Pilot an enterprise value of $13 billion.\nBut in the first quarter of 2023, Berkshire Hathaway paid $8.2 billion for a 41.4% stake in Pilot. That equates to an enterprise value of approximately $19.8 billion.\n\nWith the acquisition price earlier this year set as a multiple of earnings before interest and taxes, the data in the 10-K on Pilot’s performance suggests a weaker 2023 is the reason for the decline in the enterprise value paid for the final fifth compared to where it was a year earlier.\nPilot, having been a private company, did not need to publicly release financial data previously. But it does so now as a subsidiary of publicly traded Berkshire.\nWhile some of the 22% decline in 2023 revenue at Pilot from a year earlier can be attributed to lower diesel prices, with revenue dropping to $56.8 billion from $72.7 billion in 2022, pretax earnings at Pilot suffered a bigger decline, a drop of 54.7% to just over $1 billion from $2.33 billion a year earlier.\nIn its relatively brief comments about Pilot’s operations, Berkshire Hathaway management in the 10-K said Pilot last year sold about 16.2 billion gallons of diesel, gasoline and other fuel-related products in 2023. That was down from 18.4 billion gallons a year earlier.\nThe decline was not primarily a function of a drop in sales at the pump, Berkshire said, but “predominantly” in the wholesale fuel and fuel marketing businesses of Pilot.”\nIn filings last year and then repeated in this year’s 10-K, Berkshire Hathaway said it had changed the accounting of its stake in Pilot before it had control from the equity method of accounting to a standard known as “fair value.”\nAs a result of that change, Berkshire Hathaway took a one-time noncash gain of $3 billion, as the fair value method put the value of Pilot in excess of the equity method.\nThe accounting changes had a significant impact on depreciation and amortization. Moving to acquisition accounting from equity accounting was a major cause of depreciation and amortization costs rising to $832 million last year from $436 million a year earlier, according to the 10-K.\nAdditionally, interest costs nearly doubled, increasing $213 million, up to $437 million from $224 million.\nThe early 2023 purchase of a 41.4% stake in Pilot gave Berkshire Hathaway controlling interest when combined with the 38.6% share in Pilot that the conglomerate first acquired in 2017. That 2017 purchase for $2.76 billion gave Pilot an enterprise value of about $7.1 billion.\nBerkshire had not responded by publication time to a phone message about the difference in valuations.\nBerkshire and the Haslam family, which sold Pilot to Berkshire, squared off in the latter part of 2023 and into 2024 over the valuation of the final 20% before finally settling lawsuits against each other just before the dispute was to go to trial in January in Delaware Chancery Court.\nThe suit between the two sides began with the Haslam family criticizing changes in Berkshire’s accounting of its stake in Pilot after the 41.4% acquisition gave it controlling interest in Pilot.\nBerkshire implemented what the Haslams called the “pushdown” method for valuing its stake in Pilot. The founding family of Pilot was concerned that the practice was different from the formula the two sides had agreed upon for valuing that final 20%, which was to be a multiple of EBIT. The dispute ultimately was settled before the case went to trial, and the sale of the final stake in Pilot to Berkshire went ahead.\nThe two sides never said whether there were any changes in the formula between the 2023 acquisition of 41.4% and the 20% acquisition in early 2024 as a result of the settlement.\nIn the 10-K, Berkshire Hathaway said “the redemption price was to be based on a multiple of PTC’s earnings for the preceding year, with specific other adjustments, including the amount of PTC’s net debt.”\nIn its lawsuit, Pilot founder James Haslam said he had been told by Berkshire Hathaway CEO Warren Buffet that the 20% would be valued under provisions earlier agreed upon, though the Haslams were concerned that the pushdown accounting would hurt the valuation of Pilot as a multiple of EBIT.\nIn the brief summation of the Haslams vs. Berkshire lawsuits, all the Berkshire 10-K said was that “all litigation between Pilot Corp (the Haslams) and Berkshire was settled in January 2024.”\nMore articles by John Kingston\n1st peek at Pilot’s finances after Berkshire Hathaway ownership grows\nTruck stops in flux: Pilot CEO switch, TA sale cleared\nDebt ratings review: Pilot remains strong operator\nThe post Pilot’s drop in profits led to lower valuation in final Berkshire purchase appeared first on FreightWaves.\n"
    },
    {
        "Date": "2024-02-23T10:05:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Microsoft, Amazon.com, Berkshire Hathaway, Abbott and BlackRock",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – February 23, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Microsoft Corp. MSFT, Amazon.com, Inc. AMZN, Berkshire Hathaway Inc. (BRK.B), Abbott Laboratories ABT and BlackRock, Inc. BLK.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corp., Amazon.com, Inc. and Berkshire Hathaway Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Microsoft’s shares have outperformed the Zacks Computer - Software industry over the past year (+59.2% vs. +52.8%). The company’s second-quarter results gained from strong Intelligent Cloud, and Productivity and Business Processes revenues. Productivity and Business Processes rose due to a strong adoption of Office 365 Commercial solutions. Microsoft 365 Consumer subscribers grew to 78.4 million.Continued momentum in the small and medium businesses, frontline worker offerings and a gain in revenue per user drove the top line. Intelligent Cloud revenues were driven by growth in Azure and other cloud services. Solid adoption of Azure AI, which now has a clientele of more than 53,000 customers, holds promise.However, Office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spending on Azure enhancements amid stiff competition in the cloud space remains a concern.(You can read the full research report on Microsoft here >>>)Shares of Amazon.com have outperformed the Zacks Internet - Commerce industry over the past year (+75.9% vs. +47.6%). Strengthening AWS services portfolio and its growing adoption rate contributed well to AWS performance. Ultrafast delivery services and an expanding content portfolio were beneficial. Strengthening relationships with third-party sellers was also a positive.A robust advertising business contributed well. Notably, improving Alexa skills, along with an array of smart home products offerings remain tailwinds. Amazon’s strong global presence and solid momentum among the small and medium businesses are positives, as well.Growing capabilities in grocery, pharmacy, healthcare and autonomous driving are additional successes for Amazon. Also, a deepening focus on generative AI is a major plus. However, macroeconomic challenges are among its concerns.(You can read the full research report on Amazon.com here >>>)Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the past year (+35.0% vs. +29.5%). The company is one of the largest property and casualty insurance companies, with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts, and is indicative of its financial flexibility.Continued insurance business growth fuels an increase in its float, driving earnings and generating maximum returns on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to catatrophic losses induces earnings volatility and also affects underwriting results. Huge capital expenditures remain a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Other noteworthy reports we are featuring today include Abbott Laboratories and BlackRock, Inc.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nAbbott Laboratories (ABT) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-12T10:01:00.000Z",
        "Title": "Warren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "While Warren Buffett hasn't seen a whole lot to like in the stock market recently, there's one stock he seemingly can't get enough of.\nOver the last couple of years, he's built up a 28% stake in Occidental Petroleum (NYSE: OXY) for Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). That makes it one of Berkshire's top holdings, just behind fellow oil and gas company Chevron (NYSE: CVX).\nThe Oracle of Omaha has added to his Occidental position on three separate occasions since the start of December. His most recent purchase for Berkshire Hathaway's portfolio amounted to about $246 million. That follows purchases of about $589 million and $312 million in December. Meanwhile, Berkshire still owns about $8.5 billion worth of preferred shares in Occidental, which pay an 8% dividend.\nHere's why Occidental has become Buffett's favorite energy stock and could soon top Chevron as Berkshire's biggest investment in the industry.\nOccidental and Chevron are both integrated oil and gas companies. However, where Chevron makes most of its money from downstream operations like refineries and chemical plants, Occidental is heavily invested in drilling oil out of the ground. As a result, Occidental's business is much more closely tied to the price of oil.\nIts strong position in the Permian Basin gives it a cheap source of oil production. It strengthened that position with the acquisition of Anadarko, supported by Berkshire's $10 billion investment in the company. More recently, it added CrownRock last December, when Buffett started buying up shares again.\nOccidental's big investments in the Permian Basin have put pressure on its balance sheet. The company now holds a significant amount of debt. Management plans to divest non-core assets to accelerate the paydown of that debt. It did something similar following the Anadarko acquisition in 2019 and the subsequent drop in oil prices in 2020.\nThe moves to add more cheap sources of oil make sense in light of Occidental CEO Vicki Hollub's extreme bullishness on the price of the commodity. For one, she said the CrownRock acquisition will generate an additional $1 billion in cash flow in its first year as long as oil prices remain above $70. That was exactly the spot price of oil at the time of the acquisition, and it's only climbed to the mid-70s since.\nMore recently, Hollub has noted the potential for an oil supply shortage as soon as 2025. A production cut from OPEC combined with growing demand from China will push oil prices higher, she says. As a result, she sees oil climbing to $80 per barrel by the end of the year.\nBuffett has a lot of confidence in Hollub. He called her \"an extraordinary manager\" at Berkshire's 2023 Shareholder meeting in May. After managing the company through the depressed oil prices of 2020 right after acquiring Anadarko, she seems to be up for almost any task.\nShares of Occidental have gotten off to a poor start in 2024. While Chevron shares have climbed about 2% since the start of the year, Occidental is down about 3.5%.\nMoreover, the valuation for Occidental is extremely attractive. Shares currently trade for an enterprise value/earnings before interest, taxes, depreciation, and amortization (EV/EBITDA) multiple of just 5x. By comparison, Chevron trades for a 6.6x multiple.\nThat said, there's a lot more risk in buying Occidental than competing oil and gas companies. For one, it's heavily reliant on the price of oil. As explained, the bulk of its revenue comes from drilling, not downstream operations. Moreover, Occidental's balance sheet includes substantial levels of debt following the CrownRock acquisition. That leverage puts added pressure on management if oil prices decline in the future, making it less profitable to drill.\nIt's important to note that while Buffett is very confident in the future of Occidental, it's still less than 4% of Berkshire's equity portfolio and an even smaller percentage of the conglomerate's total holdings when you include its cash position and wholly owned subsidiaries. So, remaining diversified is key.\nShould you invest $1,000 in Occidental Petroleum right now?\nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nAdam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett Just Added $246 Million to 1 of Berkshire Hathaway's Top Holdings was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-24T14:53:56.000Z",
        "Title": "Warren Buffett: Charlie Munger was the 'architect' of the modern Berkshire Hathaway",
        "Author": " Myles Udland    · Head of News",
        "Text": "Warren Buffett's annual letter to Berkshire Hathaway (BRK-A, BRK-B) shareholders published Saturday morning marked the first missive sent to his investors since his longtime right-hand man, Charlie Munger, died last November at 99 years old.\nTo begin his letter to Berkshire shareholders, Buffett reminded readers of the role Munger played in creating what is now the country's largest conglomerate. A conglomerate, Buffett wrote Saturday, that has \"by far...the largest GAAP net worth recorded by any American business.\"\n\"In reality, Charlie was the 'architect' of the present Berkshire, and I acted as the 'general contractor' to carry out the day-by-day construction of his vision,\" Buffett wrote.\n\"Charlie never sought to take credit for his role as creator but instead let me take the bows and receive the accolades. In a way his relationship with me was part older brother, part loving father. Even when he knew he was right, he gave me the reins, and when I blundered he never — never — reminded me of my mistake.\"\n\"In the physical world, great buildings are linked to their architect while those who had poured the concrete or installed the windows are soon forgotten,\" Buffett wrote.\n\"Berkshire has become a great company. Though I have long been in charge of the construction crew; Charlie should forever be credited with being the architect.\"\nBuffett and Munger both grew up in Omaha, where Berkshire is still headquartered. The two, however, didn't meet until 1959, when Buffett was 29 and Munger 35.\nA lawyer by trade and a founding partner at the law firm Munger, Tolles, & Olson which bears his name, Munger was named vice chairman at Berkshire Hathaway in the late '70s.\nBut Munger and Buffett's investing relationship began long before this formal engagement, with Buffett writing Saturday it was Munger who told him in 1962, \"that I had made a dumb decision in buying control of Berkshire.\"\nAt the time, Berkshire Hathaway was a struggling textile manufacturer in New England. Textile operations later ended, but the Berkshire Hathaway of today still bears the company's name.\nBuffett wrote Saturday that, \"Charlie, in 1965, promptly advised me: 'Warren, forget about ever buying another company like Berkshire. But now that you control Berkshire, add to it wonderful businesses purchased at fair prices and give up buying fair businesses at wonderful prices. In other words, abandon everything you learned from your hero, Ben Graham. It works but only when practiced at small scale.' With much back-sliding I subsequently followed his instructions.\"\nElsewhere in his letter to shareholders, Buffett wrote, \"Our goal at Berkshire is simple: We want to own either all or a portion of businesses that enjoy good economics that are fundamental and enduring.\"\nBut Buffett noted the advice from Munger offered nearly 60 years ago to only buy \"wonderful businesses purchased at fair prices\" means the days Buffett and Berkshire Hathaway had plenty of investment opportunities to choose from are \"long behind us.\"\n\"This combination of the two necessities I've described for acquiring businesses has for long been our goal in purchases and, for a while, we had an abundance of candidates to evaluate,\" Buffett wrote.\n\"If I missed one — and I missed plenty — another always came along. Those days are long behind us; size did us in, though increased competition for purchases was also a factor.\"\nBerkshire purchased insurance company Alleghany for $11.6 billion in 2022 and took full control of rest stop operator Pilot earlier this year. Prior to these deals, the company hadn't made a sizable acquisition since its 2015 purchase of Precision Castparts for $37 billion.\n\"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others,\" Buffett continued.\n\"Some we can value; some we can't. And, if we can, they have to be attractively priced. Outside the U.S., there are essentially no candidates that are meaningful options for capital deployment at Berkshire. All in all, we have no possibility of eye-popping performance.\"\nBuffett also touched on the struggles at Berkshire's railroad and utilities businesses in 2023, with the latter serving as a \"severe earnings disappointment last year.\"\nIn Buffett's view, a shifting regulatory outlook in some states has \"broken\" a model that relied on private investment backed by what Buffett called a \"fixed-but-satisfactory-return\" for these operators. Agreements were made on a state-by-state basis.\n\"Whatever the case at Berkshire, the final result for the utility industry may be ominous: Certain utilities might no longer attract the savings of American citizens and will be forced to adopt the public-power model,\" Buffett wrote. \"Nebraska made this choice in the 1930s and there are many public-power operations throughout the country. Eventually, voters, taxpayers and users will decide which model they prefer.\n\"When the dust settles, America’s power needs and the consequent capital expenditure will be staggering. I did not anticipate or even consider the adverse developments in regulatory returns and, along with Berkshire’s two partners at BHE, I made a costly mistake in not doing so.\"\nAs he does most years, Buffett also took extensive time in this year's letter to write about his overarching investment philosophy and how it impacts the current iteration of Berkshire Hathaway.\nFor aspiring investors looking to Buffett for insights on how to manage their own portfolios, these passages are the main draw.\nThe modern Berkshire Hathaway, in Buffett's view, is built to both protect against and take advantage of the inevitable seizures and panics that have, and will again, gripped markets.\n\"Indeed, markets can — and will — unpredictably seize up or even vanish as they did for four months in 1914 and for a few days in 2001,\" Buffett wrote. \"If you believe that American investors are now more stable than in the past, think back to September 2008. Speed of communication and the wonders of technology facilitate instant worldwide paralysis, and we have come a long way since smoke signals. Such instant panics won't happen often — but they will happen.\"\nIn turn, Berkshire holds a pile of cash and highly-liquid Treasury bills that Buffett called \"far in excess of what conventional wisdom deems necessary.\"\nBerkshire also does not pay dividends — a preordained cash outlay for companies — and makes no commitment on the size of any future stock buybacks. Buffett runs Berkshire Hathaway in a manner that keeps cash on hand for the sake of keeping cash on hand, not for some planned future deployment.\n\"During the 2008 panic, Berkshire generated cash from operations and did not rely in any manner on commercial paper, bank lines or debt markets,\" Buffett wrote. \"We did not predict the time of an economic paralysis but we were always prepared for one.\n\"Extreme fiscal conservatism is a corporate pledge we make to those who have joined us in ownership of Berkshire.\"\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-02-27T12:02:32.000Z",
        "Title": "Berkshire shares end in red as US threatens to sue unit over wildfire costs (Feb. 26)",
        "Author": "  Niket  Nishant ",
        "Text": "(This Feb. 26 story has been refiled to fix the syntax in the headline)\nBy Niket Nishant\n(Reuters) - Warren Buffett-led Berkshire Hathaway's shares closed down by more than 2% on Monday, slowing its march to $1 trillion market value on investor worries after the U.S. government warned of a lawsuit against its power company, PacifiCorp.\nBerkshire disclosed the risk of a lawsuit against its unit over its alleged failure to cover $356 million in costs associated with the 2020 Slater wildfire in southern Oregon and northern California.\nThe investment conglomerate had warned on Saturday that the parent of PacifiCorp and one of Berkshire's biggest businesses outside insurance, Berkshire Hathaway Energy, was under pressure.\n\"It will be many years until we know the final tally from BHE's forest-fire losses and can intelligently make decisions about the desirability of future investments in vulnerable western states,\" Buffett wrote in his annual letter to shareholders.\nHe also toned down expectations for Berkshire's share price, saying it did not have many lucrative investment opportunities left, while reassuring investors that the biggest financial firm by market value was \"built to last\".\nThe 93-year-old investing legend told shareholders that Berkshire would perform slightly better than the \"average American corporation\", but anything beyond that is \"wishful thinking\", even though it had a cash pile of $167.6 billion.\n\"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others... All in all, we have no possibility of eye-popping performance,\" Buffett wrote.\nTRILLION-DOLLAR MILESTONE\nInvestors closely watch Berkshire as its results are often seen as a bellwether for the U.S. economy.\n\"While this reads as if Buffett is saying that global equities are fairly valued, the truth is more nuanced than that,\" Nicholas Colas, co-founder of DataTrek Research, wrote in a note.\n\"Berkshire is a huge business and needs to take substantial positions in large companies in order to 'move the needle'. Markets are generally good at pricing those sorts of stocks, hence the lack of opportunities.\"\nBerkshire's annual operating profit climbed 21%, to $37.4 billion on improved underwriting and higher investment income from the insurance segment. Operating profit for the fourth quarter also came in ahead of analysts' expectations.\nA $1 trillion market value would put Berkshire among a rarefied list of American businesses, which currently includes tech giants like Microsoft and Apple.\nBerkshire's Class A shares dropped 2.16%, while its Class B shares, which carry higher voting rights and whose value is 1/1,500th of Class A shares, slipped 1.94%. That left the conglomerate with a stock market value below $900 billion.\n\"We continue to believe shares are an attractive stock in an uncertain macro environment,\" UBS analyst Brian Meredith said.\nBuffett in his letter also mourned the passing of his longtime second-in-command Charlie Munger, while assuring investors that vice chairman and designated successor Greg Abel was \"ready to be CEO of Berkshire tomorrow\".\n(Reporting by Niket Nishant, Manya Saini and Jaiveer Singh Shekhawat in Bengaluru and additional reporting by Noel Randewich in San Francisco; Editing by Arun Koyyur and Pooja Desai)\n"
    }
]