[
    {
        "Date": "2024-03-23T08:56:00.000Z",
        "Title": "Berkshire Hathaway's Beating the Market, But Its Biggest Holdings Aren't. What Gives?",
        "Author": "  James Brumley, The Motley Fool ",
        "Text": "Over the course of the past few years, Warren Buffett's Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) has measurably outperformed the S&P 500 (SNPINDEX: ^GSPC). That's not exactly news, of course. The Oracle of Omaha's stock picks have beaten the broad market in most years since the company was taken over by Buffett back in 1965. Buffett's value-oriented regimen works!\nFor the past couple of years, however, something curious has happened. Berkshire stock is still beating the market. But the company's very biggest holdings, like Apple (NASDAQ: AAPL), Bank of America (NYSE: BAC), American Express (NYSE: AXP), and Coca-Cola (NYSE: KO), are at best merely keeping up with the S&P 500, or at worst severely lagging it.\nWhat gives?\nDividends explain part of the difference -- but only a small part. The dividends Berkshire's collected from the stocks it's holding still don't come close to fully explaining why the fund is doing so well when the stocks it's holding aren't. The remainder of the difference is rooted in something else well worth understanding, since it has implications for all investors, particularly for investors that like to borrow the occasional stock pick from Buffett.\nAnyone reading this likely already knows that while Berkshire holds about four dozen different stocks, it's not a particularly well-diversified fund. Its three biggest positions account for around 60% of Berkshire's entire stock portfolio. The next biggest three -- Coca-Cola, Chevron (NYSE: CVX), and Occidental Petroleum (NYSE: OXY) -- make up another 16% of the fund's picks. Just for good measure, we'll point out that Kraft Heinz (NASDAQ: KHC) is its seventh-biggest position. At a mere 3% of the value of all of Berkshire Hathaway's stocks, however, it's far from being a high-impact holding. All told, these seven stocks account for more than 80% of the total value of the fund's positions in publicly traded companies. If Berkshire Hathaway is going to rise or fall, it's seemingly going to happen because of these tickers.\nAnd yet for the past one-year and two-year timeframes, six out of seven of these tickers have underperformed the S&P 500, while Berkshire shares have outperformed the S&P 500.\n \n% of Portfolio\n4-Year Chg.\n3-Year Chg.\n2-Year Chg.\n1-Year Chg.\nBerkshire Hathaway\n \n137%\n62%\n18%\n36%\nS&P 500\n \n114%\n32%\n15%\n31%\nApple\n43%\n188%\n47%\n4%\n12%\nBank of America\n10%\n70%\n(6%)\n(18%)\n30%\nAmerican Express\n9%\n187%\n57%\n16%\n36%\nCoca-Cola\n7%\n44%\n18%\n(1%)\n0%\nChevron\n5%\n173%\n51%\n(4%)\n0%\nOccidental Petroleum\n4%\n489%\n127%\n7%\n9%\nKraft Heinz\n3%\n58%\n(10%)\n(7%)\n(6%)\nData source: TradeStation\nHow is this possible? If it's not coming from Berkshire's biggest stock positions, where's all of this value coming from?\nIt's an often-forgotten detail about Berkshire Hathaway, but it's not a mutual fund. It's a conglomerate that just so happens to use much of its idle cash to hold stocks of publicly traded companies. The conglomerate itself owns over 60 privately held companies, including familiar ones like GEICO Auto Insurance, Pilot Travel Centers, railroad company BNSF, Dairy Queen, Duracell, flooring company Shaw, and Clayton Homes, just to name a few. These are sound businesses as well. And arguably far more so than Berkshire's individual stock holdings, these privately owned businesses are geared first and foremost to generate cash for the parent company. Depending on the year, all of Berkshire's holdings combined generate between $40 billion and $50 billion worth of operating cash flow per year.\nTo put this figure in perspective, Berkshire Hathaway's current market cap stands around $900 billion, less than half of which is made up of the sum value of all the stocks it holds. These stocks couldn't even come close to producing the bulk of this operating cash flow. Most of Berkshire's cash generation (which carried it to a record hoard of $167.6 billion as of the end of last year) comes from its privately held businesses.\nThe problem for investors is obvious: Outside of owning a stake in Berkshire, you can't invest in any of Berkshire Hathaway's privately owned entities like Duracell batteries, GEICO, or See's Candies -- they're not publicly traded. For investors who wholeheartedly believe in doing things exactly the way Warren Buffett does them, this presents a clear challenge.\nThere are some similar alternatives, however, for investors willing to venture off the beaten path.\nYou've likely heard the term \"private equity,\" perhaps without fully knowing what it means. It's not complicated. Just as the name suggests, private equity firms supply promising up-and-coming companies with capital, usually in the form of a loan, but sometimes in exchange for an equity stake in a company. Ordinary investors can't make such deals. But ordinary investors can buy shares of private equity firms, plugging into the premise of owning budding businesses that aren't publicly traded.\nBlackstone (NYSE: BX) is one of these private equity firms, and it's a good one. Share prices are up nearly 50% for the past year, and higher to the tune of 250% for the past five.\nDriving these gains is its underlying portfolio of client/customer companies. It's currently funding 126 different outfits, including Ancestry.com, Emerson Climate Technologies, dating app Bumble, and Hello Sunshine (a media business launched by actress Reese Witherspoon). None of these are companies you can directly invest in on your own.\nPublicly traded private equity firms aren't your only means of plugging into otherwise-uninvestable companies, however. A category of organizations called business development companies (or BDCs) can do the job too. Take Prospect Capital (NASDAQ: PSEC) as an example. In many ways, it functions like a private equity firm by virtue of providing capital to mid-sized companies that may not qualify for conventional loans but also aren't ready to go public just yet. All told, Prospect is working with over 100 different companies including Shutterfly, Staples, Credit.com, and playground equipment maker PlayPower.\nThe key difference between Prospect and Blackstone is that Prospect Capital is mostly built from the ground up to generate dividend income from its loans rather than drive capital appreciation. Prospect is currently yielding an impressive 13.2%.\nBlackstone and Prospect Capital obviously aren't the only private equity (or business development company) outfits out there. Indeed, there may be far more of these private investment and BDC options to choose from than you ever might have imagined. And they're all increasingly worth a look, particularly given how the overall stock market continues to inch toward uncomfortably high valuations. As was noted, not even Buffett is nibbling here, and he's never been one to shy away from a worthy investment just because he might have to pay a bit of a premium for it. Maybe you shouldn't be nibbling on conventional stocks either.\nPrivate companies, however, are a compelling alternative to ordinary stocks. And not just right now. If the market's current volatility and persistently rich valuations become the new norm, perhaps more investors should be taking bigger, more serious looks at these truly alternative ways of putting your money to work.\nThis might help drive the point home: Capital markets data company Preqin suggests the current private credit market is worth on the order of $1.5 trillion right now, but by 2027 could be worth $2.2 trillion. In a similar vein, market research outfit Technavio predicts the worldwide private equity market will be about 50% bigger in 2027 than it is now.\nTo this end, maybe Buffett is onto something, recognizing that conventional stocks just aren't promising enough given their current prices. He seems to be pretty content with -- and doing pretty well with -- Berkshire's privately owned businesses.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. James Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Blackstone, and Chevron. The Motley Fool recommends Kraft Heinz and Occidental Petroleum. The Motley Fool has a disclosure policy.\nBerkshire Hathaway's Beating the Market, But Its Biggest Holdings Aren't. What Gives? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-15T09:34:00.000Z",
        "Title": "Is Berkshire Hathaway Stock a Buy?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) stock just went on a historic run.\nOver the past 12 months, the stock price has surged by 25%. Over the past five years, meanwhile, shares have more than doubled in value.\nBerkshire's stock price rarely rises this quickly over such a short amount of time. Is the stock still a buy? The answer might surprise you.\nBerkshire is a behemoth stock. After the recent surge, the company now has a market cap of nearly $900 billion.\nA chunk of that value is represented by Berkshire's insurance companies, which generate billions of dollars in investible cash. The vast majority of the company's value, however, is produced through its portfolio of business investments, which includes hundreds of positions across dozens of industries and geographies.\nFor example, Berkshire is the sole owner of Burlington Northern Santa Fe, one of the largest railroad businesses in North America. It fully owns many other well-known businesses including Lubrizol, a special chemicals company, See's Candies, a chocolatier, and Duracell, the battery maker. Berkshire also has a broad investment portfolio of publicly traded securities. Some its more notable positions include Amazon, American Express, Coca-Cola, and Apple.\nWhen approaching a diverse and complex business like this, perhaps the most important number to pay attention to is its price-to-book ratio.\nWhile there are some notable flaws behind book value, this accounting metric can be used to roughly approximate the value of a company's assets. A price-to-book ratio, therefore, gives you a sense of how much the market is willing to pay for a company's asset base. Over the past decade, Berkshire's price-to-book ratio has ranged between 1.0 and 1.6.\nThat 1.0 times book valuation occurred during the pandemic bear market. In hindsight, it was a great buying opportunity.\nThe 1.6 times book valuation, meanwhile, occurred only weeks ago. It was the stock's highest valuation multiple since 2008. Shares have pulled back a touch since then, but make no mistake: Berkshire stock is expensive compared to its past.\nThere's no doubt that right now isn't the best time in history to buy Berkshire stock. But as we'll see, that doesn't mean shares aren't a buy.\nOver the last decade, Berkshire's price-to-book ratio has risen by roughly 15%. That increase in valuation multiple accounts for part of the stock's positive performance, but only a small part.\nOver the same period, Berkshire's stock price has risen by around 230%. That means the bulk of the stock's performance wasn't an increase in the price-to book ratio, but an increase in the underlying metric: book value.\nIn 2015, Berkshire's book value was roughly $250 billion. Today, it is around $560 billion.\nSo yes, the stock's price-to-book ratio has increased, but the stock's performance is no mirage. Berkshire shares have largely risen on improving fundamentals.\nHistorically, there has never been a bad time to buy Berkshire stock. If you bought shares at the height of the dot-com bubble, you'd be sitting on a 1,000% gain. Happen to buy the stock right before the 2008 financial crash? No problem. Today, your investment would be worth nearly four times its original value.\nTo be sure, Berkshire stock may someday become overvalued, but not at a measly 1.5 times book value. Buffett and his investment team have consistently figured out ways to grow shareholder value over the long term, and short-term swings in valuation have never hindered the stock's long-term investment thesis.\nOf course, we all wish we bought Berkshire stock before the recent run. But now is still a wonderful time to take a position in one of the market's longtime winners. Just be sure to hold through the volatility if the valuation multiple normalizes.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway Stock a Buy? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-01T12:59:00.000Z",
        "Title": "Berkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why",
        "Author": "  Collin Brantmeyer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) recently released its annual report, revealing that the conglomerate holding company held a record high of $168 billion in cash and cash equivalents at the end of 2023. With that staggering amount of cash, many investors may question how Chairman and Chief Executive Officer Warren Buffett might put it to work. Lucky for us, Buffett outlined why he is hoarding the cash in his annual letter to shareholders.\nLet's look at how Berkshire built its unprecedented cash hoard, what the company currently does with its cash, and what it might take for Buffett to deploy it meaningfully.\nBuffett's preferred metric for Berkshire's success is operating earnings -- a measurement of a company's profit from its core operations after expenses. In 2023, Berkshire generated $37.4 billion in operating earnings, an increase of 21% from $30.9 billion in 2022.\nAs a result of Berkshire's strong business performance, and being a net seller of its stock holdings in 2023, the company's cash position soared from $128.5 billion to $167.8 billion, or an increase of 31%.\nIn the near term, Buffett appears content with holding the majority of Berkshire's cash in Treasury bills -- a short-term security backed by the U.S. Treasury Department with a maturity of one year or less.\nAs of Dec. 31, Berkshire held an astounding $133.4 billion in Treasury bills, with yields in the neighborhood of 5% to 5.4%. If yields remain on the low end of that range throughout 2024 and Berkshire maintains its current position, the company will generate about $7 billion from those investments.\nIn past annual shareholder letters, Buffett has emphasized that Treasury bills serve as Berkshire's \"default\" choice for the company's cash when compelling investment opportunities are scarce, owing to their liquidity and safety.\nAdditionally, Buffett once wrote: \"Over the long term, however, [Treasury bills] are riskier investments -- far riskier investments -- than widely diversified stock portfolios that are bought over time.\" The risk Buffett is referring to isn't that the U.S. government won't pay, but that Treasury bills often lose money to inflation. That isn't the case in the short term, with the current inflation rate in the U.S. at 3.1% during the past 12 months, according to the consumer price index.\nAnother way Buffett utilizes its mountain of cash is by repurchasing shares of Berkshire Hathaway. In 2023, Berkshire spent $9.2 billion on share repurchases, lowering its shares outstanding by 1.1%. During the past 10 years, Berkshire has lowered its shares outstanding by 12.2%. By reducing its share count, Berkshire rewards existing shareholders by increasing their ownership stake.\nBerkshire could return capital to its shareholders through dividends, but that route seems unlikely, considering the company has never paid one during Buffett's tenure.\nOtherwise, Berkshire could continue to make acquisitions -- it bought insurer Alleghany Corporation for about $11.6 billion in 2022, and it recently purchased the final 20% ownership interest in the travel center network Pilot Flying J for a total investment of roughly $13.6 billion.\nBerkshire also holds a portfolio of stocks estimated to be worth $372 billion, including a $165 billion stake in Apple, and can continue to add to it with its mountain of cash.\nOne downside Berkshire faces, given its market capitalization of nearly $900 billion, is that Buffett may struggle to find stocks worth buying that will make a meaningful return. Buffett touched on this point in his most recent annual shareholder letter: \"Given Berkshire's present size, building positions through open-market purchases takes a lot of patience and an extended period of \"friendly\" prices. The process is like turning a battleship. That is an important disadvantage which we did not face in our early days at Berkshire.\"\nDespite having a mountain of cash at his disposal, Warren Buffett is unlikely to deploy the majority of it any time soon. In part, that's because, as an insurance company, Berkshire will always need a cash reserve in the event of catastrophic losses. The company's float, or premiums that its insurance customers paid upfront, can be used for investments, but it is also needed to settle claims. To that effect, Buffett has frequently stated that Berkshire will never hold less than $30 billion in cash and cash equivalents.\nIn addition, Buffett does not want to see his beloved company fall victim to an economic crisis similar to the Great Recession in 2008. The Oracle of Omaha recently explained his stance on Berkshire's current cash position:\nExtreme fiscal conservatism is a corporate pledge we make to those who have joined us in ownership of Berkshire. In most years -- indeed in most decades -- our caution will likely prove to be unneeded behavior -- akin to an insurance policy on a fortress-like building thought to be fireproof. But Berkshire does not want to inflict permanent financial damage.\nBerkshire Hathaway has generated an incredible compound annual gain of 19.8% from 1965, when Buffett took control, to 2023, significantly outpacing the S&P 500's compound annual gain of 10.2%. While Berkshire's growth prospects may be limited in some regards, there is simply no other public company in the market as well-positioned for a market downturn. That alone makes Berkshire Hathaway a solid addition to any stock portfolio.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nCollin Brantmeyer has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Is Hoarding $168 Billion in Cash -- Here's Why was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-10T12:25:00.000Z",
        "Title": "This Is the Biggest Thing Holding Back Berkshire Hathaway, According to Warren Buffett",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "At the start of every Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) annual report, the company provides a list that compares its stock performance against the S&P 500 since 1965, the year Warren Buffett took control of the company. The track record is impressive.\nInvestors who came on board with Buffett back in 1965 have seen their money compound at an average annual rate of 19.8%. The S&P 500 has returned an average of 10.2% during that same period. Over 59 years, that translates into a cumulative return 140 times greater than holding the S&P 500.\nGoing forward, Buffett himself doesn't think investors should expect those types of market-crushing returns. He still thinks it's a great company to own, but there's a big thing holding back its ability to grow like it used to.\nThe biggest challenge Buffett faces in driving outsize returns for shareholders comes down to the law of large numbers. Berkshire Hathaway isn't the $20 million company it was in the 1960s when Buffett first bought shares. It's not even the $100 billion company it was at the start of the century. It's now rapidly closing in on a $1 trillion market cap.\nWhat's more, the vast majority of Berkshire's businesses and holdings aren't in massive growth industries that can support strong growth. The company invests in and/or owns steady cash-generating businesses like insurance and railroad transport.\nFor a long time, Buffett generated growth for shareholders by taking the cash from those businesses and buying all or part of a new business. Describing what exactly Berkshire Hathaway does, Buffett writes in his most recent letter to shareholders, \"We want to own either all or a portion of businesses that enjoy good economics that are fundamental and enduring.\"\nBut when you're already the eighth-largest business by market cap in the world, it's hard to find a business that can have an outsize impact on the value of the holding company.\n\"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others,\" Buffett wrote to investors. \"Some we can value; some we can't. And, if we can, they have to be attractively priced.\"\nSo, not only are there only a handful of companies in the investable universe for Berkshire that have potential within Berkshire's portfolio, but Buffett also suggests a lot of the market is currently overpriced. That's led him to build a record cash hoard of $167.6 billion, which he's primarily invested in short-term Treasury bills.\nBuffett's somewhat pessimistic outlook for the future of Berkshire Hathaway may have some investors wondering whether it's time to sell.\nWhile Buffett doesn't think his company is about to double in value within the next five years, he's not completely down on his own company. He likes the present mix of businesses owned by Berkshire, describing them as having \"somewhat better prospects than exist at most large American companies.\" (He's never been one to be too boastful.)\nAs such, Buffett suggests returns for Berkshire Hathaway shareholders should be \"a bit better than the average American corporation.\" He also notes Berkshire stock comes with materially less risk of permanent loss of capital.\nBut investors shouldn't discount Berkshire Hathaway's cash position. Not only does it offer great downside protection, but it also puts Buffett and his team of investment managers in a spot to take advantage of a market opportunity, should one present itself. There are only a handful of companies Berkshire couldn't afford to make a sizable investment in, if not purchase outright.\nBut as Buffett noted in his 2009 letter to shareholders, \"Big opportunities come infrequently.\" A decade and a half later he might add that massive opportunities are even more infrequent.\nThat's why Buffett thinks Berkshire will still do a bit better than average. \"Anything beyond 'slightly better,' though, is wishful thinking,\" he warns.\nShould you invest $1,000 in Berkshire Hathaway right now?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 8, 2024\nAdam Levy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nThis Is the Biggest Thing Holding Back Berkshire Hathaway, According to Warren Buffett was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-07T16:41:26.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Is Sitting On A Massive $167.6 Billion Cash Pile — It's More Than The GDP Of These Countries",
        "Author": "  Chris Bibey ",
        "Text": "In 1965, a young Warren Buffett was taking a risk by purchasing textiles company Berkshire Hathaway Inc.\nFast-forward to today, and the company owns nearly 50 publicly traded securities and a handful of private companies.\nBerkshire Hathaway is sitting on a cash pile of more than $167 billion. Yes, that's a billion with a \"B.\"\nDon't Miss:\nAround 56% Of Americans Feel Behind On Saving For Retirement – Will you make enough each month?\nCan living off interest from a $1 million investment support my retirement dreams?\nSince Day One, Buffett has followed the same investing strategy. And with Berkshire Hathaway earning a compound annual return of 19.8% since he took over in 1965, it's safe to assume that the strategy works.\nHe adheres to a straightforward investment philosophy that centers on acquiring businesses known for their profitability, consistent growth and robust management structures.\nTo better understand just how much $167.6 billion is, here is a list of 10 countries with a lower gross domestic product (GDP) than Berkshire's cash load:\nUkraine: $161 billion\nMorocco: $134 billion\nEthiopia: $127 billion\nSlovakia: $115 billion\nEcuador: $115 billion\nOman: $115 billion\nDominican Republic: $114 billion\nKenya: $113 billion\nAngola: $107 billion\nBulgaria: $89.04 billion\nThat puts into perspective just how much money Buffett and Berkshire Hathaway have stocked away over the years.\nMirroring Buffett’s investment strategy might seem daunting, given his legendary status in the financial world, but his approach is surprisingly accessible for investors at any level.\nHere's how you can follow in Buffett's footsteps and potentially carve out your path of investment success.\nTrending: Are you rich? Here’s what Americans think you need to be considered wealthy.\nBuffett's investments are not about quick wins; they’re about believing in the long-term potential of the companies he invests in. He chooses companies with enduring qualities and a proven track record of growth.\nAs an investor, focusing on long-term gains rather than short-term fluctuations is crucial.\nBuffett advises investors to stick to their circle of competence. This means investing in industries you understand well. By doing so, you can make informed decisions based on your knowledge and expertise, reducing the risk of unexpected setbacks.\nOne of the key factors in Buffett's strategy is investing in companies with a strong moat. This refers to a business’s ability to maintain competitive advantages over its competitors to protect its market share and profitability. These advantages can be brand recognition, proprietary technology or regulatory barriers.\nBuffett is known for his value investing approach, looking for stocks that are undervalued by the market. He assesses the intrinsic value of a company based on its fundamentals, such as earnings, dividends and growth potential, and invests when its stock is trading for less than what he believes it is worth.\nPatience is a virtue in investing, and Buffett exemplifies this. He waits for the right opportunity to buy stocks at a price that makes sense. Once he invests, he holds onto his positions for years, if not decades.\nThis patience allows investments to mature and compound, which has been critical to Berkshire Hathaway’s success.\nConsulting a financial advisor can help you better understand how to invest in your future. A professional can offer personalized advice to help you make the best possible short- and long-term investing decisions.\nRead Next:\nThe average American couple has saved this much money for retirement — How do you compare?\nThe average American has $65,100 in their savings account — How do you compare?\n*This information is not financial advice, and personalized guidance from a financial adviser is recommended for making well-informed decisions.\nChris Bibey has written about personal finance and investment for the past 15 years in a variety of publications and for a variety of financial companies. He is not a licensed financial adviser, and the content herein is for information purposes only and is not, and does not constitute or intend to constitute, investment advice or any investment service. While Bibey believes the information contained herein is reliable and derived from reliable sources, there is no representation, warranty or undertaking, stated or implied, as to the accuracy or completeness of the information.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Warren Buffett's Berkshire Hathaway Is Sitting On A Massive $167.6 Billion Cash Pile — It's More Than The GDP Of These Countries originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-03-25T15:30:02.000Z",
        "Title": "Why Is Berkshire Hathaway (BRK.B) Down 1.4% Since Last Earnings Report?",
        "Author": "  Zacks Equity Research ",
        "Text": "It has been about a month since the last earnings report for Berkshire Hathaway B (BRK.B). Shares have lost about 1.4% in that time frame, underperforming the S&P 500.\nWill the recent negative trend continue leading up to its next earnings release, or is Berkshire Hathaway due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important catalysts.\nBerkshire Hathaway Q4 Earnings Rise Year Over YearBerkshire Hathaway delivered fourth-quarter 2023 operating earnings of $8.5 billion, which increased 28% year over year. The increase was driven by higher earnings in Insurance-underwriting and Insurance-investment income.\nCosts and expenses increased 20.5% year over year to $321.1 billion, largely due to an increase in expenses at Insurance and Other as well as Railroad, Utilities and Energy. Operating earnings from the Railroad business decreased 7.7% year over year to $1.3 billion.\nRevenues increased 20.7% year over year to $364.5 billion, attributable to higher revenues at Insurance and Other, as well as Railroad, Utilities and Energy.Berkshire Hathaway’s Insurance and Other segment revenues increased 5.2% year over year to $263 billion in the reported quarter on the back of higher insurance premiums earned, leasing revenues and Interest, dividend and other investment income.Insurance underwriting after-tax earnings were $5.4 billion in 2023 against losses of $30 million in the year-ago quarter. Earnings in 2023 benefited from relatively low losses from significant catastrophe events during the year and improved underwriting results at GEICO.Railroad, Utilities and Energy operating revenues increased 94.5% year over year to $101.4 billion, attributable to higher freight rail transportation revenues, utility and energy operating revenues and service revenues and other income.Pre-tax earnings of Railroad decreased 14.2% year over year to $6.6 billion.Total revenues at Manufacturing, Service and Retailing increased 0.4% year over year to $168 billion. Pre-tax earnings increased 2.5% year over year to $16.6 billion.In 2023, earnings from the Manufacturing, Service and Retailing businesses rose 1.9% year over year.\nAs of Dec 31, 2023, consolidated shareholders’ equity was $561.3 billion, up 18.5% year over year. At quarter-end, cash and cash equivalents were $38.6 billion, up 6.2% from the level at 2022 end.Berkshire exited the fourth quarter of 2023 with a float of about $169 billion, up from $164 billion reported at the end of 2022.Cash flow from operating activities totaled $49.2 billion in 2023, up 31.7% from the year-ago period.Berkshire Hathaway bought back shares worth $9.2 billion in 2023.\nHow Have Estimates Been Moving Since Then?\nAnalysts were quiet during the last two month period as none of them issued any earnings estimate revisions.\nVGM Scores\nAt this time, Berkshire Hathaway has a subpar Growth Score of D, however its Momentum Score is doing a bit better with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\nOverall, the stock has an aggregate VGM Score of D. If you aren't focused on one strategy, this score is the one you should be interested in.\nOutlook\nBerkshire Hathaway has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.\nPerformance of an Industry Player\nBerkshire Hathaway is part of the Zacks Insurance - Property and Casualty industry. Over the past month, Palomar (PLMR), a stock from the same industry, has gained 7.9%. The company reported its results for the quarter ended December 2023 more than a month ago.\nPalomar Holdings reported revenues of $102.35 million in the last reported quarter, representing a year-over-year change of +16.6%. EPS of $1.11 for the same period compares with $0.82 a year ago.\nFor the current quarter, Palomar Holdings is expected to post earnings of $0.93 per share, indicating a change of +16.3% from the year-ago quarter. The Zacks Consensus Estimate has changed +0.8% over the last 30 days.\nPalomar Holdings has a Zacks Rank #1 (Strong Buy) based on the overall direction and magnitude of estimate revisions. Additionally, the stock has a VGM Score of D.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nPalomar Holdings, Inc. (PLMR) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-26T13:00:14.000Z",
        "Title": "Is Trending Stock Berkshire Hathaway Inc. (BRK.B) a Buy Now?",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nOver the past month, shares of this company have returned +0.2%, compared to the Zacks S&P 500 composite's +2.7% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway falls in, has lost 0.5%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Berkshire Hathaway is expected to post earnings of $3.41 per share, indicating a change of -7.6% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nThe consensus earnings estimate of $18.50 for the current fiscal year indicates a year-over-year change of +7.7%. This estimate has remained unchanged over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $22.03 indicates a change of +19.1% from what Berkshire Hathaway is expected to report a year ago. Over the past month, the estimate has changed +3.3%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Berkshire Hathaway.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nIn the case of Berkshire Hathaway, the consensus sales estimate of $81.03 billion for the current quarter points to a year-over-year change of -5.1%. The $359.6 billion and $389.82 billion estimates for the current and next fiscal years indicate changes of -1.3% and +8.4%, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway reported revenues of $93.38 billion in the last reported quarter, representing a year-over-year change of +19.5%. EPS of $3.92 for the same period compares with $3.05 a year ago.\nCompared to the Zacks Consensus Estimate of $76.73 billion, the reported revenues represent a surprise of +21.69%. The EPS surprise was +120.22%.\nOver the last four quarters, Berkshire Hathaway surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-04T12:42:00.000Z",
        "Title": "Here's Why Warren Buffett-Led Berkshire Hathaway Doesn't Want to Own 100% of Occidental Petroleum Stock",
        "Author": "  Daniel Foelber, The Motley Fool ",
        "Text": "Occidental Petroleum (NYSE: OXY) is a $53.3 billion exploration and production company headquartered in Houston, Texas. It isn't the size of Apple, Bank of America, American Express, Coca-Cola, or Chevron (NYSE: CVX) -- Berkshire Hathaway's (NYSE: BRK.A) (NYSE: BRK.B) top five holdings (all have a market cap over $150 billion).\nYet, Berkshire has invested over $15 billion in Oxy, owning a staggering 28.2% of the entire company. Five years ago, Berkshire owned no Oxy stock.\nAt this rate, it would be easy to assume that Buffett and his team would buy out the whole company. But Buffett sent a clear message that this wouldn't be the case. Here's why.\nBuffett wrote the following in his 2023 letter to shareholders:\nAt year-end, Berkshire owned 27.8% of Occidental Petroleum's common shares and also owned warrants that, for more than five years, give us the option to materially increase our ownership at a fixed price. Though we very much like our ownership, as well as the option, Berkshire has no interest in purchasing or managing Occidental. We particularly like its vast oil and gas holdings in the United States, as well as its leadership in carbon-capture initiatives, though the economic feasibility of this technique has yet to be proven. Both of these activities are very much in our country's interest.\nHe then spent the next few paragraphs discussing the shale revolution, U.S. energy independence, and why the oil and gas industry is good for America. He also praised Oxy's management.\nUnder Vicki Hollub's leadership, Occidental is doing the right things for both its country and its owners. No one knows what oil prices will do over the next month, year, or decade. But Vicki does know how to separate oil from rock, and that's an uncommon talent, valuable to her shareholders and to her country.\nIn sum, Buffett likes being a participant in Oxy but not necessarily managing the business. The hands-off approach makes sense once factoring in Berkshire's total holdings.\nOxy is the sixth-largest public equity holding in Berkshire's portfolio. The fifth-largest is Chevron. Also, as a newcomer, the position has been built up in less than four years. In fact, Chevron was the only significant stock purchase Berkshire made in the fourth quarter of 2023 -- besides repurchasing Berkshire Hathaway shares. Berkshire increased its Chevron stake by 14.4%, marking the first time Berkshire bought the stock in over a year. Berkshire now owns 6.8% of Chevron.\nCombined, Berkshire's stakes in Chevron and Oxy are worth over $34 billion, nearly as much as Berkshire's second-largest public equity holding -- Bank of America. Yet Berkshire's true exposure to energy extends far beyond that through its 92% stake in Berkshire Hathaway Energy (BHE). It's hard to put a price tag on BHE, but some estimates say it is worth $90 billion.\nAnalyzing Oxy within the context of Berkshire's overall exposure to oil and gas and utilities, particularly in conjunction with its Chevron stake, makes it easier to understand why Berkshire doesn't want to go full throttle and buy out Oxy.\nNot only is Oxy a smaller company than many of Berkshire's other top holdings, but it is also far riskier. Oxy is known for supporting an expensive capital spending program, leveraging its balance sheet with debt to accelerate growth or afford an acquisition, and being extremely optimistic about the output of the Permian Basin in West Texas and Eastern New Mexico.\nCEO Vicki Hollub has been a somewhat controversial executive. In retrospect, Oxy's purchase of Anadarko Petroleum in 2019 (when it outbid Chevron) was a bad deal, especially considering how much cheaper it would have been to buy Anadarko in the years that followed. But the deal and leverage helped Oxy post a phenomenal performance in 2022 and, to a lesser extent, 2023.\nThe outperformance allowed Oxy to pay down debt and improve its balance sheet. But in December, Oxy announced it would buy Permian producer CrownRock L.P. with, you guessed it, mostly debt.\nHollub's ultra-aggressive style in a cyclical and highly volatile industry couldn't be more different than stodgy Buffett stocks like Coca-Cola. By comparison, Chevron has an incredible balance sheet with barely any debt for its size and a diversified business that spans more than just upstream production.\nBerkshire's notable increase in its Chevron stake, paired with Buffett's statement that Berkshire isn't interested in buying out Oxy, showcases that Berkshire is bullish on U.S. oil and gas, just not solely through the lens of an aggressive upstream producer.\nI could see Berkshire simply holding its existing Oxy stake and slowly increasing its stake in Chevron, another major, or maybe even another Permian producer like ConocoPhillips or EOG Resources.\nThe headline news may indicate that Berkshire isn't bullish on Oxy or oil and gas. But once we dig deeper into the inner workings of the overall portfolio, it becomes more apparent that the decision isn't so much about the industry as it is about position sizing and allocation.\nShould you invest $1,000 in Occidental Petroleum right now?\nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Chevron, and EOG Resources. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nHere's Why Warren Buffett-Led Berkshire Hathaway Doesn't Want to Own 100% of Occidental Petroleum Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-28T13:05:00.000Z",
        "Title": "Eli Lilly vs. Berkshire Hathaway: Which Stock Will Become the Next Member of the $1 Trillion Club?",
        "Author": "  David Jagielski, The Motley Fool ",
        "Text": "Getting to a $1 trillion market cap is a huge achievement for a company, as only the best of the best can join that club. Not only do companies need to generate strong results, but investors also need to be optimistic about their future growth for their valuations to reach such highs. Two stocks that aren't at $1 trillion just yet but are the closest to that mark today are Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) and Eli Lilly (NYSE: LLY).\nBerkshire Hathaway's $890 billion valuation is around $160 billion more than what Eli Lilly is worth today (approximately $730 billion), but in a volatile market, things can change quickly. Is Berkshire a lock to be the next $1 trillion stock, or does Eli Lilly have a realistic shot of getting there first?\nOne number which highlights the difference in excitement around these stocks is the price-to-earnings (P/E) multiple. At more than 130, investors are paying a massive premium for Eli Lilly's stock. Meanwhile, Berkshire looks like it may be incredibly undervalued, with its P/E multiple a lowly 9. Berkshire invests in many different businesses, but insurance is core to its operations. That is, unfortunately, not a terribly exciting business for many investors, even if billionaire investor Warren Buffett is the face of it.\nOver the past 12 months, shares of Eli Lilly have soared by 130% while Berkshire's stock has risen by 37%. Both stocks have outperformed the S&P 500, which is up 32% over that period -- but while Berkshire stock has merely beaten the index, Eli Lilly has skyrocketed past it.\nEli Lilly certainly has the hype factor, with investors clearly willing to pay a significant premium for the earnings growth that may lie ahead for the business.\nThe big catalyst for Eli Lilly over the past year has undoubtedly been the excitement surrounding tirzepatide, which is the active ingredient in two of its approved drugs -- Mounjaro (for diabetes) and Zepbound (for weight loss). Tirzepatide is a glucagon-like peptide 1 (GLP-1) agonist which helps curb appetite, which, in turn, enables patients to lose weight.\nAnd it's not just a little weight. Clinical trials have shown that people using tirzepatide lost an average of 26.6% over an 84-week period, when also making lifestyle changes. Zepbound has the potential to be one of the hottest weight-loss drugs ever. This year, multiple analysts believe it will generate more than $2 billion. But in the long run, the upside could be in the tens of billions of dollars in a weight-loss market that Goldman Sachs believes could top $100 billion.\nAs Zepbound grows in popularity and potentially becomes a hot trend on social media like Ozempic (which isn't approved for weight loss, though many people have been taking the diabetes medication for that reason), there could be even more bullishness about the stock. And if that happens, it wouldn't be a surprise to see Eli Lilly's stock soar past Berkshire's.\nBig gains haven't been the norm for Berkshire Hathaway stock. While it's been doing fairly well over the past 12 months, expecting large gains (over 20%, for example) may be a bit too optimistic given that it isn't your typical growth stock focused on aggressive expansion.\nI suspect investors have been piling into Berkshire shares lately, partly due to the safety and stability that the stock offers. But as interest-rate cuts take place, that may change and more money could flow into higher-priced stocks such as Eli Lilly. It may seem like a long shot -- but I think Eli Lilly can get to $1 trillion first, despite Berkshire's sizable lead.\nMore importantly, Eli Lilly has a growing presence and strong results in the anti-obesity market. In the long run, it's the better option for growth-oriented investors.\nShould you invest $1,000 in Eli Lilly right now?\nBefore you buy stock in Eli Lilly, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Eli Lilly wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 25, 2024\nDavid Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Goldman Sachs Group. The Motley Fool has a disclosure policy.\nEli Lilly vs. Berkshire Hathaway: Which Stock Will Become the Next Member of the $1 Trillion Club? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-18T18:52:57.000Z",
        "Title": "Berkshire Hathaway speeds up stock buybacks",
        "Author": "Reuters ",
        "Text": "(Reuters) - Berkshire Hathaway has increased its pace of repurchasing its own shares, a sign that longtime Chairman Warren Buffett considers them undervalued and a good place to spend excess cash.\nIn its proxy filing on Friday, Berkshire said it repurchased the equivalent of 3,808 Class A shares this year through March 6, spending approximately $2.2 billion to $2.4 billion depending on the dates of the buybacks.\nNearly three-quarters of the repurchases took place after Feb. 12.\nBerkshire repurchased $2.2 billion of its own stock in last year's fourth quarter, and $9.2 billion in all of 2023.\nIts peak year for buybacks was 2021, when they totaled $27 billion.\nBuffett, 93, has run Omaha, Nebraska-based Berkshire since 1965, and oversees buybacks and other major capital allocation decisions.\nRepurchases help Buffett deploy some of the conglomerate's cash and equivalents, which totaled $167.6 billion at year end.\nBerkshire has said it will maintain a $30 billion cash cushion, and that \"financial strength and redundant liquidity will always be of paramount importance.\"\nThrough Friday, Berkshire's share price was up 14% this year, about twice the gain for the Standard & Poor's 500.\n(Reporting by Jonathan Stempel in New York; Editing by Marguerita Choy)\n"
    },
    {
        "Date": "2024-03-29T16:36:06.000Z",
        "Title": "Despite Warren Buffett's Warnings Calling Bitcoin 'Rat Poison,' Berkshire Hathaway Continues Profiting Off Crypto",
        "Author": "  Caden Pok ",
        "Text": "Though many of the top asset managers and investors are investing in, or at least open to crypto and Bitcoin, a few remain hesitant to adopt the asset. Most prominent among the anti-Bitcoin camp is legendary investor Warren Buffett.\nBuffett's strategy of investing in solid companies that continuously generate cash and value has been hugely successful. This has allowed his company Berkshire Hathaway Inc. to sustain itself through market peaks and troughs.\nDon't Miss:\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, how much would $10 get you today?\nBuffett is notorious for his anti-Bitcoin stance, saying in a 2018 interview with Yahoo! Finance, \"If you buy something like Bitcoin or some cryptocurrency, you don’t really have anything that has produced anything. You’re just hoping the next guy pays more.\"\nAt the 2022 Berkshire shareholders meeting, Buffett explained his stance on Bitcoin saying, \"If you told me you own all of the Bitcoin in the world and you offered it to me for $25, I wouldn’t take it because what would I do with it? I’d have to sell it back to you one way or another. It isn’t going to do anything.\"\nBuffett is against Bitcoin and crypto in general. However, this stance does not entirely translate into his company's investments. Berkshire Hathaway is heavily invested in Brazilian fintech Nu Holdings Ltd. The investment was its strongest performer in 2023.\nFounded in 2013, Nu initially offered low-cost bank accounts and personal loans through a format that was much more digitized than its competitors. In 2022, the company launched Nucripto, which allows users to buy and sell more than 15 tokens.\nWhile its crypto business makes up a somewhat small portion of its revenue, it still operates in the crypto sphere, and its customer base continues to grow. It also launched its own cryptocurrency called Nucoin.\nBuffett had invested $500 million in Nu Holdings through a series G funding round before the company went public in December 2021. A few months later, Buffett increased his stake by another $250 million, resulting in a total investment of $750 million.\nThe investment has paid off. Nu is up nearly 50% in 2024 alone and recently set all-time highs. This is also coming off a strong 2023, in which the stock was up nearly 100%.\nThese huge gains could shift Buffett's focus toward crypto. Seeing the profits earned on a crypto-related business could cause the investor to rethink his strategy and stance on crypto. Bitcoin has outperformed most major indices so far in 2024. The token is up nearly 70% in 2024, well above the S&P 500, which is up just over 10% in 2024.\nWith Bitcoin and crypto entering the spotlight again, lots of eyes are on Berkshire Hathaway and Buffett as they contemplate whether to continue investing in Bitcoin-adjacent businesses or even the tokens themselves\nRead Next:\nBitcoin To $100,000? Here’s what gold bug Peter Schiff said could happen on Anthony Pompliano’s podcast.\nLarge boom in cryptocurrency and metaverse interest as BTC skyrockets — has Apple Vision Pro increased the demand for virtual real estate?. \n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Despite Warren Buffett's Warnings Calling Bitcoin 'Rat Poison,' Berkshire Hathaway Continues Profiting Off Crypto originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-03-07T04:58:03.000Z",
        "Title": "Warren Buffett's Berkshire Bolsters Stake in Liberty SiriusXM Group",
        "Author": "  GuruFocus Research ",
        "Text": "Warren Buffett (Trades, Portfolio), through Berkshire Hathaway, has made a notable addition to its investment portfolio by acquiring 50,682,902 shares of Liberty SiriusXM Group (NASDAQ:LSXMK) on March 6, 2024. This transaction saw an increase of 2,183,430 shares at a trade price of $29.26, reflecting a 0.02% trade impact on Berkshire's portfolio. The position in LSXMK now accounts for 0.43% of the firm's holdings, with a significant 15.52% ownership of the traded stock.\nWarning! GuruFocus has detected 5 Warning Signs with LSXMK.\nWarren Buffett (Trades, Portfolio), the Chairman of Berkshire Hathaway, is a legendary figure in the investment world, often referred to as \"The Oracle of Omaha.\" His investment philosophy, deeply influenced by Benjamin Graham, emphasizes value investingacquiring companies at prices less than their intrinsic value and holding them for the long term. Berkshire Hathaway, originally a textile company, has been transformed under Buffett's leadership into a massive conglomerate with a focus on insurance and other diverse business interests. The firm's top holdings include prominent names such as Apple Inc (NASDAQ:AAPL), American Express Co (NYSE:AXP), and Coca-Cola Co (NYSE:KO), with a total equity of $347.36 billion and a strong inclination towards the technology and financial services sectors.\nLiberty SiriusXM Group, operating primarily through its subsidiary Sirius XM Holdings, is a powerhouse in subscription-based satellite radio services. The company, which went public on April 18, 2016, offers a wide array of music, sports, entertainment, and other programming across the United States and the United Kingdom. With a market capitalization of $9.57 billion and a stock price of $29.25, LSXMK is considered fairly valued with a GF Value of $31.32. The stock's PE Percentage stands at 12.79, indicating profitability, and it boasts a strong GF Score of 81/100, suggesting good potential for outperformance.\nThe recent acquisition of LSXMK shares by Berkshire Hathaway is a strategic move that further solidifies the firm's position in the media-diversified industry. The additional shares represent a modest yet strategic increase in Berkshire's portfolio, which could signal Buffett's confidence in the long-term prospects of Liberty SiriusXM Group. The trade's significance is underscored by the 15.52% stake that Berkshire now holds in the company, making it a substantial investment within the firm's diverse portfolio.\nLiberty SiriusXM Group's current market valuation aligns closely with the GF Value, with a Price to GF Value ratio of 0.93. The stock has experienced a slight decline of 0.03% since the transaction date, yet it has seen a significant increase of 36.94% since its IPO. The year-to-date performance shows a marginal change of 0.07%. These metrics, combined with the company's GF Score, suggest a stable investment with the potential for growth.\nIn the media-diversified sector, Liberty SiriusXM Group holds a competitive position. The company's financial health, as indicated by its Financial Strength rank of 4/10 and interest coverage rank of 448, is complemented by a Profitability Rank of 7/10. The company's Operating Margin growth and Growth Rank both stand at 7/10, indicating a strong potential for future earnings expansion.\nAside from Berkshire Hathaway, other notable investors such as Seth Klarman (Trades, Portfolio), Wallace Weitz (Trades, Portfolio), and Mario Gabelli (Trades, Portfolio) have also taken an interest in Liberty SiriusXM Group. Their involvement underscores the attractiveness of LSXMK as an investment opportunity within the media-diversified industry.\nWarren Buffett (Trades, Portfolio)'s recent investment in Liberty SiriusXM Group is a testament to his value investing strategy and his ability to identify companies with strong long-term prospects. For value investors, Buffett's moves offer insights into potential market opportunities and the importance of thorough analysis when selecting stocks. As Berkshire Hathaway continues to adjust its portfolio, the investment community will undoubtedly watch closely to glean wisdom from one of the most successful investors in history.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-06T16:57:00.000Z",
        "Title": "Top Analyst Reports for Berkshire Hathaway, Linde & Union Pacific",
        "Author": "  Mark Vickery ",
        "Text": "Wednesday, March 6, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), Linde plc (LIN) and Union Pacific Corp. (UNP). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.Berkshire Hathaway’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the past year (+26.4% vs. +23.7%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to catastrophic (\"cat\") losses induces earnings volatility and also affects the underwriting results. Huge capital expenditures remain a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Linde have outperformed the Zacks Chemical - Specialty industry over the past year (+30.5% vs. +23.6%). The company has an extensive range of industrial gas applications that is enhancing global productivity day by day. The company’s primary products in industrial gases include oxygen, which is used as life support in hospitals.Linde has long-term contracts with on-site customers, backed by minimum purchase requirements, thereby securing stable cashflows. In the profitable industrial gas market, the merger of Praxair and Linde has created an efficient player with a considerable size advantage. However, increasing competition for new projects in emerging markets is concerning.The company faces vulnerability due to economic growth slowdowns, potentially impacting industrial gas demand. Linde's history of consistently offering lower dividend yields compared with the composite stocks belonging to the sector has been a concern for income-oriented investors. As such, the stock warrants a cautious stance.(You can read the full research report on Linde here >>>)\n \nUnion Pacific’s shares have outperformed the Zacks Transportation - Rail industry over the past year (+24.3% vs. +20.8%). The company’s efforts to reward its shareholders, even in the current uncertain scenario, are encouraging. In 2023, UNP bought back shares worth $700 million. The railroad operator paid dividends worth $3.2 billion in 2023.Union Pacific's strong free cash flow generating ability supports its shareholder-friendly activities. On the flip side, a decline in volumes due to soft consumer markets and reduced fuel surcharge revenues is a concern.Given the soft freight market scenario, the revenue weakness is likely to persist going forward as well. This will hurt overall volumes. Operating ratio (operating expenses as a percentage of revenues) deteriorated 220 basis points in 2023 from the 2022 reading, mainly due to revenue weakness. Capital expenditures are expected to be $3.4 billion in 2024.(You can read the full research report on Union Pacific here >>>)Other noteworthy reports we are featuring today include Prologis, Inc. (PLD), The Allstate Corp. (ALL) and Exelon Corp. (EXC).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nLinde's (LIN) Long-Term Contracts with Minimum Volume Aid\nUnion Pacific (UNP) Strong on Dividends Amid Volume Woes\nFeatured Reports\nHealthy Demand to Aid Prologis (PLD) Despite Rising SupplyPer the Zacks Analyst, solid industrial real estate demand bodes well for Prologis, given its ability to provide modern facilities at strategic locations. However, elevated supply is a key concern.n\nAllstate (ALL) Rides on Improving Premiums, High Debt HurtsPer the Zacks analyst, Allstate benefits from a healthy revenue stream courtesy of a broad product suite and pricing discipline. However, its high leverage continues to weigh down the margins.\nRegulated Investment and Revenue Decoupling Aid Exelon (EXC)Per the Zacks analyst, Exelon's planned $34.5B investment to strengthen transmission and distribution lines and revenue decoupling mitigates the impact of load fluctuation to boost its performance.\nGenAI-Enabled PCs to Aid HP (HPQ) Personal Systems RevenuesPer the Zacks analyst, growing interest in generative artificial intelligence-enabled PCs might give a fresh boost to HP's Personal Systems segment revenues in fiscal 2024 and beyond.\nStrategic Buyout Aid Henry Schein (HSIC) Amid Stiff RivalryPer Zacks analyst, Henry Schein's deal to acquire a majority interest in TriMed marks its entry into the upper and lower Extremity segment of the orthopedic market. Stiff rivalry remains a concern.\nONTO Benefits from Next-Generation Firefly System LaunchPer the Zacks analyst, higher AI spending is driving specialty devices and advanced packaging segment revenues. Firefly G3 system enables high volume production of panel-level substrates.\nAlkermes' (ALKS) Proprietary Drugs Aid Growth, High Reliance a WoePer the Zacks analyst, strong sales of Alkermes' proprietary drugs are driving growth. The restructuring initiatives are also a positive. Heavy dependence on partners for revenues remains a concern.\nNew Upgrades\nLow Breakeven Costs to Aid Marathon Oil's (MRO) Cash FlowsThe Zacks analyst believes that Marathon's extremely low oil price breakeven costs of just $35 a barrel should generate meaningful free cash flows and improve future profitability.\nStrength in Vista & National Pen Units Drive Cimpress (CMPR)Per the Zacks analyst, strength in Cimpress' Vista and National Pen units, fueled by robust demand for promotional products, apparel and marketing materials, will continue to lend momentum to it.\nSolid Backlog and Accretive Buyouts to Aid MasTec (MTZ)Per the Zacks analyst, MasTec is likely to benefit from strong communication segment backlog and solid accretive buyouts. Also, the continued demand for its wireline services bodes well.\nNew Downgrades\nMedifast's (MED) Top-Line Hurt by Customer Acquisition IssuesPer the Zacks analyst, Medifast is battling difficulties in attracting customers. In Q4 revenues fell 43.4%, as customer acquisition was pressured by growing popularity of weight loss medications.\nWeak Lithium Prices, Specialties Unit Ail Albemarle (ALB)Per the Zacks analyst, Albemarle faces headwinds from softer lithium market pricing. The softness in consumer electronics and elastomers markets will also hurt its Specialties segment.\nHigher Spending Amid Subscriber Decline Hurts Tegna (TGNA)Per the Zacks analyst, declining subscriber growth is compelling Tegna to spend on higher programming fees and investments in growth initiatives thereby keeping margins under pressure.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExelon Corporation (EXC) : Free Stock Analysis Report\nPrologis, Inc. (PLD) : Free Stock Analysis Report\nUnion Pacific Corporation (UNP) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nThe Allstate Corporation (ALL) : Free Stock Analysis Report\nLinde PLC (LIN) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-26T21:50:19.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Gains As Market Dips: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "The most recent trading session ended with Berkshire Hathaway B (BRK.B) standing at $411.57, reflecting a +0.4% shift from the previouse trading day's closing. The stock's change was more than the S&P 500's daily loss of 0.28%. Meanwhile, the Dow experienced a drop of 0.08%, and the technology-dominated Nasdaq saw a decrease of 0.42%.\nHeading into today, shares of the company had gained 0.19% over the past month, lagging the Finance sector's gain of 2.71% and the S&P 500's gain of 2.67% in that time.\nAnalysts and investors alike will be keeping a close eye on the performance of Berkshire Hathaway B in its upcoming earnings disclosure. On that day, Berkshire Hathaway B is projected to report earnings of $3.41 per share, which would represent a year-over-year decline of 7.59%. Meanwhile, our latest consensus estimate is calling for revenue of $81.03 billion, down 5.11% from the prior-year quarter.\nFor the full year, the Zacks Consensus Estimates project earnings of $18.50 per share and a revenue of $359.6 billion, demonstrating changes of +7.68% and -1.34%, respectively, from the preceding year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Berkshire Hathaway B. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. Berkshire Hathaway B is holding a Zacks Rank of #2 (Buy) right now.\nInvestors should also note Berkshire Hathaway B's current valuation metrics, including its Forward P/E ratio of 22.16. Its industry sports an average Forward P/E of 13.59, so one might conclude that Berkshire Hathaway B is trading at a premium comparatively.\nOne should further note that BRK.B currently holds a PEG ratio of 3.17. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. BRK.B's industry had an average PEG ratio of 1.19 as of yesterday's close.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This industry currently has a Zacks Industry Rank of 27, which puts it in the top 11% of all 250+ industries.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-15T20:22:11.000Z",
        "Title": "Berkshire raises pay for Buffett's successor Greg Abel to $20 million",
        "Author": "Reuters ",
        "Text": "March 15 (Reuters) - Berkshire Hathaway said on Friday it raised the pay of Vice Chairman Greg Abel, who is expected to succeed Warren Buffett as chief executive, in 2023 as the conglomerate posted a record operating profit.\nAbel and Vice Chairman Ajit Jain, who respectively oversee Berkshire's non-insurance and insurance operations, were each awarded $20 million in salary.\nBoth had been paid $19 million in 2022, including a $16 million salary plus a $3 million bonus.\nBuffett sets the pay for Abel and Jain. The billionaire's own compensation last year totaled $413,595, comprising his usual $100,000 salary plus personal and home security.\n(Reporting by Jonathan Stempel in New York Editing by Matthew Lewis)\n"
    },
    {
        "Date": "2024-03-04T09:04:00.000Z",
        "Title": "Zacks Value Investor Highlights: Apple, Alphabet and Berkshire Hathaway",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 4, 2024 – Zacks Value Investor is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here: https://www.zacks.com/stock/news/2234701/alphabet-is-on-sale-will-buffett-buy-shares\nWelcome to Episode #360 of the Value Investor Podcast.\n(0:30) - Should You Buy More of The Magnificent 7?\n(8:00) - If Warren Buffett Buys Apple, Should You Buy Too?\n(32:00) - Episode Roundup: AAPL, GOOGL, BRK.B\n Podcast@Zacks.com\n Every week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nThere is a lot of angst on Wall Street about the stocks of Apple AAPL and Alphabet GOOGL this year. Both are off record highs set earlier in the year and neither one is performing like NVIDIA, up triple digits.\nBerkshire Hathaway (BRK.B) owns Apple shares. Warren Buffett bought a big position in the company in 2016 and considers it one of the four linchpins of Berkshire Hathaway’s business.\nBuffett loves it so much, he gushes about Apple at nearly every Berkshire Hathaway annual meeting.\nIt may be hard to believe today, but Apple was out of favor in 2016 when Buffett dove in. It traded with a forward P/E as low as 10.6 that year. Apple’s 2024 forward P/E is 28. No one is calling Apple a value stock in 2024.\nApple also had a cheap P/S ratio in 2016. The high that year was 2.8 and the low was 2.3. Currently, Apple trades with a P/S ratio of 7.3. It’s not over 10, which is considered expensive, but 7.3 is above the current average of the S&P 500 at 4.2.\nApple also had an attractive P/B ratio in 2016. It’s high was 4.7 and low was 3.9 that year. A P/B under 3.0 usually indicates value. Currently, Apple’s P/B ratio is a sky-high 38.\nBuffett loves companies with great free cash flow and Alphabet has doubled its free cash flow since 2019. In 2023, it had annual free cash flow of $69.5 billion, up from $30.9 billion in 2019.\nBuffett also likes companies that are doing share buybacks and Alphabet announced a $70 billion buyback in April 2023.\nDoes Alphabet have a moat? Berkshire Hathaway looks for companies with competitive advantages of a “moat.”\nAlphabet’s advertising revenue has been a moat over the last two decades, although some are questioning whether AI might eat into it. But Alphabet also has YouTube, which recently posted its best quarter for ad revenue ever.\nBuffett also likes companies with great management who have been in a place for years. Alphabet fits that bill.\nTune into this week’s podcast for Tracey’s analysis of Alphabet’s valuation. The stock is on sale. But is it cheap enough for Buffett to dive in?\n[In full disclosure, Tracey owns shares of GOOGL in her personal portfolio.]\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nTracey Ryniec is the Value Stock Strategist for Zacks.com. She is also the Editor of the Insider Trader and Value Investor services. You can follow her on twitter at @TraceyRyniec and she also hosts the Zacks Market Edge Podcast on iTunes.\nZacks.com is a property of Zacks Investment Research, Inc., which was formed in 1978. The later formation of the Zacks Rank, a proprietary stock picking system; continues to outperform the market by nearly a 3 to 1 margin. The best way to unlock the profitable stock recommendations and market insights of Zacks Investment Research is through our free daily email newsletter; Profit from the Pros.  In short, it's your steady flow of Profitable ideas GUARANTEED to be worth your time!  Click here for your free subscription to Profit from the Pros.\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com/performance\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-05T13:00:00.000Z",
        "Title": "Aaron Khosh of Berkshire Hathaway HomeServices California Properties Facilitates Record-Breaking Off-Market Sales",
        "Author": "Business Wire ",
        "Text": "NEWPORT BEACH, Calif., March 05, 2024--(BUSINESS WIRE)--Navigating the unprecedented inventory shortage in the current real estate market has presented a variety of challenges for local real estate professionals, and some have weathered the storm better than others. Delivering a positive result has required more perseverance and creativity than it has in prior years, as evidenced by Aaron Khosh of Berkshire Hathaway HomeServices California Properties, who recently facilitated record-breaking off-market sales.\n\"My commitment is to provide clients with unparalleled value,\" noted Aaron Khosh, executive vice president of the Khosh Team. \"In Orange County’s competitive coastal real estate market, delivering value in the luxury segment requires more than merely sending MLS listings to clients. It necessitates actively reaching out to homeowners and networking to uncover unique off-market opportunities. Leveraging local knowledge is paramount, and partnering with a reputable local agent adds significant value for both sales and purchases. Currently, we have access to a portfolio of over $100 million in off-market properties, ensuring our clients exclusive opportunities not available to the public.\"\nIn a recent transaction, Aaron Khosh facilitated the sale of a Lido Isle property, surpassing the highest price per square foot record for a home with 30 feet of bay frontage, achieving $3,655 per square foot. The residence, located at 206 Via Lido Nord in Newport Beach, closed at $11.4 million.\nIn nearby Linda Isle, Aaron Khosh recently facilitated an off-market sale for $16 million for the property located at 104 Linda Isle. With a closing price representing $3,209 per square foot, the sale set a record as the second-highest price per square foot transaction in the renowned guard-gated waterfront community of Linda Isle.\nOperating from the Berkshire Hathaway HomeServices California Properties Newport Beach office, the Khosh Team specializes in the coastal Orange County market. With a 42-year history of successful real estate marketing, negotiating, selling, and closing, they attribute their success to building long-term, trusted relationships with their clients.\nUnder Aaron Khosh’s relentless drive and passion for the industry, along with Mehdi Khosh’s influential leadership and industry expertise, the Khosh Team has achieved a career sales volume exceeding $2 billion. \"Aaron and his team are perennial market leaders with a proven track record of success,\" noted Staci Hughes, Newport Beach Branch Manager. \"They continue to set the standard for excellence in the high-end luxury real estate market due to their relentless work ethic, market knowledge, and negotiating skills.\"\nThe career sales milestone of $2 billion is unlikely to endure for long, as Aaron Khosh has recently closed several other multi-million-dollar transactions. Notably, he assisted the buyer of a $25 million waterfront home in Corona Del Mar, situated at 4541 Brighton Road in the prestigious Cameo Shores neighborhood.\nAdditionally, Aaron Khosh facilitated the purchase of 218 Via Lido Nord in Newport Beach, achieving a closing price of $11.5 million. This transaction marked the second-highest price per square foot sale for a home on Lido Isle with 30-foot bay frontage. The residence has since been relisted by Aaron Khosh at $13.5 million and is currently pending, with Aaron Khosh representing both the buyer and seller.\nFor individuals seeking representation in their real estate transactions, Aaron Khosh offers more than just market insight – he provides an invaluable advantage in navigating the luxury real estate market. Contact Aaron Khosh at 949-554-4155 or email Aaron@KhoshTeam.com.\nAbout Berkshire Hathaway HomeServices California Properties\nBerkshire Hathaway HomeServices California Properties proudly supports 2,500 sales associates in over 40 offices spanning Santa Barbara to San Diego. In 2023, our expert agents assisted in more than 6,000 client transactions for over $10.3 billion in sales volume.\nBerkshire Hathaway HomeServices California Properties is a wholly owned subsidiary of HomeServices of America, Inc., and a member of HSF Affiliates, LLC. BHHS supports approximately 50,000 real estate professionals and more than 1,500 offices across 4 continents and 13 countries and territories including the U.S., Canada, Mexico, Europe, the Middle East, The Caribbean, and India. BHHS and the BHHS symbol are registered service marks of Columbia Insurance Company, a Berkshire Hathaway affiliate.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240305482948/en/\nContacts\nBill Bartshebillbartshe@bhhscal.com 858-204-0625\n"
    }
]