[
    {
        "Date": "2024-04-20T20:12:00.000Z",
        "Title": "Is Berkshire Hathaway Stock a Buy?",
        "Author": "  Justin Pope, The Motley Fool ",
        "Text": "Legendary investor Warren Buffett doesn't invest on behalf of clients, but his holding company Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) is the next best thing. After decades of acquiring dozens of privately held businesses and stakes in public corporations, the publicly traded behemoth is one of the world's largest companies.\nBuffett has carefully built Berkshire Hathaway to last long after he's gone, always maintaining a long-term vision at the company that's helped the stock outperform the S&P 500 over the years. But this giant, worth nearly $900 billion, isn't a buy at any price.\nYour price will probably have much to do with your investment returns over the coming years. Here is what you need to know.\nBerkshire Hathaway is truly a special company. It's a holding company that doesn't actually do anything aside from maintaining ownership of all its subsidiaries and allocating capital. Berkshire is a machine with many parts. Its parts are made of business units, including:\nInsurance underwriting\nInsurance investment income\nRailroad\nUtilities and energy\nOther businesses and miscellaneous items\nCollectively, all these units feed profits to Berkshire's bottom line, which Buffett and management allocate based on the best long-term interests of shareholders.\nBerkshire Hathaway owns dozens of enterprises and a roughly $350 billion stock portfolio. It is famous for its massive stake in Apple and longtime holdings like Coca-Cola and American Express. Overall, the portfolio alone is worth over $350 billion.\nThis diversification and massive size make Berkshire a resilient business built to endure whatever the economy throws at it. Over the years, this has included a financial crisis, multiple recessions, wars, and a pandemic.\nIf that wasn't enough, Berkshire also stacks a ton of cash on its books for that rainy day or fat-pitch investment opportunity. There's currently $167 billion on the books, which alone would be one of the world's largest companies at that market cap. It's safe to say that Berkshire Hathaway can be bought and held indefinitely without losing a wink of sleep.\nEvaluating the stock can be challenging because there are so many moving parts. Buffett himself has stated that GAAP income is virtually useless due to all the non-cash items that can affect the reported figures. So, instead, consider using Berkshire's book value to evaluate the stock.\nA company's book value is its total assets minus its liabilities. What is left is its book value, sometimes called shareholder equity. It's the company's value after paying all the bills and debts.\nBook value is a useful metric for evaluating Berkshire because it's easier to take a big-picture view of the business and total the cumulative value it has created.\nMore specifically, investors can check Berkshire's price-to-book ratio, which shows how much they pay for the business's equity. Over the years, Berkshire has traded at roughly 1.4 times its book value. Today, at 1.5 times, it's near the high end of its range over the past decade.\nInterestingly, Berkshire has traded within a pretty tight range, aside from severe market events like 2020's pandemic crash. The company's dependability means that investors who already own shares should keep them tucked away, as the stock's valuation isn't so egregious that it would warrant selling.\nBut if you're on the outside looking in, there's no rush to buy shares. The stock could stand to cool off a bit. Look to buy shares closer to Berkshire's long-term averages.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $466,882!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 15, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Justin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway Stock a Buy? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-27T07:56:00.000Z",
        "Title": "Is It Too Late to Buy Berkshire Hathaway Stock?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is, perhaps, one of the most famous stocks on Wall Street. The company's impressive performance over time is clearly one reason, but the other is that it is run by Warren Buffett. If you are considering buying Berkshire Hathaway, it probably pays to step back and consider the company differently than you would just about any other. Here's why it isn't too late to buy Berkshire Hathaway stock.\nPrior to running Berkshire Hathaway, Warren Buffett operated a private investment group. He took client money and used that cash to invest in other companies. When he disbanded the investment group, he basically shifted his approach to owning Berkshire Hathaway, a public company, and using it to invest in other businesses and companies.\nThe investments include companies that Berkshire Hathaway owns outright. The best-known example here is probably Geico in the insurance space. However, over the years, the list of owned companies has expanded greatly to include utilities, oil & gas pipelines, a paint maker, manufacturers of various sorts, retailers, and a railroad, among others.\nThe company's reach is vast, but Berkshire Hathaway's approach to managing these entities is very hands-off. Buffett keeps tabs on management but leaves them to do their jobs. In other words, Berkshire Hathaway owns the companies but treats them as if they were stock investments.\nWhich brings up Berkshire Hathaway's stock portfolio. The company uses the cash its businesses generate, notably the premiums from its insurance operations, to buy shares of public companies. Some names in the portfolio include Coca-Cola (NYSE: KO), Occidental Petroleum (NYSE: OXY), and American Express (NYSE: AXP).\nThe list is constantly changing, but some companies have been on the list for a very long time. That fits Buffett's investment approach of buying good companies at reasonable prices to benefit from their long-term growth opportunities.\nWhen you step back, then, Berkshire Hathaway is really a massive collection of companies sitting under one roof. That sounds a bit like an actively managed mutual fund, which pools investors' cash so it can buy a portfolio of companies on their behalf. It isn't a perfect analogy, but it is close enough and probably how most investors should view the company. It also suggests there is no right or wrong time to buy Berkshire Hathaway.\nThe big reason to own Berkshire Hathaway is to gain access to the investing services of Warren Buffett and the team he has created. After all, he doesn't really get into the nitty-gritty of running the companies under the Berkshire umbrella. So, he's effectively just picking the businesses in which to invest.\nIf you want to invest alongside Warren Buffett, buying Berkshire Hathaway is the best option. Although the stock does rise and fall over time, perfect timing probably shouldn't be something you think too much about.\nThat said, there are some caveats to consider before you decide to buy the company. Warren Buffett runs Berkshire Hathaway, but for many years, his partner was Charlie Munger. They worked as a team, in a way, to come to investment decisions. Charlie Munger recently passed away. Although he was the older of the two men, Warren Buffett isn't that much younger. At some point, sooner rather than later, there will be a change of guard at Berkshire Hathaway.\nWhen a new leader takes the helm, changes may be made in how the company is operated. It is also possible that there won't be any changes. There's no way to tell right now. Given Buffett's hands-off approach, the corporate culture he has created may not survive without him.\nSo, while trying to time the perfect entry point into Berkshire Hathaway probably isn't worth the effort because of how it is operated, you need to make sure it remains the same company should Buffett step down for any reason.\nBerkshire Hathaway's stock performance is nothing short of incredible, as it has handily beat the S&P 500 Index over the long term. But it is not your typical company. It has a unique operating approach that suggests it should be looked at more like a mutual fund than a normal corporation.\nThat means there's probably no right or wrong time to buy the stock, but Charlie Munger's death brings up what may be the biggest risk. Could Berkshire Hathaway change if Warren Buffett is no longer at the helm? This shouldn't stop investors from buying, but it is something to monitor closely when the time comes.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $506,291!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 22, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nIs It Too Late to Buy Berkshire Hathaway Stock? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-22T10:27:00.000Z",
        "Title": "If You'd Invested $250 in Berkshire Hathaway 5 Years Ago, Here's How Much You'd Have Today",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "A $250 investment can go a long way. If you had invested this sum in Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) back in 1980, you'd have more than $500,000 today.\nTime travel isn't possible, but what if you had invested in Berkshire stock more recently? Are shares still rising as fast as they did in 1980?\nBerkshire is a lot bigger today than it was in 1980. Back then, its market cap was under $5 billion. Today, the company is worth nearly $900 billion. Getting bigger, naturally, means growth rates have slowed. After all, it's significantly harder to double in size as a $900 billion company than as a $5 billion company.\nFor the five-year period between 1993 and 1998, for example, Berkshire shares rose in value by 320%. Over the last five years, however, shares have increased in value by only 91.6%. A $250 investment five years ago would be worth only $476 today. That's still better than what the overall market returned, however. Over the last five years, for instance, the S&P 500 index returned 87.5%.\nBerkshire stock isn't beating the market by leaps and bounds anymore, but it's still a high-quality business managed by one of the best investors in history, Warren Buffett. Just know that a $250 investment is no longer even possible. The company's B shares -- its cheapest share class -- now trade at around $400. If you can meet that minimum investment, putting the money into Berkshire still makes a ton of long-term sense.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $466,882!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 18, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIf You'd Invested $250 in Berkshire Hathaway 5 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-26T00:05:00.000Z",
        "Title": "Why Berkshire Hathaway Should Be in the Magnificent 7",
        "Author": "  Tracey Ryniec ",
        "Text": "(1:00) - Can Value Investors Gain Exposure Into The Magnificent 7?\n(5:45) - Tracey’s Top Picks To Keep On Your Radar\n(26:00) - Episode Roundup: BRK.B, GOOGL, SHW, MAS, AWI\n Podcast@Zacks.com\n \nWelcome to Episode #367 of the Value Investor Podcast.\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nRecently, Tracey looked at the top 10 holdings in the S&P 500 index ETFs for a podcast she was doing with Zacks Director of ETF Research, Neena Mishra. When Tesla’s stock was surging, the top 7 were what became known as the Magnificent 7: Microsoft, Apple, NVIDIA, Amazon, Meta Platforms, Alphabet and Tesla.\nBut Tesla’s stock plunged 50% this year and that moved it out of not only the top 7, but the top 10 holdings in the S&P 500 altogether.\nWhat stock is now in the 7th position?\nBerkshire Hathaway. Warren Buffett’s old economy conglomerate has now joined the elite technology companies at the top.\nWith Tesla faltering, why not add Berkshire Hathaway to the Magnificent 7 list?\nBerkshire Hathaway Versus Alphabet\nThe argument for including Berkshire Hathaway isn’t as far-fetched as it may seem. When you look at the valuations and fundamentals of Berkshire Hathaway and compare them to some of the other Mag 7 stocks, there are a lot of similarities.\nTracey compared Berkshire Hathaway (BRK.B) to Alphabet (GOOGL) because Alphabet is one of the cheapest of the Mag 7 stocks.\n1.       Cash Rich:Berkshire Hathaway had $168 billion in cash as of Dec 31, 2023. Alphabet had $110 billion as of Mar 31, 2024.\n2.       Share buyback plans:Berkshire bought back $9.2 billion in 2023 and Alphabet announced an additional $70 billion for 2024.\n3.       Attractive P/E ratios:Berkshire Hathaway’s forward P/E is 22.1 while Alphabet’s is 23.3.\n4.       Attractive P/S ratios:Berkshire Hathaway’s P/S ratio is 2.4 while Alphabet’s is 6.4\nOld Economy Companies in Berkshire Hathaway: Winners?\nHow do you value the rest of Berkshire’s portfolio in the companies it owns outright? Tracey looked at some publicly traded competitors for ideas.\n1.       The Sherwin-Williams Co. (SHW)\nSherwin Williams makes paint. Berkshire Hathaway owns competitor Benjamin Moore. Sherwin Williams is not cheap. It’s trading with a forward P/E of 26. In the first quarter, sales at the consumer brand segment fell 7% as fewer homes sold and less remodeling was done.\nSherwin Williams pays a dividend, however, yielding 1%.\n2.       Masco Corp. (MAS)\nMasco Corp. also owns a well-known paint brand: Behr paint. But Masco did not see a restoration of volumes in the first quarter. Volumes fell 4%. Masco expects Behr pain to be down slightly in the first half of the year.\nMasco is attractively priced, with a forward P/E of 17.8. Masco also pays a dividend, yielding 1.6%.\n3.       Armstrong World Industries, Inc. (AWI)\nArmstrong World Industries makes ceiling and wall system solutions in both residential and commercial settings, including in healthcare facilities and classrooms. Berkshire Hathaway also owns several companies that are in similar old school industries like Shaw Industries which makes flooring.\nArmstrong World Industries is trading with a forward P/E of 20.3. It also pays a dividend, yielding about 1%. Armstrong World Industries is a Zacks #2 (Buy) stock.\nWhat Else Do You Need to Know About Berkshire Hathaway Being in the Mag 7?  \nTune into this week’s podcast to find out.\n[In full disclosure, Tracey owns shares of GOOGL in her own personal portfolio.]\n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Sherwin-Williams Company (SHW) : Free Stock Analysis Report\nMasco Corporation (MAS) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nArmstrong World Industries, Inc. (AWI) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-06T10:50:00.000Z",
        "Title": "Berkshire Hathaway Stock: Buy, Sell, or Hold?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) has proven to be one of the most profitable investments in history. Since 1980, the shares have risen more than 2,000-fold! A $100 investment would now be worth about $250,000.\nNow, with a market cap of $900 billion, most of Berkshire's biggest gains are likely behind it. But that hasn't stopped the stock from doubling the return of the S&P 500 during the past three years.\nBut what should investors be thinking right now? Is Berkshire stock a buy, sell, or hold?\nFor decades, investors have expected Berkshire's returns to slow down. And they have. From 1980 to 1990, the shares increased 28 times in value. From 1990 to 2000, they rose about sixfold in value. From 2000 to 2010, they roughly doubled. And in the most recent decade, they roughly tripled in value.\nIn general, the pace of Berkshire's gains have slowed, but the shares continue to rise decade after decade, typically faster than most market indexes. That's quite a feat. After all, the larger an investment portfolio becomes, the more difficult it is to outperform the market. That's because, now armed with a $900 billion market cap, Berkshire's investing universe is relatively small. Even if it invested several billion dollars in a company whose stock price quadrupled in a single year, it wouldn't move the needle very much for Berkshire's mammoth portfolio.\n\"The highest rates of return I've ever achieved were in the 1950s. I killed the Dow. You ought to see the numbers,\" Buffett famously quipped in 1999. \"But I was investing peanuts then. It's a huge structural advantage not to have a lot of money. I think I could make you 50% a year on $1 million. No, I know I could. I guarantee that.\"\nThe fact that Berkshire continues to beat the market has surprised many experts, but in reality, this performance makes a lot of sense. Buffett, arguably the best investor of all time, remains at the helm. He has also retained the help of other legendary investors, including Ted Weschler, Todd Combs, and the late Charlie Munger. Together, Buffett and his team still have plenty of investment options, even if they are relegated to larger companies. Right now, for example, Apple is Berkshire's largest holding, a stake worth roughly $153 billion. Apple itself, however, is worth more than $2.6 trillion. Berkshire could theoretically invest its entire portfolio several times over in Apple alone and still not be close to owning the entire business.\nSo yes, Berkshire's returns have slowed down. And yes, its investing universe is more limited than in the past. But the keys to the company's success -- a collection of legendary investors making long-term investments -- remains in place. Expect Berkshire to continue beating the market in the decades to come.\nJust because Berkshire's portfolio is poised to perform well during the coming years doesn't necessarily make the stock a buy. After all, it's possible that Berkshire's stock is overpriced, meaning you'll overpay for its portfolio's performance, hurting your own investment returns.\nIs Berkshire stock priced appropriately right now? Valuing the company is notoriously difficult. There is its publicly traded portfolio, which is fairly easy to value because there are publicly traded prices to reference. But most of Berkshire's value is tied up in its portfolio of privately held businesses -- everything from insurance underwriters to national railroads.\nA simple way to assess Berkshire's current valuation is by looking at its price-to-book ratio. This essentially gauges how much the market is willing to pay for Berkshire's assets. Today, the shares trade at a price-to-book ratio of 1.6, just above its long-term average. Relatively speaking, Berkshire stock isn't a bargain versus previous years, but it's also not overly expensive.\nThat's especially true given that the company has repurchased tens of billions of dollars of its shares in recent years -- an act that, while value accretive for shareholders, actually decreases the company's book value, creating a disconnect between accounting value and true value.\nOverall, is Berkshire stock still a buy after all these years? Absolutely. All the pieces remain in place for its continued success, and the valuation, though not a bargain, is still a fair price to pay for one of the market's highest-quality businesses.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of April 4, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Stock: Buy, Sell, or Hold? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-02T11:12:26.000Z",
        "Title": "Enormous Financial Firepower Helps Berkshire Hathaway (BRK-B) to Create Earnings",
        "Author": "  Soumya Eswaran ",
        "Text": "Artisan Partners, an investment management company, released its “Artisan Select Equity Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, Investor Class: ARTNX returned 12.84%, its Advisor Class: APDNX returned 12.92%, and Institutional Class: APHNX returned 12.88% compared to S&P 500 Index’s 11.69% return. In addition, please check the fund’s top five holdings to know its best picks in 2023.\nArtisan Select Equity Fund featured stocks like Berkshire Hathaway Inc. (NYSE:BRK-B) in the Q4 2023 investor letter. Headquartered in New York, New York, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in the insurance, freight rail transportation, and utility businesses. On April 1, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $420.20 per share. One-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was 4.86%, and its shares gained 35.96% of their value over the last 52 weeks. Berkshire Hathaway Inc. (NYSE:BRK-B) has a market capitalization of $908.561 billion.\nArtisan Select Equity Fund stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its fourth quarter 2023 investor letter:\n\"Our top seven holdings are American Express (the world’s leading premium closed loop credit card network operator), Samsung Electronics (the leading global manufacturer of memory semiconductors), Berkshire Hathaway Inc. (NYSE:BRK-B) (the holding company run by Warren Buffett), Elevance (a leading US health insurer), Danone (global food and nutrition), Heidelberg Materials (global cement and aggregates) and Alphabet (global Internet search)Our top seven are certainly not as dominant or as profitable collectively as their Magnificent Seven counterparts. But they are durable, attractive businesses with good growth prospects. Berkshire has enormous financial firepower that it can deploy to create earnings future earnings streams and cashflow.\"\nA team of insurance professionals in a boardroom overlooking a city skyline.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 12th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Berkshire Hathaway Inc. (NYSE:BRK-B) was held by 117 hedge fund portfolios, compared to 116 in the previous quarter, according to our database.\nWe discussed Berkshire Hathaway Inc. (NYSE:BRK-B) in another article and shared the list of largest insurance companies in the US by assets in 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n15 Top Selling Energy Drink Brands in the US\n10 Best Silver ETFs To Buy\n12 Best S&P 500 Stocks To Buy According to Analysts\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-04-23T17:11:43.000Z",
        "Title": "Berkshire Hathaway Stock Has 18% Upside, According to 1 Wall Street Analyst",
        "Author": "  Rich Smith, The Motley Fool ",
        "Text": "Shares of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), the stock famously led by billionaire investor Warren Buffett, won an upgrade last week when Swiss banker UBS raised its price target on the industrial conglomerate to $481 per share. That suggests a nearly 18% upside for the stock over the next 12 months.\nAs analyst Brian Meredith explained, there are two big reasons to like Berkshire stock: insurance and trains.\nBerkshire Hathaway is expected to report first-quarter earnings on May 6. Meredith believes the company will report $4.90 per share in profit on better \"underlying loss ratios\" at GEICO. (Which is to say, once you back out new reserves and catastrophic losses, payouts on insurance claims are trending lower relative to rising premiums). The analyst also sees shipment volumes on Berkshire's BNSF railroad picking up, translating into better revenue and profit there as well.\nBut here's the really interesting thing about this rating: Value investors see Berkshire Hathaway as the prototypical steady Eddy value stock, growing slowly but steadily as it buys and holds great businesses for decades. (And I'd argue this is the right way to invest in Berkshire). You wouldn't guess that from watching how UBS plays the stock, however. Over the last year, UBS has changed its opinion on Berkshire's value no fewer than eight times -- this latest time by less than 1%!\nContrast Meredith's approach to that of Warren Buffett himself. Buffett only buys back Berkshire Hathaway stock when the company is trading for less than 1.2 times book value, a number that by definition can't change more than four times a year, with each quarterly readout on book value.\nBetween the two strategies, I prefer Buffett's approach. It means less trading, fewer sales commissions, fewer tax bills on capital gains, and, over the long term, probably better profits for investors who imitate Buffett.\nSpeaking of which, at 1.5 times book value today, Buffett would probably argue that Berkshire Hathaway stock is, in fact, not a \"buy\" at the moment.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $487,211!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 22, 2024\nRich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBerkshire Hathaway Stock Has 18% Upside, According to 1 Wall Street Analyst was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-21T09:49:00.000Z",
        "Title": "Why Warren Buffett Has 68% of Berkshire Hathaway's $361 Billion Portfolio Invested in Only 4 Stocks",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "Many financial advisors strongly recommend investors diversify their portfolios. They subscribe to Sir John Templeton's principle, \"Diversification is a safety factor that is essential because we should be humble enough to admit we can be wrong.\"\nBut Warren Buffett seemingly isn't a big fan of diversification. Buffett has nearly 68% of Berkshire Hathaway's $361 billion portfolio invested in only four stocks. Why?\nBerkshire owns more than 905 million shares of Apple (NASDAQ: AAPL) worth over $152 billion. This one stock makes up a whopping 42% of Berkshire's portfolio. The percentage was even higher last year before Buffett (or one of his two investment managers) trimmed Berkshire's position in Apple a little in the fourth quarter of 2023.\nBank of America (NYSE: BAC) ranks as Berkshire's second-largest holding. The current value of the conglomerate's 1.03 billion shares is nearly $36.4 billion -- a little over 10% of its total portfolio.\nAmerican Express (NYSE: AXP) trails just slightly behind Bank of America as Berkshire's No. 3 position. Buffett's company owns roughly 151.6 million shares of AmEx with a total value topping $33 billion. That's enough to comprise slightly over 9% of Berkshire's portfolio.\nThe Coca-Cola Company (NYSE: KO) claims the No. 4 spot. Berkshire's 400 million shares in the food and beverage giant are worth around $23.4 billion. Coca-Cola makes up 6.5% of the conglomerate's portfolio.\nIt's important to note that Berkshire Hathaway owns over 40 stocks in addition to Apple, Bank of America, American Express, and Coca-Cola. However, there are several reasons why Buffett has so much of Berkshire's money invested so heavily in these four stocks.\nMost importantly, he believes in their businesses. At last year's annual Berkshire Hathaway shareholder meeting, Buffett said Apple is a \"better business than any we own.\" Leadership is key, too. At this same meeting, Buffett stated, \"I like Bank of America and I like the management.\"\nIn his letter to Berkshire shareholders earlier this year, Buffett listed Amex and Coke among the stocks he expects to \"maintain indefinitely.\" He explained, \"When you find a truly wonderful business, stick with it.\"\nBuffett wasn't always so heavily invested in these stocks. However, Coca-Cola and American Express are his two longest-held positions. The stocks have increased so much in value through the years that they've become a bigger part of Berkshire's portfolio. Buffett even noted in the latest shareholder letter that Berkshire's share of AmEx's earnings in 2023 \"considerably exceeded the $1.3 billion cost of our long-ago purchase.\"\nBerkshire has only owned Apple and Bank of America since 2016 and 2017, respectively. Since then, though, Apple's share price has skyrocketed more than 6x. BofA hasn't been as big of a winner, but it's given Berkshire a significant amount of dividend income.\nIn 1998, Buffett summarized his philosophy about diversification to a group of University of Florida students: \"If you really know businesses, you probably shouldn't own more than six of them. If you can identify six wonderful businesses, that is all the diversification you need, and you're going to make a lot of money.\"\nShould you follow Buffett's lead and invest heavily in a small number of stocks? Only if you can meet the two criteria he specified:\nHave a thorough understanding of their underlying businesses.\nFind \"wonderful businesses.\"\nIt's important to note another often-overlooked statement by the legendary investor: \"If you are not a professional investor, if your goal is not to manage money in such a way so you get a significantly better return than the world, then I believe in extreme diversification.\"\nAs it turns out, Buffett is on the same page as many financial advisors. Diversification is a good thing for most investors.\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $466,882!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 15, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. Keith Speights has positions in Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWhy Warren Buffett Has 68% of Berkshire Hathaway's $361 Billion Portfolio Invested in Only 4 Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-17T10:15:00.000Z",
        "Title": "Billionaire Warren Buffett Recently Cut This Stock From Berkshire Hathaway's Portfolio. It Just Dropped 53% In 1 Day. Here's What Investors Need to Know.",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Globe Life (NYSE: GL) stock plummeted by more than 53% in a single day last week after short-seller Fuzzy Panda Research accused the life insurance company of fraud. The claims piled onto the already struggling stock, which had previously been a longtime holding of Warren Buffett's conglomerate, Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B).\nIf you're thinking about buying the dip in the stock, there are some things you'll want to know.\nGlobe Life was one of Berkshire Hathaway's longest-held investments, having been part of the conglomerate's portfolio for more than two decades. Berkshire held Globe Life through several difficult economic periods, including the COVID-19 pandemic, which put tremendous pressure on life insurers by elevating claims costs.\nBuffett examines a management team's character and trustworthiness when investing. Buffett and his team have an excellent track record of evaluating management, which is a big reason for the conglomerate's long-term success. When Globe Life became the subject of several lawsuits accusing it of misconduct, Berkshire pulled the plug on its investment.\nLast year, two Globe Life subsidiaries, American Income Life Insurance Co. and Arias Agencies, faced a lawsuit accusing them of inappropriate workplace conduct; this included rampant drug use, sexual abuse, and degradation of agents who didn't hit sales targets.\nGlobe Life's struggles continued when a former executive claimed he was fired for blowing the whistle on \"potentially illegal\" sales practices at the subsidiary. It appears that the accusations were why Berkshire sold its stake in the insurer last year.\nFast-forward to this year, and Globe Life's troubles have gone from bad to worse. On March 6, the U.S. Department of Justice issued subpoenas to Globe Life and American Income Life. The subpoena is part of an investigation into allegations of fraud and misconduct at the (renamed) Arias Organization, now one of American Income Life's agencies.\nLast week, the dam broke after short-seller Fuzzy Panda Research accused Globe Life of \"extensive\" insurance fraud that was ignored by management. According to Breakout Point and reported by Bloomberg, Fuzzy Panda Research was the best-performing active short-seller in 2023. Although short-sellers -- investors who try to profit from falling share prices -- suffered deep losses during the long bull market of the 2010s, they can help expose harmful or downright fraudulent business practices.\nFuzzy Panda reviewed hundreds of court documents and interviewed former executives and agents \"who showed us where the fraud was hidden.\" According to the short-seller, the fraud was ignored by management despite being \"obvious and reported hundreds of times.\" After the short report was released, Globe Life's stock plummeted 53% in a single day.\nFollowing the serious accusations from Fuzzy Panda, Globe Life responded by saying:\nWe reviewed the report and found it to be wildly misleading, mixing anonymous allegations with recycled points pushed by plaintiff law firms to coerce Globe Life into settlements ... The short seller analysis by Fuzzy Panda Research mischaracterizes facts and uses unsubstantiated claims and conjecture to present an overall picture of Globe Life that is deliberately false, misleading and defamatory.\nAccording to The Fly, analysts believe the stock sell-off is overdone, but big question marks remain. Investment bank and investment firm Piper Sandler said that Globe Life's response \"serves to assuage concerns but does not completely remove the vacuum that remains absent a broader communication about this matter with the investment community.\"\nAnother investment firm, Evercore, meanwhile, sees limited downside from here but says there is still \"significant uncertainty for the shares.\"\nGlobe Life faces serious allegations, and the stock price reflects this. After its significant sell-off, aggressive investors may find the stock ripe for the picking. If you're willing to tolerate this risk, though, don't bet more than you're willing to lose.\nHowever, given the uncertainty around the situation and the Department of Justice's investigation, most investors are better off waiting to see how things shake out; they should avoid the stock for now.\nBefore you buy stock in Globe Life, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Globe Life wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of April 15, 2024\nCourtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nBillionaire Warren Buffett Recently Cut This Stock From Berkshire Hathaway's Portfolio. It Just Dropped 53% In 1 Day. Here's What Investors Need to Know. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-11T21:45:19.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Falls Amid Market Uptick: What Investors Need to Know",
        "Author": "  Zacks Equity Research ",
        "Text": "The latest trading session saw Berkshire Hathaway B (BRK.B) ending at $407.61, denoting a -0.37% adjustment from its last day's close. This move lagged the S&P 500's daily gain of 0.74%. Meanwhile, the Dow experienced a drop of 0.01%, and the technology-dominated Nasdaq saw an increase of 1.68%.\nHeading into today, shares of the company had gained 0.24% over the past month, outpacing the Finance sector's loss of 3.65% and lagging the S&P 500's gain of 0.8% in that time.\nThe investment community will be paying close attention to the earnings performance of Berkshire Hathaway B in its upcoming release. The company is forecasted to report an EPS of $3.41, showcasing a 7.59% downward movement from the corresponding quarter of the prior year. In the meantime, our current consensus estimate forecasts the revenue to be $81.03 billion, indicating a 5.11% decline compared to the corresponding quarter of the prior year.\nBRK.B's full-year Zacks Consensus Estimates are calling for earnings of $18.50 per share and revenue of $359.6 billion. These results would represent year-over-year changes of +7.68% and -1.34%, respectively.\nInvestors should also note any recent changes to analyst estimates for Berkshire Hathaway B. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has remained unchanged. Currently, Berkshire Hathaway B is carrying a Zacks Rank of #2 (Buy).\nInvestors should also note Berkshire Hathaway B's current valuation metrics, including its Forward P/E ratio of 22.12. This expresses a premium compared to the average Forward P/E of 13.09 of its industry.\nOne should further note that BRK.B currently holds a PEG ratio of 3.16. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. As of the close of trade yesterday, the Insurance - Property and Casualty industry held an average PEG ratio of 1.18.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This group has a Zacks Industry Rank of 35, putting it in the top 14% of all 250+ industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-22T09:02:00.000Z",
        "Title": "Billionaire Warren Buffett Has 50% of the Berkshire Hathaway Portfolio in 1 Stock",
        "Author": "  Parkev Tatevosian, CFA, The Motley Fool ",
        "Text": "Fool.com contributor Parkev Tatevosian discusses why he thinks Warren Buffett owns such a concentrated position in Apple (NASDAQ: AAPL) stock.\n*Stock prices used were the afternoon prices of April 18, 2024. The video was published on April 20, 2024.\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $466,882!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 18, 2024\nParkev Tatevosian, CFA has positions in Apple. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy.\nParkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\nBillionaire Warren Buffett Has 50% of the Berkshire Hathaway Portfolio in 1 Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-18T11:50:00.000Z",
        "Title": "Here's How Much Stock Berkshire Hathaway Repurchased in the Past Year",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Warren Buffett has been very strategic when it comes to issuing or repurchasing Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock.\nIn 2010, for example, Berkshire issued billions of dollars in stock to fund the acquisition of railroad operator BNSF. It remains one of the only times Buffett decided to dilute shareholders. More recently, Berkshire has been buying back its own shares to the tune of billions of dollars each year. At times, the company has repurchased more than $7 billion in stock in a single quarter.\nDuring the past year, Berkshire has repurchased roughly $9 billion of its own stock. There are several reasons the company will likely repurchase even more shares in 2024 and beyond.\nWhy is Berkshire repurchasing so much stock? Part of its motivation is that the company has too much cash. The company currently sits on a record cash pile of nearly $168 billion. If it remains invested, that cash earns a relatively paltry return for shareholders. Repurchasing stock allows the company to put that cash to work in something it knows and understands extremely well.\nThe second reason Berkshire has been buying back stock -- and will likely continue to do so -- is that equity prices in general are relatively high. That's also likely the reason the company's cash balance is so high. There simply aren't many bargains left. The S&P 500, for example, currently has a price-to-earnings multiple of about 27.5, nearly 70% above its long-term average.\nThe final reason Berkshire will continue to repurchase shares is that its own stock isn't that expensive. It currently trades at a price-to-book ratio of 1.53, right in line with its long-term average. The company is sitting on huge sums of cash, and its own stock is a relative bargain compared to the market, so why not repurchase shares? That's exactly what the company has been doing; don't expect it to stop anytime soon.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $20,646!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $31,962!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $333,023!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nSee 3 “Double Down” stocks »\n*Stock Advisor returns as of April 15, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nHere's How Much Stock Berkshire Hathaway Repurchased in the Past Year was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-04-30T12:09:00.000Z",
        "Title": "Should You Buy Berkshire Hathaway (BRK.B) Ahead of Q1 Earnings?",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway Inc. (BRK.B) is set to report first-quarter 2024 earnings soon. The Zacks Consensus Estimate for first-quarter earnings and revenues is pegged at $3.41 per share and $81.03 billion, respectively. The top- and bottom-line estimates imply a year-over-year decline of 7.5% and 5.1%, respectively.Per our proven model, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chance of an earnings beat. At present, Berkshire Hathaway has an Earnings ESP of 0.00% and a Zacks Rank of 2. Hence, it is presumed that BRK.B is unlikely to beat estimates this earnings season.You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\nYear to date, shares of Berkshire have gained 12.4% compared with the industry’s 13% growth, the Finance sector's 1.5% rise and the Zacks S&P 500 composite’s 7.6% increase.\nBerkshire Hathaway Inc. price-eps-surprise | Berkshire Hathaway Inc. Quote\nThe insurance business in the to-be-reported quarter is likely to have benefited from improved pricing, higher average premiums per auto policy, increased exposure and favorable reserve development.Per a report in Insurance Journal published by Marsh, global commercial insurance rates improved 1%, on average, in the first quarter of 2024.Insurers, being beneficiaries of an improving rate environment, are likely to have witnessed improved investment results. A larger investment asset base, coupled with a higher reinvestment rate, is likely to have favored investment results in the to-be-reported quarter.Continued insurance business growth is expected to have increased float.The utilities and energy business is expected to have benefited from higher earnings from other energy businesses, including tax equity investments and Northern Powergrid businesses, as well as from the natural gas pipeline businesses.Higher customer demand for products and services in many businesses is likely to have favored manufacturing, service and retailing businesses.\nBerkshire is exposed to catastrophe losses, which weigh on underwriting results. Gallagher Re’s National Catastrophe and Climate Report estimates global insured losses from natural catastrophes to be $20 billion for the first quarter of 2024. Per Aon, first-quarter global insured catastrophe losses are estimated at nearly $17 billion, largely attributable to severe convective storm activity and winter weather in the United States. We estimate combined ratio to be 91.9% in the first quarter of 2024.Nonetheless, rate increases, exposure growth, prudent underwriting and traditional risk management capabilities are likely to have favored underwriting results and combined ratio in the to-be-reported quarter.The railroad business is likely to have suffered from a decrease in overall volume and a fall in average revenue per car per unit, primarily attributable to lower fuel surcharge revenues and higher non-fuel operating costs.\nDespite the headwinds, it is advisable to buy this stock over the long term, given its growing utilities and energy business, improved pricing, better investment results and flourishing manufacturing, service and retailing businesses.\nHere are three insurance stocks you may want to consider, as our model shows that these have the right combination of elements to post an earnings beat:Horace Mann Educators Corporation HMN has an Earnings ESP of +15.03% and a Zacks Rank #3 at present. The Zacks Consensus Estimate for first-quarter 2024 earnings is pegged at 77 cents, indicating a year-over-year increase of 234.7%. You can see the complete list of today’s Zacks #1 Rank stocks here.HMN’s earnings beat estimates in three of the last four reported quarters and matched in one.Primerica, Inc. PRI has an Earnings ESP of +0.46% and a Zacks Rank #3 at present. The Zacks Consensus Estimate for first-quarter 2024 earnings is pegged at $4.11, indicating a year-over-year increase of 17.7%.PRI’s earnings beat estimates in three of the last four reported quarters and missed in one.Atlanticus Holdings Corporation ATLC has an Earnings ESP of +21.43% and a Zacks Rank #3 at present. The Zacks Consensus Estimate for first-quarter 2024 earnings is pegged at 98 cents, indicating a year-over-year decrease of 9.2%.ATLC’s earnings beat estimates in three of the last four reported quarters and missed in one.Stay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nPrimerica, Inc. (PRI) : Free Stock Analysis Report\nHorace Mann Educators Corporation (HMN) : Free Stock Analysis Report\nAtlanticus Holdings Corporation (ATLC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-23T21:45:20.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Declines While Market Improves: Some Information for Investors",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) closed at $408.74 in the latest trading session, marking a -0.01% move from the prior day. The stock fell short of the S&P 500, which registered a gain of 1.2% for the day. Elsewhere, the Dow gained 0.69%, while the tech-heavy Nasdaq added 1.59%.\nThe company's shares have seen a decrease of 0.28% over the last month, surpassing the Finance sector's loss of 5.68% and the S&P 500's loss of 4.16%.\nAnalysts and investors alike will be keeping a close eye on the performance of Berkshire Hathaway B in its upcoming earnings disclosure. The company's earnings per share (EPS) are projected to be $3.41, reflecting a 7.59% decrease from the same quarter last year. Simultaneously, our latest consensus estimate expects the revenue to be $81.03 billion, showing a 5.11% drop compared to the year-ago quarter.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $18.50 per share and revenue of $359.6 billion, which would represent changes of +7.68% and -1.34%, respectively, from the prior year.\nInvestors might also notice recent changes to analyst estimates for Berkshire Hathaway B. These revisions typically reflect the latest short-term business trends, which can change frequently. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has remained steady. Berkshire Hathaway B currently has a Zacks Rank of #2 (Buy).\nIn the context of valuation, Berkshire Hathaway B is at present trading with a Forward P/E ratio of 22.1. This represents a premium compared to its industry's average Forward P/E of 13.32.\nIt's also important to note that BRK.B currently trades at a PEG ratio of 3.16. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. By the end of yesterday's trading, the Insurance - Property and Casualty industry had an average PEG ratio of 1.18.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This industry, currently bearing a Zacks Industry Rank of 53, finds itself in the top 22% echelons of all 250+ industries.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-18T17:15:16.000Z",
        "Title": "ISS rebukes Buffett's Berkshire Hathaway over climate change, governance",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) - A leading shareholder advisory firm recommended on Thursday that Berkshire Hathaway shareholders withhold votes to reelect five directors at Warren Buffett's conglomerate, citing concerns about climate change and governance.\nInstitutional Shareholder Services (ISS) said lead independent director and audit committee chair Susan Decker deserved a \"withhold\" vote at Berkshire's May 4 annual meeting.\nIt said this was because Berkshire is a significant emitter of greenhouse gases, is not disclosing enough about climate change-related risks and opportunities it faces, and is not taking minimum steps needed to address those risks.\nISS also recommended withholding votes from Stephen Burke, Kenneth Chenault, Charlotte Guyman and Thomas Murphy Jr, who comprise Berkshire's compensation committee.\nIt said this reflected their \"poor stewardship\" over executive pay, with top executives' compensation not linked to Berkshire's profitability or stock price, and a share structure that gives Buffett outsized voting power.\nThe 93-year-old billionaire has led Omaha, Nebraska-based Berkshire since 1965. As of March 6, he owned about 15.1% of its stock but controlled 31.2% of its voting power.\nBerkshire did not immediately respond to a request for comment to Buffett's assistant.\nDecker is a former president of Yahoo, while Chenault was once chief executive of American Express.\nBerkshire's businesses including the BNSF railroad, Geico car insurance, and dozens of energy, industrial and retail units.\nIt has long defended its disclosures, and said requiring more was often inconsistent with its decentralized culture of letting businesses operate without interference from the top.\nIn 2023, Berkshire awarded Vice Chairmen Greg Abel and Ajit Jain, who oversee day-to-day operations, $20 million each in salary.\nBerkshire does not grant stock options. Abel is expected to eventually succeed Buffett as chief executive.\nBuffett's annual salary is $100,000, but Forbes magazine estimates his fortune at more than $130 billion.\nHe owns mostly Class A shares, which have greater voting rights than the Class B shares that most Berkshire shareholders own.\nISS separately endorsed shareholder proposals for more disclosures about Berkshire's plans to reduce greenhouse gases and improve diversity, equity and inclusion. Berkshire opposes these proposals.\nIn 2021, ISS also recommended that shareholders withhold votes from the directors on Berkshire's compensation committee. All won reelection with at least 90% of the votes cast.\n(Reporting by Jonathan Stempel in New York; Editing by Bill Berkrot)\n"
    },
    {
        "Date": "2024-04-21T00:00:10.000Z",
        "Title": "Berkshire Hathaway Class A and Class B Shares: What To Know Before Investing",
        "Author": "  Sarah Li Cain ",
        "Text": "Interested in investing in Berkshire Hathaway? According to the Motley Fool, one of the reasons investors flock to the company of which the Warren Buffet is the CEO is how strong the stock performs in the short-term. Essentially, it offers solid returns without you having to wait years for growth (though you can certainly hold onto the stocks for that long).\nCheck Out: 401(k) Growth Potential: Ways to Double Your Savings in 10 YearsRead Next: 7 Unusual Ways To Make Extra Money (That Actually Work)\nOne of the challenges is that in the past, you could only buy the A shares so many investors held onto the stock. Plus (this is a big one), the Berkshire Hathaway A share costs $528,000. Unless you have that much to spare, this share class isn’t exactly affordable for most investors.\nThe good news is that you can still get a piece of the action without having to fork over more than half a million dollars. Enter: Berkshire Hathaway B shares. Like A shares, you can own Berkshire Hathaway stock but it’s much more affordable, at $348 per share.\nInstead of around an average of 7,800 shares sold each day for A shares, around 3 million shares are traded on an average day. Combined with the more affordable price and higher trade volume, you have a better shot of buying the Berkshire Hathaway B share.\nLearn More: If You Bought $1K of Elon Musk’s Favorite Crypto 5 Years Ago, Here’s How Much You Would Have Now\nIf you think there’s different ownership types between A share and B shares, you’re incorrect. With A shares, you have a higher number of shares, or ownership compared to B shares. So if you want to take advantage of a stock that typically performs well (though you should never say never since there are no guarantees in life, including investing), buying B shares may be your chance. Several hundred dollars isn’t exactly small change, but at least it’s way less than trying to get a little more than half a million dollars.\nMore From GOBankingRates\nThe Single Best Thing To Buy at Costco in April 2024\n10 Cars That Outlast the Average Vehicle\nThis is One of the Best Ways to Boost Your Retirement Savings in 2024\n7 Things You'll Be Happy You Downgraded in Retirement\nThis article originally appeared on GOBankingRates.com: Berkshire Hathaway Class A and Class B Shares: What To Know Before Investing\n"
    },
    {
        "Date": "2024-04-10T21:50:21.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Dips More Than Broader Market: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) closed at $409.11 in the latest trading session, marking a -1.35% move from the prior day. The stock fell short of the S&P 500, which registered a loss of 0.95% for the day. Elsewhere, the Dow lost 1.09%, while the tech-heavy Nasdaq lost 0.84%.\nComing into today, shares of the company had gained 2.4% in the past month. In that same time, the Finance sector lost 1.88%, while the S&P 500 gained 1.78%.\nThe investment community will be paying close attention to the earnings performance of Berkshire Hathaway B in its upcoming release. The company is predicted to post an EPS of $3.41, indicating a 7.59% decline compared to the equivalent quarter last year. Our most recent consensus estimate is calling for quarterly revenue of $81.03 billion, down 5.11% from the year-ago period.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $18.50 per share and a revenue of $359.6 billion, representing changes of +7.68% and -1.34%, respectively, from the prior year.\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Berkshire Hathaway B. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Berkshire Hathaway B is holding a Zacks Rank of #2 (Buy) right now.\nIn terms of valuation, Berkshire Hathaway B is currently trading at a Forward P/E ratio of 22.42. This signifies a premium in comparison to the average Forward P/E of 13.45 for its industry.\nOne should further note that BRK.B currently holds a PEG ratio of 3.2. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. The average PEG ratio for the Insurance - Property and Casualty industry stood at 1.17 at the close of the market yesterday.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This industry, currently bearing a Zacks Industry Rank of 26, finds itself in the top 11% echelons of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-29T21:45:19.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Drops Despite Market Gains: Important Facts to Note",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) ended the recent trading session at $400.96, demonstrating a -0.28% swing from the preceding day's closing price. The stock fell short of the S&P 500, which registered a gain of 0.32% for the day. Elsewhere, the Dow saw an upswing of 0.38%, while the tech-heavy Nasdaq appreciated by 0.35%.\nHeading into today, shares of the company had lost 4.38% over the past month, outpacing the Finance sector's loss of 5.24% and lagging the S&P 500's loss of 2% in that time.\nThe investment community will be paying close attention to the earnings performance of Berkshire Hathaway B in its upcoming release. The company is forecasted to report an EPS of $3.41, showcasing a 7.59% downward movement from the corresponding quarter of the prior year. Meanwhile, our latest consensus estimate is calling for revenue of $81.03 billion, down 5.11% from the prior-year quarter.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $18.50 per share and a revenue of $359.6 billion, signifying shifts of +7.68% and -1.34%, respectively, from the last year.\nInvestors should also note any recent changes to analyst estimates for Berkshire Hathaway B. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Within the past 30 days, our consensus EPS projection remained stagnant. As of now, Berkshire Hathaway B holds a Zacks Rank of #2 (Buy).\nValuation is also important, so investors should note that Berkshire Hathaway B has a Forward P/E ratio of 21.74 right now. For comparison, its industry has an average Forward P/E of 12.69, which means Berkshire Hathaway B is trading at a premium to the group.\nInvestors should also note that BRK.B has a PEG ratio of 3.11 right now. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Insurance - Property and Casualty industry had an average PEG ratio of 1.16 as trading concluded yesterday.\nThe Insurance - Property and Casualty industry is part of the Finance sector. At present, this industry carries a Zacks Industry Rank of 51, placing it within the top 21% of over 250 industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-01T10:55:00.000Z",
        "Title": "Berkshire Hathaway Inc. Information Regarding First Quarter Earnings Release and 2024 Annual Shareholders Meeting",
        "Author": "Business Wire ",
        "Text": "OMAHA, Neb., May 01, 2024--(BUSINESS WIRE)--(BRK.A; BRK.B) – Berkshire Hathaway Inc.’s first quarter earnings release and its quarterly report on Form 10-Q will be posted on the Internet on Saturday, May 4, 2024, at approximately 7:00 a.m. Central time where it can be accessed at www.berkshirehathaway.com.\nBerkshire Hathaway will hold its 2024 Annual Shareholders Meeting on Saturday May 4, 2024. Prior to the Annual Shareholders Meeting, Warren Buffett, Berkshire’s Chairman and Chief Executive Officer, Greg Abel, Vice Chairman Non-Insurance Operations and Ajit Jain, Vice Chairman Insurance Operations, will hold a question-and-answer session that will commence at approximately 9:15 a.m. Central time. The question-and-answer session will be broadcast on CNBC and webcast on CNBC.com. The broadcast on CNBC and webcast will begin at 8:30 a.m. Central time and at 8:45 a.m. will feature Berkshire’s Annual Meeting movie. In prior years the Annual Meeting movie was only seen by those in attendance at the meeting in Omaha. Visit www.cnbc.com/brklive.\nAbout Berkshire\nBerkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, freight rail transportation, utilities and energy, manufacturing services and retailing. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.\nCautionary Statement\nCertain statements contained in this press release are \"forward looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. Berkshire assumes no obligation and does not intend to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240501237109/en/\nContacts\nMarc D. Hamburg402-346-1400\n"
    },
    {
        "Date": "2024-04-03T17:59:00.000Z",
        "Title": "Top Research Reports for Berkshire Hathaway, Procter & Gamble & Adobe",
        "Author": "  Sheraz Mian ",
        "Text": "Wednesday, April 3, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), The Procter & Gamble Company (PG) and Adobe Inc. (ADBE). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway shares have outperformed the Zacks Finance sector over the past year (+36.2% vs. +25.1%) as well as the broader S&P 500 index (+36.2% vs. +24.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Procter & Gamble have outperformed the Zacks Soap and Cleaning Materials industry over the past year (+9.6% vs. +8.2%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments.It has been focused on productivity and cost-saving plans to boost margins. This led to bottom line beating the consensus mark for the sixth consecutive quarter in the second quarter of fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.However, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.(You can read the full research report on Procter & Gamble here >>>)Adobe shares have gained +29.6% over the past year against the Zacks Computer - Software industry’s gain of +43.8%. The company’s fiscal first-quarter 2024 results were driven by strong performance of Creative Cloud, Document Cloud and Adobe Experience Cloud segments.Further, rising subscription revenues and solid momentum across the mobile apps were positives. Growth in emerging markets, robust online video creation demand and solid adoption of Acrobat remain tailwinds. The company remains optimistic about its strong market position, compelling product lines, continued innovation, strategic acquisitions and solid adoption of cloud applications.Also, the company’s growing generative AI efforts are a major plus. However, the ongoing tensions between Russia and Ukraine remain headwinds for Digital Media segment. Also, high acquisition expenses do not bode well for its margin expansion.(You can read the full research report on Adobe here >>>)Other noteworthy reports we are featuring today include Advanced Micro Devices, Inc. (AMD), AstraZeneca PLC (AZN) and QUALCOMM Incorporated (QCOM).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nP&G's (PG) Productivity & Cost Savings Plan to Aid Margins\nAdobe (ADBE) Rides on Growing Adoption of Cloud Applications\nFeatured Reports\nRobust Product Portfolio & Partnerships Aid AMD's ProspectsPer the Zacks analyst, Advanced Micro Devices is benefiting from strong adoption of fourth gen EPYC processor. Moreover, alliances with Meta, Amazon and Oracle, bode well.\nKey Drugs Aid AstraZeneca (AZN) Sales; Pipeline StrongThe Zacks analyst says that AstraZeneca's key drugs like Lynparza, Tagrisso, Imfinzi, Ultomiris and Farxiga should drive sales. Its pipeline is strong with several phase III data readouts lined up.\nQualcomm (QCOM) Rides on 5G Traction, Healthy IoT MomentumPer the Zacks analyst, Qualcomm is likely to benefit from the seamless transition from a wireless communications firm for the mobile industry to a connected processor firm for the intelligent edge.\nAlibaba (BABA) Gains From International Commerce BusinessesPer the Zacks analyst, strength across AliExpress' Choice and cross-border-related value-added services is benefiting Alibaba's international commerce retail and wholesale businesses.\nStrategic Pacts Aids Walgreens (WBA) Amid Stiff RivalryThe Zacks analyst is impressed with Walgreens' partnership with TelePharm which expand its tele-pharmacy services and improve access to care. Yet, stiff rivalry remains a concern.\nSolid Lab Assets Demand Aid Healthpeak (DOC), High Rates AilPer the Zacks Analyst, solid demand for lab assets and rising healthcare expenditure by senior citizens bode well for Healthpeak. However, competition from peers and high interest rates are woes.\nH&R Block (HRB) Benefits From Block Horizons 2025 StrategyPer the Zacks analyst, Block Horizons is expected to help H&R Block deliver sustainable revenue and operating profit growth, improve return on investments, and maintain a strong liquidity position.\nNew Upgrades\nStrong Demand & Cost Optimization to Aid General Motors (GM)Per the Zacks analyst, General Motors' compelling EV and ICE portfolio, with strong demand for its quality full-size pickups and full-size SUVs, bodes well. A cost reduction program is also beneficial\nRobust Construction Activity & Acquisitions Aid EMCOR (EME)Per the Zacks analyst, EMCOR benefits from robust demand in key sectors like high-tech manufacturing, network & communications, industrial and healthcare. Also, focus on acquisitions bode well.\nMurphy USA (MUSA) Gains from Proximity to Walmart StoresThe Zacks analyst likes the proximity of Murphy USA's fuel stations to Walmart supercenters and the consistent traffic that these stores attract, thereby driving above-average fuel sales volume.\nNew Downgrades\nCompetition From Clean Fuel Sources Ail Arch Resources (ARCH)Per the Zacks analyst, Arch Resources' results are adversely impacted as emissions concerns push coal back in comparison with other clean fuel sources. Strict regulations also act as a headwind.\nADTRAN (ADTN) Plagued by Soft Demand in Network SolutionsPer the Zacks analyst, sluggish demand in the Network Solutions segment, macroeconomic challenges and fierce competition from other established players will likely strain ADTRAN's margin.\nElevated Expenses, High Leverage Concern First American (FAF)Per the Zacks analyst, First American's increase in higher personnel costs, operating expenses induces higher expenses that weigh on margin expansion. High leverage induces rise in interest expense.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAstraZeneca PLC (AZN) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAdobe Inc. (ADBE) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-04T10:18:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Berkshire Hathaway, Procter & Gamble, Adobe, Advanced Micro Devices and AstraZeneca",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – April 4, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc. (BRK.B), The Procter & Gamble Co. PG, Adobe Inc. ADBE, Advanced Micro Devices, Inc. AMD and AstraZeneca PLC AZN.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc., The Procter & Gamble Co. and Adobe Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway shares have outperformed the Zacks Finance sector over the past year (+36.2% vs. +25.1%) as well as the broader S&P 500 index (+36.2% vs. +24.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Procter & Gamble have outperformed the Zacks Soap and Cleaning Materials industry over the past year (+9.6% vs. +8.2%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments.It has been focused on productivity and cost-saving plans to boost margins. This led to bottom line beating the consensus mark for the sixth consecutive quarter in the second quarter of fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.However, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.(You can read the full research report on Procter & Gamble here >>>)Adobe shares have gained +29.6% over the past year against the Zacks Computer - Software industry’s gain of +43.8%. The company’s fiscal first-quarter 2024 results were driven by strong performance of Creative Cloud, Document Cloud and Adobe Experience Cloud segments.Further, rising subscription revenues and solid momentum across the mobile apps were positives. Growth in emerging markets, robust online video creation demand and solid adoption of Acrobat remain tailwinds. The company remains optimistic about its strong market position, compelling product lines, continued innovation, strategic acquisitions and solid adoption of cloud applications.Also, the company’s growing generative AI efforts are a major plus. However, the ongoing tensions between Russia and Ukraine remain headwinds for Digital Media segment. Also, high acquisition expenses do not bode well for its margin expansion.(You can read the full research report on Adobe here >>>)Other noteworthy reports we are featuring today include Advanced Micro Devices and AstraZeneca PLC.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAstraZeneca PLC (AZN) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAdobe Inc. (ADBE) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-30T22:58:02.000Z",
        "Title": "Charlie Munger Will Be Absent From Warren Buffett's Side Saturday: First Berkshire Hathaway Meeting Without The 'Architect'",
        "Author": "  Chris Katje ",
        "Text": "The annual Berkshire Hathaway (NYSE:BRK)(NYSE:BRK) shareholders meeting attracts thousands of people to Omaha annually to hear from legendary investor Warren Buffett.\nThe 2024 event will feel quite different for those in attendance, with Buffett missing his investing partner Charlie Munger.\nWhat Happened: Munger, the former Berkshire Hathaway vice chairman, passed away in November at the age of 99.\nFor the first time, the annual Berkshire Hathaway annual shareholders meeting held in Omaha, Nebraska won't feature Buffett with Munger by his side. The 2024 event takes place on Saturday, May 4.\nThe duo traditionally shared highlights of their portfolio and investment strategies and also provided valuable pieces of wisdom about finance and life to those in attendance.\nOne investor told The Wall Street Journal that things will be different Saturday for those in attendance.\n\"I feel like there's going to be a place in my heart missing when we don't see Charlie up there. Of course we'll adapt to it, but this first year especially it's going to be kind of like an empty-chair feeling,\" Lyle McIntosh said.\nBuffett has credited Munger with being the brains behind the company, and those in attendance will also remember the one-liners that the investor often had.\nMunger once said \"if you mix raisins with turds, they're still turds\" at the 2000 annual meeting when speaking about speculation in technology.\nWhile Munger won't be on stage with Buffett, other key Berkshire figures could play a more prominent role. Greg Abel, who runs the noninsurance operations for Berkshire, is next in line to Buffett's CEO role and will appear on stage. Insurance head Ajit Jain will also be featured at the event.\nRelated Link: Charlie Munger Shared A Three Word Piece Of Advice At A Dinner, How It Helped An Investor And Was Also Used By Warren Buffett\nWhy It's Important: Known as the \"Woodstock for Capitalists,\" the annual shareholders meeting has been attended by many investors for years and often attracts first timers who own shares of the popular conglomerate to the event in hopes of meeting and hearing from Buffett.\nMunger and Buffett worked together for decades and were often viewed as close friends or family by those who witnessed their interactions together. Buffett once said that he had never had an argument with Munger.\nIn February, Buffett shared a touching tribute to Munger in a letter to shareholders. Buffett called Munger the \"architect\" who worked behind the scenes of building up Berkshire Hathaway.\n\"In a way his relationship with me was part older brother, part loving father,\" Buffett said in the letter.\nBuffett praised Munger for his selfless advice during the early years of his leadership at Berkshire Hathaway.\n\"Charlie never sought to take credit for his role as creator but instead let me take the bows and receive the accolades.\"\nBRK-B Price Action: Berkshire Hathaway shares trade at $398.26 versus a 52-week trading range of $317.41 to $430.00. Shares of Berkshire Hathaway are up 20% in the last year.\nRead Next: Here’s How Much Warren Buffett Could Have Made Investing In Tesla\nPhoto: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Charlie Munger Will Be Absent From Warren Buffett's Side Saturday: First Berkshire Hathaway Meeting Without The 'Architect' originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-04-05T10:21:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Berkshire Hathaway, NVIDIA, Bank of America, Occidental Petroleum and Chevron",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – April 5, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc (BRK.B), NVIDIA Corporation NVDA, Bank of America Corp. BAC, Occidental Petroleum Corp. OXY and Chevron Corp. CVX.\nWarren Buffett is unquestionably the paragon of well-reasoned investing. He entered the investing game quite early and accomplished tremendous success by placing bets on companies having competitive advantages.\nBuffett believes in acquiring and holding companies that have a promising business model, generate income unswervingly, and provide dividends, indicating sustainable growth. Companies that generate plenty of cash also fall under the ambit of the Oracle of Omaha’s investment viewpoint.\nIt is, thus, worth mentioning that Warren Buffett-led Berkshire Hathaway Inc has been loading up on oil companies in recent times. However, most market participants are consumed by AI optimism, betting big on semiconductors like NVIDIA Corporation (read more: Nvidia a Must-Buy After AI-Fueled Blowout Earnings).\nWarren Buffett’s inclination toward energy players is due to an uptick in oil prices for quite a while. Brent crude is approaching the $90 a barrel mark, which is a significant high, while the West Texas Intermediate (WTI) crude is advancing to the $86 a barrel mark, the highest level in five months.\nBank of America Corp.’s analysts also have raised their crude oil forecast for this year. Oil prices are gaining traction amid prospects of higher demand and supply shortages owing to the geopolitical crisis.\nThe American Petroleum Institute recently reported that there has been a drop in U.S. inventories, with crude oil shedding 2.3 million barrels. At the same time, expansion in manufacturing activity in China for the first time in six months in March indicates growing demand for oil soon.\nOn the other hand, a Ukrainian drone strike on a Russian refinery and Israel’s strike on Iran’s embassy in Syria are all set to disrupt the supply of oil.\nThus, with oil prices advancing after taking a beating at the end of 2023, it’s prudent for investors to keep an eye on Warren Buffett’s favorites, Occidental Petroleum Corp. and Chevron Corp.\nDuring the first week of February, Warren Buffett spent a whopping $245.7 million on purchasing shares of Occidental Petroleum. The company has become one of Berkshire Hathaway’s top public equity holdings.\nOccidental Petroleum has come a long way from going bankrupt in 2020 to being one of the most sought-after oil companies this year. Production from Permian resources stood in good stead for Occidental Petroleum. Its operation in the Permian Basin is expected to expand, banking on the company’s acquisition of CrownRock L.P.\nOccidental Petroleum’s sale of non-core assets helped trim its outstanding debt. Occidental Petroleum has kept operational expenses under check and generated considerable income from sales since its net profit margin is 16.2%, more than 10%, signifying a healthy margin.\nOccidental Petroleum has solid fundamentals since it has paid constant dividends to its shareholders. In the past 5-year period, OXY has increased its dividend four times, and its payout has advanced 0.8%. Occidental Petroleum has a dividend yield of 1.31%. Check Occidental Petroleum’s dividend history here.\nThe Zacks Consensus Estimate for its next-year earnings has increased by 1.9% over the past 30 days. OXY’s expected earnings growth rate for the next year is 34.4%. The company currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks Rank #1 (Strong Buy) stocks here.\nChevron also occupies a top spot in Berkshire Hathaway’s equity holdings. Chevron’s leading position in the money-spinning Permian Basin is providing the company with maintainable production growth. The company’s present acquisition of Hess Corporation is expected to help it sustain earnings growth and cash inflows.\nChevon has an encouraging net profit margin of 10.6%. In the past 5-year period, CVX has increased its dividend five times, and its payout has advanced 6.1%. Chevron has a dividend yield of 4.08%. Check Chevron’s dividend history here.\nThe Zacks Consensus Estimate for its current-year earnings has increased by 2% over the past 30 days. CVX’s expected earnings growth rate for the next year is 18.7%. The company currently has a Zacks Rank #3.\nShares of Occidental Petroleum and Chevron have gained 13.4% and 7.6%, respectively, so far this year.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nOccidental Petroleum Corporation (OXY) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-17T10:00:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Mastercard, Netflix, Coca-Cola, Berkshire Hathaway and Medtronic",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – April 17, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Mastercard Inc. MA, Netflix, Inc. NFLX, The Coca-Cola Co. KO, Berkshire Hathaway Inc. (BRK.B) and Medtronic plc MDT.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features a real-time update on the Q1 earnings season and new research reports on 16 major stocks, including Mastercard Inc., Netflix, Inc. and The Coca-Cola Co. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>\nIncluding all of the reports that came out this morning, we now have Q1 results from 40 S&P 500 members. Total Q1 earnings for these 40 index members are up +10.7% from the same period last year on +4.5% higher revenues, with 82.5% beating EPS estimates and 65% beating revenue estimates.\nThis is better earnings growth for these 40 index members relative to what we have seen from this group in recent quarters, though the revenue growth pace represents a modest deceleration from other recent periods.\nThe 82.5% EPS beats percentage for this group of 40 index members compares to 92.5% in 2024 Q4, 87.5% in 2023Q3, 85% in 2023 Q2, 82.5% in 2023 Q1, and a 12-quarter average of 80.4%.\nThe 65% revenue beats percentage is modestly above the 62.5% beats percentage we saw for this group of 40 index members in the preceding period, but is otherwise tracking below other recent periods as well as the 12-quarter average of 70.9%. In other words, we can say that companies appear to be struggling to beat consensus Q1 estimates.\nLooking at Q1 as a whole, combining the actual resutls from these 40 index members with estimates for the still-to-come companies, total earnings are now expected to be up +3.8% from the same period last year on +3.9% higher revenues. For more details our earnings commentary, please check out our weekly Earnings Trends report here >>>2024 Q4 Earnings Season Gets Underway\nMastercard shares have outperformed the Zacks Financial Transaction Services industry over the past year (+24.7% vs. +17.4%). Numerous acquisitions are helping the company to grow addressable markets and drive new revenue streams. The COVID-19 crisis accelerated the adoption of digital and contactless solutions, providing an opportunity for the firm's business to expedite its shift to the digital mode.Mastercard is well-poised to gain from steady cash-generating abilities. A strong capital position allows it to pursue acquisitions and prudently deploy capital through share buybacks and dividend payments. Mastercard also increased its quarterly dividend to 66 cents per share.However, steep operating expenses might stress its margins. Also, we expect general and administrative costs to jump almost 11% in 2024. High rebates and incentives may weigh on net revenues. As such, the stock warrants a cautious stance.(You can read the full research report on Mastercard here >>>)Shares of Netflix have outperformed the Zacks Broadcast Radio and Television industry over the year-to-date period (+26.4% vs. +8.4%). The company is benefiting from its growing subscriber base, thanks to a robust portfolio. Crackdown on password-sharing and the introduction of paid sharing in more than 100 countries, which represents over 80% of Netflix’s revenue base, is also expected to aid growth. We expect all of these favorable developments reconfirmed following the company's Q1 results after the market's cose on April 18th.Netflix’s diversified content portfolio, which is attributable to heavy investments in the production and distribution of localized and foreign-language content, has been driving its growth prospects.However, stiff competition in the streaming space from the likes of Apple, Amazon Prime Video, Disney+, Peacock and Paramount+ is a headwind. Netflix’s leveraged balance sheet and a higher streaming obligation are concerns. Additionally, unfavorable forex is expected to hurt operating income in the first quarter of 2024.(You can read the full research report on Netflix here >>>)Coca-Cola shares have outperformed the Zacks Beverages - Soft drinks industry over the past six months (+9.5% vs. +8.2%). The company continues to witness positive business trends as reflected by its robust surprise history. KO’s sales and earnings beat estimates for the fourth consecutive quarter in fourth-quarter 2023.Earnings and sales also improved year over year. Strong revenue growth across most of its operating segments aided by improved price/mix and increased concentrate sales boosted the results. It is poised to gain from innovations and accelerating digital investments. It provided an upbeat guidance for 2024.However, shares of Coca-Cola lagged the industry in the past three months. KO witnesses inflationary cost pressures, related to higher commodity and material costs, as well as higher marketing investments.(You can read the full research report on Coca-Cola here >>>)Other noteworthy reports we are featuring today include Berkshire Hathaway Inc. and Medtronic plc.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMastercard Incorporated (MA) : Free Stock Analysis Report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\nMedtronic PLC (MDT) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-01T16:21:45.000Z",
        "Title": "Solar Stocks, Berkshire and the Latest Costco Craze",
        "Author": "  Wall Street Horizon ",
        "Text": "After a cool spell late last week, springtime is in full bloom around our parts in the Northeast. As the calendar flips to May, the second quarter has not come without its bouts of uncomfortable market conditions either. The S&P 500 pared its 2024 gains in April, but earnings growth appears on track, according to the latest collective numbers by the world's biggest companies. Along with a Federal Reserve meeting this week, key macro data will shower investors on Friday and thereafter via employment and inflation updates.\nThis week, let's shine a light on one stock market niche that has been flat-out burned ever since interest rates began to lift off in late 2021. The solar industry, once tied to happenings in the Energy sector, is now among the most susceptible areas to higher borrowing costs. The debt-dependent group seems to just live and die by the latest moves in the U.S. Treasury bond market. When yields spike, you tend to see an impact to names like Invesco Solar ETF (TAN), charted below. The market has shown that when rates retreat, relief rallies often ensue.\nWhen will that intermarket relationship break? It is hard to pinpoint, but we will hear from a few of the solar industry's big players in May through quarterly reports, shareholder meetings and corporate conferences.\nSource: Stockcharts.com\nLast week, Enphase Energy (NASDAQ:ENPH) was among the biggest earnings movers after it posted a double miss on the evening of April 23. The $15 billion market cap Semiconductor Materials & Equipment industry company within the Information Technology sector recorded first-quarter non-GAAP earnings per share of 35 cents, while revenue of $263 million also came up shy of the Wall Street consensus.1\nShares plunged immediately after the numbers hit the tape, but then found some footing by Wednesday morning. It was really a triple-play miss considering Enphase's management team lowered top-line guidance amid softening domestic demand, though sales growth in Europe jumped 70% from the first quarter.\nIt seems to be the same old story for solar stocks. The TAN ETF notched multiyear lows in April and traded lower after the ENPH report. There is potential for more volatility. According to Wall Street Horizon's data, TAN's biggest weight, First Solar (NASDAQ:FSLR), is confirmed to report first-quarter 2024 earnings on Wednesday, May 1 AMC with a conference call immediately after the numbers cross the wires. China's GCL Technology Holdings (GCPEF) also issues quarterly numbers then.\nThen, on the afternoon of May 8, First Solar holds its annual shareholder meeting right before a pair of industry companies post their quarterly results; the embattled SolarEdge Technologies (NASDAQ:SEDG), down more than 80% over the past 12 months, and Sunrun (NASDAQ:RUN), off by more than half since this time in 2023, both post first-quarter numbers and host earnings calls. Array Technology (NASDAQ:ARRY) reports the following afternoon.\nOn the conference front, updates from many major solar industry players will be heard at Citi's 2024 Energy and Climate Technology Conference from May 14 to 15 and the Deutsche Bank Global Solar & Clean Tech Conference 2024 (virtual) on May 16. So, as executives shed light on existing issues and emerging trends, keep this slice of the market on your radar.\nWhat else is happening as the new month gets going? The first Saturday in May does not only mark the big race at Churchill Downs. It's also when Berkshire Hathaway's (NYSE:BRK.A) (NYSE:BRK.B) annual shareholder meeting takes place. The first year without the esteemed presence of the late Charlie Munger will be tough, but investors may take solace in seeing Warren Buffett (Trades, Portfolio) on stage along with other Berkshire execs.\nIt comes at a time when the insurance industry faces increasing scrutiny considering steep rate increases in the homeowner and auto categories. Berkshire stock has come off its highs after rallying sharply in the previous 18 months. In general, rising interest rates are a net positive for insurers. Following somewhat sanguine comments from JPMorgan Chase (NYSE:JPM) CEO Jamie Dimon last week, describing the U.S. economy as booming, we'll hear how Buffett views the state of the macro.2\nBerkshire shares take a greather after a big run-up\nSource: Stockcharts.com\nAfter Cinco de Mayo, Costco (NASDAQ:COST) offers among the first April reads on consumer spending via its monthly same-store sales report. With full quarterly earnings not due until May 30, investors will find out if the $317 billion market cap retailer built on its March 9.40% year-over-year net sales jump.3 You might have heard that Costco is now in the gold market. Last summer, it began offering gold at relatively cheap prices compared to other physical gold sellers.4\nThe strategy was apparently a hit as the company then started offering low-markup silver to its members. It is estimated that the precious metals business could be adding 1% to comparable-store revenue and 3% to its General Merchandise sales tally.5 At the very least, media attention has been high as gold prices have increased toward $2400 per ounce.\nFirst-quarter results are tracking pretty well for S&P 500 companies through week three of the reporting season. Not all areas enjoyed profitability gains, however. The troubled solar industry continues to grapple with higher interest rates and ongoing tariff chatter. Elsewhere, Berkshire Hathaway issues its first-quarter results this Saturday in Omaha at the Woodstock for Capitalists. Finally, will Costco's move into the metals dealing business be a hit? We might get details on that later in May when the company issues its results.\n[1] Enphase Energy Reports Financial Results for the First Quarter of 2024, Enphase Energy, Inc., April 23, 2024, https://investor.enphase.com[2] JPMorgan CEO Dimon says US economy is booming, Reuters, Nupur Anand, April 23, 2024, https://www.reuters.com[3] Costco Wholesale Corporation Reports March Sales Results and Announces an Increase in Its Quarterly Cash Dividend, Costco Wholesale Corporation, April 10, 2024, https://investor.costco.com[4] Costco now sells up to $200 million a month in gold and silver, CBS News, Khristopher K. Brooks, April 10, 2024, https://www.cbsnews.com[5] Precious metals buyer cashes in on Costco's gold bar rush: 'I consider this savings', Fox Business, Madeline Coggins, April 13, 2024, https://www.foxbusiness.com\nCopyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners.\nThis article first appeared on GuruFocus.\n"
    }
]