[
    {
        "Date": "2024-05-06T09:35:00.000Z",
        "Title": "Who Owns the Most Berkshire Hathaway Stock Besides Warren Buffett?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Warren Buffett is the largest holder of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock. He owns around 227,416 shares of Class A stock, and 276 shares of Class B stock. These stakes combine for a value of roughly $136 billion, representing a 31.6% voting interest in the company.\nWho is the second-largest shareholder of Berkshire Hathaway? That depends on exactly what you're looking at.\nWhen looking at who owns the second-most shares of Berkshire Hathaway, it's important to distinguish between share classes. Berkshire has both Class A and Class B shares, each of which have different prices with different levels of voting power. Class A shares currently trade for $600,000 apiece, while Class B shares trade for just $400 apiece.\nWhen it comes to who has the most individual financial interest in Berkshire besides Buffett, it would be his daughter, Susan Alice Buffett. She owns roughly 4.4 million Class B shares, but only 80 Class A shares. She therefore controls only 0.1% of the company's voting power.\nIf you want to know who has the most voting power, you need to look beyond individuals and at institutions. The Vanguard Group, for instance, owns roughly 146 million class B shares, representing 11% of the total Class B shares outstanding. Its aggregate voting power is far greater than Susan Alice Buffett's, but nearly all of these shares are actually controlled by the many individuals who own Vanguard funds.\nSo while Susan Alice Buffett is the second largest Berkshire shareholder, that's only if you ignore massive institutions like Vanguard that control giant blocks of shares.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $544,015!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of April 30, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWho Owns the Most Berkshire Hathaway Stock Besides Warren Buffett? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-21T22:22:39.000Z",
        "Title": "How to buy Berkshire Hathaway stock: Invest in Warren Buffett’s company",
        "Author": "  James Royal, Ph.D. ",
        "Text": "Berkshire Hathaway is one of the largest companies in the world, and it owns a wide variety of businesses, ranging from insurance and energy to chocolates and fast food. It’s long been known as the holding company of legendary investor Warren Buffett, and the company has racked up amazing returns for investors since Buffett took the reins more than 50 years ago.\nIf you’re considering buying shares of Berkshire Hathaway stock, here’s how to do it and what you’ll need to know before you decide.\nAnalyzing a company’s competitive position and financials is probably the single hardest part of buying the stock, but it’s also the most important. The best place to begin is with the company’s Form 10-K, which is the annual report that all publicly traded companies must file with the Securities and Exchange Commission (SEC).\nThe 10-K can help you understand a lot about the company:\nhow it makes money and how much\nits assets and liabilities\nits profitability trend over time\nthe competitive landscape\nthe various risks faced by the business\nThe annual report is a great first step to find out about the company, but you’ll want to do more than this. You’ll want to study what other companies are doing to compete, because it’s important to have a broader perspective of the industry.\nFor example, Berkshire competes in a wide variety of industries, but it’s most importantly an insurance company through GEICO and other subsidiaries.\nBerkshire is also a big player in the utilities industry, and owns a railroad and dozens of other businesses, too. Given this array, Berkshire can be a very tough company to follow. On top of this, Berkshire owns a sizable portfolio of some of the world’s largest stocks, including American Express, Bank of America, Coca-Cola and Apple, and each has its own issues to analyze.\nBuffett writes an annual letter to shareholders that can be extremely useful in understanding how Berkshire’s various businesses are doing. The letter is written in an accessible way, and you can read them dating all the way back to 1977 on the company’s website.\nBerkshire Hathaway is one of the market’s blue chip stocks and has a long history of outperformance. The company’s insurance operation powers a lot of what Berkshire does, and Warren Buffett has an enviable track record of investing the company’s excess cash. With a plethora of well-performing businesses, Berkshire may be a good fit for many portfolios, but perhaps not all, since it doesn’t pay shareholders a dividend.\nAlso, while Berkshire Class A shares get all the press for their ultra-high price, the company also has Class B shares that have the same proportional economic rights, but trade for a lower price and have fewer voting rights.\nSo you’ll want to consider the following questions:\nDo you understand the business and its future prospects?\nWill you be able to continue analyzing the business and industry as it grows?\nGiven that stocks can be volatile, will you be able to hold on if it drops or even buy more?\nDo you have a sense of what the company is worth and how that compares to the current market value?\nBerkshire doesn’t pay a dividend – do you need that in a stock?\nHow much you can afford to invest has less to do with Berkshire Hathaway than with your own personal financial situation. Stocks can be volatile. So, to give your investment time to work out, you’ll likely want to be able to leave the money in the stock for at least three to five years. That means you should be able to live without the money for at least that length of time.\nCommitting to holding the stock for three to five years is important. You’d hate to have to sell the stock when it’s near a low only to watch it rebound much higher after you exited the position. By sticking to a long-term plan, you’ll be able to ride out the ups and downs of the stock.\nIf you’re investing in individual stocks, you’ll likely want to keep the percentage of any single position between 3 and 5 percent. This way you’re not heavily exposed to one investment breaking your portfolio. If the stock has more business risk, then you might choose an even lower percentage than this range.\nIn addition, rather than just committing a one-time sum of money to the stock, consider how you can add money to your position over time.\nWhile opening a brokerage account may sound like a difficult step, it’s actually quite easy, and you can have everything set up in 15 minutes or so.\nYou’ll want to select a broker that caters to your needs. Are you trading often or infrequently? Do you need a high level of service or research? Is cost the most important factor for you? If you’re buying a few stocks but investing mainly in funds, then a number of brokers specialize in offering commission-free trading for those funds.\n(Here is Bankrate’s list of best brokers for beginners.)\nAfter you’ve opened your account, you’ll want to fund it with enough money to buy Berkshire Hathaway stock. But you can take care of this step completely online, and it’s simple.\nWith Berkshire’s Class B shares trading around $414 per share as of May 2024 (its Class A shares trade for about $626,000), you may not have enough money to buy an entire share. Several brokers, including Charles Schwab and Fidelity offer fractional shares to help with this problem, allowing you to invest with just a few dollars.\nOnce you’ve decided to buy Berkshire Hathaway stock and you’ve opened and funded your brokerage account, you can set up your order. Use the company’s ticker symbol – BRK-B for the Class B stock – when you input your order.\nMost brokers have a “trade ticket” at the bottom of each page, so you can enter your order. On the broker’s order form, you’ll input the symbol and how many shares you can afford, or the amount you’d like to invest if you’re buying fractional shares. Then you’ll enter the order type: market or limit. A market order will buy the stock at whatever the current price is, while the limit order will execute only if the stock reaches the price that you specify.\nIf you’re buying just a few shares, then you’re likely best off sticking with a market order. Even if you pay a little bit more now for a market order, it won’t affect the long-term performance much, if the stock continues to perform well.\nBuying a stock can be exciting, but success won’t happen overnight. Investors should take a long-term perspective on their investments, and they should consider taking advantage of dollar-cost averaging, if they believe in the stock for the long haul.\nWith dollar-cost averaging, investors add a set amount of money to their position over time, and that really helps when a stock declines, allowing them to purchase more shares. High-flying stocks can dip from time-to-time, so the strategy can help you achieve a lower buy price and higher overall profits.\nEditorial Disclaimer: All investors are advised to conduct their own independent research into investment strategies before making an investment decision. In addition, investors are advised that past investment product performance is no guarantee of future price appreciation.\n"
    },
    {
        "Date": "2024-05-04T22:29:37.000Z",
        "Title": "Why Warren Buffett's billions in cash at Berkshire Hathaway is a bearish stock market signal",
        "Author": " Seana Smith    · Host",
        "Text": "Queue the bears.\nBerkshire Hathaway's (BRK-A, BRK-B) cash pile hit another record high in the first quarter of $189 billion, the industrial giant said in its earnings release on Saturday.\nThat massive cash war chest will likely reach $200 billion by the end of the current quarter, Buffett told shareholders at a packed CHI Health Center today.\nSuch a hoard of greenbacks signals Buffett is “bearish” on the stock market right now, according to one veteran value investor.\n“Buffett is bearish on the stock market. He shows this by growing his massive cash position to $200 billion, selling Apple (AAPL) shares and saying that he doesn’t see bargains,” Smead Capital Management CIO and long-time Buffett watcher Bill Smead told me on the grounds of the Woodstock of Capitalism.\nBerkshire’s decision to reduce its stake in Apple and boost the company’s cash position is a move that Buffett says makes sense given the current macroeconomic environment.\n“I don’t think anyone sitting at this table has any idea how to use it effectively, and therefore we don’t use it,” Buffett said in response to a shareholder question of why Berkshire isn’t putting the cash reserve to work.\n“As the world gets more sophisticated, complicated and intertwined, more can go wrong” and you want to be able to “act when that happens,” Buffett added.\nThe bears have some meat to feast on, compliments of Buffett.\nBerkshire reduced its position in Apple by about 13% during the first three months of the year, marking the second quarter in a row that the conglomerate reduced its stake in the iPhone maker.\nAs of March 31, Apple accounted for about 40% of Berkshire’s vast stock portfolio, worth a total of $135.4 billion.\nBerkshire reduced its position in Apple as the tech giant has struggled in recent quarters and valuation on the stock remains elevated. The stock fell about 10% during the first three months of the year, weighing on Berkshire’s quarterly results.\nWhile some initially looked at Buffett’s decision to reduce the Apple stake as a sign that his stance on the tech beast has changed, one analyst told Yahoo Finance that \"taking a little off the top doesn’t hurt.\"\n\"This does not concern us all that much because Apple was such a large position in the 13-F portfolio at the end of 2023, so anything to lessen that exposure is good from a diversification perspective,\" Morningstar analyst Greggory Warren told me at the meeting.\nThe legendary investor was also quick to reassure shareholders as to his confidence in Apple.\n“At the end of the year, I would think it’s extremely likely that Apple is the largest common stock holding we have now,” Buffett told a packed house, which included Apple CEO Tim Cook.\nBuffett compared Apple to two of Berkshire’s most well-known, top holdings: Coca-Cola (KO) and American Express (AXP). While he called Coca-Cola and American Express “wonderful businesses,” he noted Apple was an “even better business.”\nWhile Buffett remains optimistic on Apple, the business does face short-term headwinds.\nWeakness in China has been front and center for Apple investors as it loses market share to domestic players. A more cautious US consumer hasn't aided investor sentiment, either.\n“It's easy to blame the overall consumer environment but there's also a market share dynamic that's occurring with Huawei and others becoming extremely competitive,” Ariel Investments emerging markets equities senior vice president Christine Phillpotts told me at Berkshire's annual meeting.\nIt’s a trend that Phillpotts says will likely accelerate as domestic players continue to “increase the value proposition.”\nApple shares have declined 4.8% since the start of the year despite coming AI announcements, far underperforming the S&P 500’s 8% gain.\nBuffett's cash hoard hints other stocks may follow Apple's lead lower as the year treks along.\nCurious on what Apple is up against in terms of AI competition? Yahoo Finance executive editor Brian Sozzi goes inside Amazon's AI plans with AWS CEO Adam Selipsky in a new episode of the Opening Bid podcast below.\nSeana Smith is an anchor at Yahoo Finance. Follow Smith on Twitter @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-05-21T08:33:00.000Z",
        "Title": "Berkshire Hathaway's Mystery Stock Revealed: Here's Why It's an Ideal Warren Buffett Stock",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "After months of waiting, investors finally learned the identity of the mystery stock Berkshire Hathaway has been scooping up over the past few quarters. The conglomerate added nearly 26 million shares of Chubb (NYSE: CB), the largest publicly traded property and casualty insurance company.\nAlthough investors may have been hoping for something more exciting, Chubb is a prototypical Warren Buffett stock. Buffett has a special affinity for the insurance business and the cash flows they generate, and Chubb is one of the largest, most diversified insurance companies out there. Here's why it was an ideal stock for Buffett and his team at Berkshire.\nBuffett has an affinity for insurance companies that dates back to his time as a student of Benjamin Graham at Columbia Business School. In 1950, Buffett bought $10,000 shares of GEICO, which he sold a couple of years later for $15,000. Buffett also credits Berkshire Hathaway's acquisition of National Indemnity Insurance in 1967 as a pivotal turning point for the company.\nThe insurance business isn't easy. Companies need to consistently weigh risks on policies and price them so they have enough room to pay for losses and squeeze out a small profit.\nBecause there is a period of time between collecting premiums and paying out claims, insurance companies essentially have an interest-free loan. This cash, also known as float, is \"money we hold and can invest but that does not belong to us,\" in the words of Warren Buffett.\nAs old policies lapse and new ones begin, insurers can consistently grow their cash pile and invest it in short-term assets like Treasury bills or longer-term investments like bonds and stocks. This cash generation is a big reason Buffett loves investing in the industry.\nBerkshire Hathaway has invested in numerous insurance companies over the years. In 2022, the conglomerate acquired Alleghany for $11.6 billion, adding it to GEICO, Berkshire Hathaway Reinsurance Group, and National Indemnity. It also held a few insurance-focused companies in its portfolio but recently eliminated its holdings in Marsh & McLennan, Globe Life, and Markel -- perhaps to clear space for Chubb.\nOver time, insurance is an excellent business for those who can consistently balance the risks and rewards and underwrite profitable policies.\nWhen evaluating an insurer's underwriting ability, the combined ratio can be an excellent starting point. This ratio shows the claims costs plus expenses that go into selling and underwriting policies divided by the premiums collected.\nThe industry average combined ratio is around 100%, meaning insurers, on average, collect just enough premiums to cover their expenses and claims. When a company consistently beats its industry peers, you have a good candidate for a long-term investment.\nChubb is a diversified insurer that writes policies covering commercial property and casualty, personal lines like automotive or homeowners insurance, accident and health, agriculture, and reinsurance. The diversified insurance company has displayed a stellar history of underwriting profitable policies, with its combined ratio averaging 91% over the past two decades while consistently beating industry peers.\nWell-run insurance companies can make excellent investments because their products are always in demand. People and businesses protect against losses, and regulations often require people to have insurance, whether for auto, homeowners, or other insurance. For this reason, insurers grow along with the U.S. economy.\nInsurers can also grow when inflation increases and interest rates rise. That's because insurers see claims costs in real time and can adjust their rates when new policies begin. Since 2021, inflationary pressures have impacted insurers, causing repair and replacement costs to skyrocket. Last year, insurers saw their largest first-quarter underwriting loss in a decade and have raised their premiums in response. Over the past three years, Chubb's net written premiums have grown 40%.\nIn addition, these companies have a cash pile (float) that can generate higher interest income when interest rates rise, providing them with another lever of growth in this particular environment. Last year, Chubb earned $4.9 billion in net investment income, a growth of 32% from the prior year.\nBerkshire's purchase of Chubb is a solid choice that makes sense given Buffett's prior history with insurance. Although I thought Berkshire would buy Progressive, Chubb may be a better fit. Berkshire already owns GEICO, so it may not want to invest in a direct competitor and add more exposure to auto insurance. Instead, Chubb casts a wide net, providing Berkshire with broad exposure to the industry.\nThe insurance business isn't exciting, but those who do it well produce stellar cash flows -- which is why investors would be smart to follow Buffett and invest in some high-quality insurance companies today.\nBefore you buy stock in Chubb, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chubb wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $566,624!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nCourtney Carlsen has positions in Progressive. The Motley Fool has positions in and recommends Berkshire Hathaway and Markel Group. The Motley Fool recommends Progressive. The Motley Fool has a disclosure policy.\nBerkshire Hathaway's Mystery Stock Revealed: Here's Why It's an Ideal Warren Buffett Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-08T10:03:00.000Z",
        "Title": "Here Are 3 Big Reasons Berkshire Hathaway Is Sitting on Almost $190 Billion in Cash",
        "Author": "  Matt Frankel, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) recently released its first-quarter earnings, and we learned that the company's cash stockpile has grown to nearly $189 billion, which is by far the most it's ever had.\nMany investors, including Berkshire CEO Warren Buffett, would love to find an attractive way to invest that capital, but the conglomerate has had no such luck. And maybe investors should be patient, as a large amount of cash is a more attractive asset than it was a few years ago.\nWith that in mind, Berkshire's cash has swelled to an all-time high for some good reasons. Here are three that investors should be aware of.\nFirst off, Berkshire generated quite a bit of cash in the first quarter. In addition to about $11.2 billion in operating earnings from its businesses, Berkshire also sold about 13% of its massive investment in Apple (NASDAQ: AAPL), likely resulting in nearly $20 billion for Berkshire.\nIt's worth noting that Berkshire sold some Apple stock not because Warren Buffett's opinion on the business is changing, but for tax purposes. In the annual meeting, Buffett implied that the decision to sell some Apple was made in anticipation of higher tax rates in the future. (Selling locks in today's rates.) This sale will still result in a substantial tax bill for Berkshire, but it still adds significant cash to the company's bank accounts.\nAlthough it wasn't quite as large, it's also worth noting that Berkshire sold its entire stake in Paramount (NASDAQ: PARA), which likely brought in around $800 million. This investment was sold at a loss and could help offset the tax burden from the Apple sale.\nIn recent years, Buffett has discussed the lack of attractive investment opportunities several times. Business valuations have been generally high, and Berkshire has grown so large that it would need to make a big acquisition to really move the needle and put a dent in its cash hoard.\nAs Buffett said at the recent annual meeting, \"We only swing at pitches we like.\" And Berkshire clearly hasn't seen many of them lately.\nAnother big reason Buffett isn't in any big hurry to deploy Berkshire's capital is the rising interest rate environment. Of the cash on Berkshire's balance sheet, $153.4 billion is invested in short-term U.S. Treasury bills, which Buffett said were yielding about 5.4%. The other $35 billion is probably earning some interest as well -- it isn't simply a room full of physical cash.\nThis means that Berkshire is making at least $8.3 billion in annual income from its cash. While this isn't exactly a stellar yield, it is certainly a significant amount of income. It wasn't too long ago that short-term Treasuries were paying near-zero interest rates, so its cash has essentially become a new source of income for Berkshire.\nTo be clear, the high-rate environment isn't the only reason Berkshire has built such a massive cash position. At the Berkshire meeting, Buffett said: \"We don't use it now at 5.4%, but we wouldn't use it if it was at 1%. Don't tell the Federal Reserve.\" But it's fair to say that being able to earn billions in annual income on the cash stockpile doesn't exactly give Buffett a big sense of urgency to deploy this capital.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $564,547!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 6, 2024\nMatt Frankel has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nHere Are 3 Big Reasons Berkshire Hathaway Is Sitting on Almost $190 Billion in Cash was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-07T05:01:13.000Z",
        "Title": "Decoding Berkshire Hathaway Inc (BRK.A): A Strategic SWOT Insight",
        "Author": "  GuruFocus Research ",
        "Text": "Comprehensive SWOT analysis based on the latest 10-Q filing to guide investment decisions.\nDeep dive into Berkshire Hathaway's financial health and strategic positioning.\nExpert examination of the conglomerate's competitive advantages and potential risks.\nWarning! GuruFocus has detected 5 Warning Signs with SBAC.\nOn May 6, 2024, Berkshire Hathaway Inc (NYSE:BRK.A) filed its 10-Q report, providing a detailed look at the company's financial performance for the first quarter of the year. As a diversified holding company with a strong focus on insurance and a vast portfolio of subsidiaries across various sectors, Berkshire Hathaway's financial stability remains a cornerstone of its success. The latest filing reveals a robust balance sheet with significant liquidity, a testament to the conglomerate's prudent financial management and strategic investment decisions. This SWOT analysis delves into the strengths, weaknesses, opportunities, and threats as presented in the 10-Q filing, offering investors a nuanced understanding of Berkshire Hathaway's market position and future prospects.\nFinancial Resilience and Diversified Revenue Streams: Berkshire Hathaway Inc (NYSE:BRK.A) continues to exhibit exceptional financial strength, with a shareholders' equity of $571.5 billion as of March 31, 2024, an increase from the previous quarter. The company's diverse array of subsidiaries across insurance, utilities, manufacturing, and retail contributes to a stable and varied revenue base, insulating it from sector-specific downturns. This financial resilience is further bolstered by a significant cash reserve, including $156.2 billion in U.S. Treasury Bills, ensuring ample liquidity for strategic investments and operations.\nRobust Investment Portfolio: The company's investment portfolio, valued at $353.0 billion (excluding investments in Kraft Heinz and Occidental common stock), showcases a strategic mix of equity and fixed maturity securities. Berkshire Hathaway's disciplined investment approach, led by Chairman and CEO Warren E. Buffett, has historically yielded substantial returns and continues to be a key driver of value creation for shareholders. The portfolio's performance, despite market volatility, underscores the company's adeptness in asset management and its capacity to capitalize on market opportunities.\nExposure to Market Volatility: Despite a strong investment record, Berkshire Hathaway Inc (NYSE:BRK.A) is not immune to the inherent volatility of the equity markets. The company's substantial holdings in publicly traded securities mean that its earnings can be significantly affected by market fluctuations, as evidenced by the $1.5 billion in after-tax investment gains impacting net earnings in the first quarter of 2024. This exposure necessitates a cautious approach to investment management and may lead to earnings volatility that could concern short-term investors.\nDependence on Key Individuals: The company's success is closely tied to the investment acumen and leadership of Warren E. Buffett. While Berkshire Hathaway benefits from a decentralized management structure for its subsidiaries, the strategic direction provided by Buffett is integral to its overall performance. This reliance on key individuals poses a risk in terms of succession planning and maintaining the company's strategic vision in the future.\nStrategic Acquisitions and Investments: Berkshire Hathaway Inc (NYSE:BRK.A) has a history of making strategic acquisitions that enhance its competitive position and open new avenues for growth. The recent full acquisition of Pilot, a leading operator of travel centers, exemplifies this approach. With substantial cash reserves, Berkshire Hathaway is well-positioned to pursue additional acquisitions that align with its long-term value creation philosophy.\nGlobal Expansion: While Berkshire Hathaway has a strong presence in the United States, there are significant opportunities for international expansion. By leveraging its financial strength and reputation, the company can explore investments and partnerships in emerging markets, which could lead to new sources of revenue and diversification of its business portfolio.\nRegulatory and Legal Risks: As a large conglomerate with operations in various sectors, Berkshire Hathaway Inc (NYSE:BRK.A) is subject to a complex web of regulations. Changes in laws, regulations, or policies, particularly in the insurance and financial sectors, could impact the company's operations and profitability. Additionally, the company is involved in various legal proceedings, the outcomes of which could have financial implications.\nEconomic Downturns: While Berkshire Hathaway's diversified business model provides a buffer against sector-specific risks, the company is not immune to broader economic downturns. A prolonged recession could lead to reduced consumer spending, affecting its retail and service businesses, and potentially leading to increased claims in its insurance segments.\nIn conclusion, Berkshire Hathaway Inc (NYSE:BRK.A) stands as a paragon of financial stability with a formidable investment portfolio and a diversified business model. While market volatility and reliance on key leadership pose challenges, the company's strategic acquisitions and potential for global expansion present opportunities for sustained growth. Regulatory uncertainties and economic headwinds remain threats that require vigilant management. Overall, Berkshire Hathaway's strategic positioning and robust balance sheet place it in good stead to navigate the complexities of the global market.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-27T12:46:00.000Z",
        "Title": "Warren Buffett's Biggest Purchases for Berkshire Hathaway Last Quarter Don't Show Up in Its Portfolio",
        "Author": "  Adam Levy, The Motley Fool ",
        "Text": "Warren Buffett has a reputation as one of the greatest investors of all time -- and the track record to back it up.\nSince taking over as the CEO of Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) in 1965, he's produced a compound average annual return of 19.8% for its investors. He's done that by following his late partner Charlie Munger's advice to buy wonderful businesses at fair prices. Those show up as wholly owned subsidiaries within the growing Berkshire conglomerate, as well as equity investments in its portfolio.\nLike all large institutional investors, Berkshire Hathaway is required by the Securities and Exchange Commission to publish its equity portfolio's holdings for the public using form 13F every quarter. Following Buffett's portfolio can provide a lot of great investment ideas and insight into how he thinks about portfolio management.\nThe Oracle of Omaha made several significant moves in the portfolio in the third quarter. He sold shares of Apple and revealed a stake in Chubb. He and his fellow portfolio managers also continued to add to Berkshire's significant stakes in Occidental Petroleum and Liberty Media.\nBut two of his biggest purchases for Berkshire won't show up in the portfolio at all. You'll have to dig into Berkshire's most recent quarterly earnings report to see where Buffett is investing Berkshire's money.\nThere's one stock Buffett has bought in each of the last 23 quarters dating back to mid-2018, and last quarter was no exception. He spent $2.6 billion buying back shares of Berkshire Hathaway. That's more than he spent on any single stock in the first quarter. (Note: Combined purchases of Class A and Class C shares of Liberty Media exceeded $2.6 billion.)\nThe board of directors updated Berkshire's share repurchase program in 2018 to allow Buffett to buy back shares as long as he considered the price per share to be below the intrinsic value of the stock, as determined on a conservative basis. As long as he kept at least $30 billion of cash on Berkshire's balance sheet, he could buy as much of the stock as he felt was appropriate.\nBuffett's spent more buying back shares of Berkshire over the past six years than he's spent on any other equity investment. Every time Buffett repurchases shares, he gives remaining shareholders a larger stake in everything Berkshire owns, including its core insurance operations, its railroad business, its equity portfolio, and its portfolio of other cash-flowing businesses.\nBuffett's decision to buy Berkshire stock has paid off handsomely for shareholders over the past five years. Shares currently trade near an all-time high, which means Buffett got a relative bargain on his previous purchases. Even today, the stock is a good value, with shares trading around 19 times forward earnings estimates. When you remove the balance of its cash and equity portfolio, core operations are valued at just $322 billion, which is less than 9 times last year's core operating earnings.\nIt's a good bet Buffett will continue to buy back stock going forward, and remaining shareholders will keep growing their portion of Berkshire's profits as a result.\nMany think of Apple as Buffett's largest investment holding for Berkshire Hathaway, but another asset has taken over in the past year or so. Berkshire Hathaway holds about $189 billion in cash and Treasury bills on its balance sheet. By comparison, its Apple stake is worth about $150 billion.\nBuffett continued to add to his Treasury bills last quarter. He even sold some of Berkshire's stake in Apple, mostly using the proceeds to buy more Treasuries. The balance increased by more than $21 billion when you factor in stock sales and Berkshire's cash flow from its core operations.\nTreasury bills are Buffett's default place to keep cash while looking for a good business or stock to buy. Treasury bills refer to U.S. government bonds maturing within one year, but most of Buffett's holdings mature within six months. That typically means accepting a lower interest rate in exchange for the greater flexibility of shorter-dated bonds. Right now, however, Buffett's benefiting from expectations for lower interest rates in the future, giving him a higher yield on his short-term loan to the government than he would get buying debt with longer maturities.\nBut Buffett isn't just sitting on the sidelines due to high interest rates. He simply doesn't see any great investment opportunities in the market for Berkshire Hathaway. He bought a sizable stake in Chubb over the last three quarters, but that's only amounted to a position worth about $6.9 billion despite buying up over 6% of shares outstanding. Buffett's biggest challenge has become finding an investment sizable enough that it can truly move the needle for Berkshire, which has become the seventh-largest publicly traded company.\nWhile Buffett's Treasury bills won't show up in Berkshire's portfolio, they're becoming impossible to ignore for investors. It'll take a significant change in market conditions for Buffett to put the growing cash pile to work.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $652,342!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nAdam Levy has positions in Apple. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nWarren Buffett's Biggest Purchases for Berkshire Hathaway Last Quarter Don't Show Up in Its Portfolio was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-07T12:00:00.000Z",
        "Title": "Berkshire Hathaway Stock vs SPY: Which Is Best?",
        "Author": "  Kent Thune ",
        "Text": "While investors have focused on high-flying Magnificent 7 stocks, Warren Buffett’s Berkshire Hathaway has quietly outperformed the SPDR S&P 500 ETF Trust (SPY), the stock market proxy and largest exchange-traded fund on the market.\nAs a conglomerate that owns shares of 41 publicly traded companies, Berkshire possesses multiple ETF qualities and makes for an interesting comparison to SPY and other ETFs tracking the S&P 500.\nIn this educational article, we break down the key similarities and differences between Berkshire Hathaway Stock and the SPY ETF.\nBerkshire Hathaway Inc. is a multinational holding company headquartered in Omaha, Nebraska. Led by co-founder, chairman and CEO Warren Buffett, Berkshire has built a reputation for successful value investing and long-term outperformance of the broader stock market, hence Buffett’s “Oracle of Omaha” nickname.\nHere's a breakdown of Berkshire Hathaway's key characteristics:\nFounded in 1839 as a textile manufacturer, it transformed into a conglomerate under Buffett's leadership in the 1960s.\nBerkshire Hathaway doesn't directly manufacture or sell products. Instead, it owns a diverse portfolio of subsidiaries and equity investments in various sectors.\nBerkshire Hathaway is known for its value investing philosophy, focusing on acquiring undervalued companies with strong long-term potential.\nFor companies it owns, Berkshire prioritizes financial strength, stable businesses, and excellent management, and it often holds its investments for long periods.\nBerkshire Hathaway owns a wide range of businesses, including insurance companies like its wholly owned subsidiary, GEICO, as well as utilities and railroads. Top stock holdings include Apple Inc., Amazon.com Inc., and American Express Co. \nBerkshire Hathaway has a long history of successful investment performance, generating significant returns for shareholders under Warren Buffett's leadership.\nFrom 1965 to 2022, Berkshire Hathaway stock averaged a 20% compound annual growth rate, which compares to 9.9% annualized return for the S&P 500 in that period, according to U.S. News.\nThe SPY ETF is the SPDR S&P 500 ETF Trust, the largest and one of the most widely traded exchange-traded funds in the world with over $500 billion in assets under management. It passively tracks the performance of the S&P 500 index, which represents the 500 largest publicly traded companies in the United States.\nSince SPY holds hundreds of companies, it offers instant diversification across different industries and sectors. This diversification helps mitigate risk compared to investing in individual stocks.\nCompared to actively managed funds, ETFs like SPY typically have lower expense ratios. The expense ratio covers the operational costs of the ETF. In the case of SPY, the expense ratio is around 0.095%, which translates to $9.50 per year for a $10,000 investment. Some S&P 500 ETFs have expense ratios as low as 0.03%.\nSPY is a highly liquid ETF, meaning you can easily buy and sell shares on a stock exchange throughout the trading day.\nSPY's performance is directly tied to the S&P 500 index. Historically, the S&P 500 has outperformed more than 80% of large-cap stock funds over the long term, but with periods of volatility.\nHere's a head-to-head comparison of Berkshire Hathaway (BRK.A & BRK.B) and the SPDR S&P 500 ETF Trust (SPY):\nFeature\nBerkshire Hathaway Stock\nSPDR S&P 500 ETF Trust (SPY)\nInvestment Style\nValue investing, actively managed\nGrowth/Value blend, passively managed\nDiversification\nConcentrated portfolio\nHighly diversified\nFees\nNo management fees\nLow expense ratio (0.095%)\nLiquidity\nBRK.A low, BRK.B more liquid\nHighly liquid\nPerformance\nHistorically outperformed S&P 500\nHistorically outperformed average large-cap fund\nValuation\n9.1 P/E ratio\n20.8 P/E ratio\nMarket Cap\n$870 billion\n$507 billion\nDividends\nDoes not pay dividends\nHas historically paid quarterly dividend\nData as of May 3, 2024, from Morningstar and Y Charts.\nBerkshire Hathaway: Focuses on value investing, selecting individual companies believed to be undervalued with strong long-term potential. Managed by Warren Buffett and his team, with a focus on long-term holding periods.\nSPY ETF: Passively tracks the S&P 500 index, providing exposure to the performance of the 500 largest U.S. publicly traded companies.\nBerkshire Hathaway: Owns a concentrated portfolio of approximately 40 wholly owned subsidiaries and significant equity investments in various sectors. While diverse, it's not as diversified as an S&P 500 ETF.\nSPY ETF: Provides instant diversification across 500 companies in various sectors of the US economy. Since it’s cap-weighted, the heaviest allocations lean toward mega-cap tech stocks like Apple, Microsoft Corp., and Nvidia Corp.\nBerkshire Hathaway: Doesn't charge management fees.\nSPDR ETF: Has a low expense ratio of 0.09%, which covers the costs of managing the ETF. Other S&P 500 ETFs, such as the iShares S&P 500 Index (IVV) and Vanguard S&P 500 ETF (VOO), have lower expense ratios at 0.03%.\nBerkshire Hathaway: BRK.A shares are very expensive at over $600,000 per share, making them less accessible to many investors. BRK.B shares are more affordable at just above $400 per share but have limited voting rights.\nSPY ETF: Highly liquid with tight bid-ask spreads for easy buying and selling.\nBerkshire Hathaway: Has historically outperformed the S&P 500 over the long term under Warren Buffett's leadership. However, past performance doesn't guarantee future results.\nSPY ETF: Reflects the historical performance of the S&P 500 index, which has generated consistent growth and outperformed more than 80% of professional money managers in the long term, albeit with periods of volatility.\nBerkshire Hathaway: The company’s price-earnings ratio was 9.1, as of May 6, 2024, according to Y Charts.\nSPY ETF: The average holding P/E ratio for SPY was 20.8, as of May 2, 2024, according to Morningstar.\nInvestors who have faith in Warren Buffett's investment philosophy and are comfortable with a concentrated holding, Berkshire Hathaway might be an option. However, due to the high price of BRK.A shares, BRK.B might be more accessible for some investors, though they come with limited voting rights.\nInvestors preferring a diversified, low-cost approach that tracks the overall market, SPY is a suitable choice. In addition, SPY offers potential dividend income while Berkshire Hathaway doesn't pay dividends.\nBefore buying shares of either investment, investors should their investment goals, time horizon, and risk tolerance.\n\nPermalink | © Copyright 2024 etf.com. All rights reserved\n"
    },
    {
        "Date": "2024-05-08T16:33:00.000Z",
        "Title": "Is Berkshire Hathaway Stock Going to $734,820? 1 Wall Street Analyst Thinks So.",
        "Author": "  Rich Smith, The Motley Fool ",
        "Text": "Warren Buffett's investing conglomerate, Berkshire Hathaway (NYSE: BRK-A)(NYSE: BRK-B), had a fabulous first quarter, crushing analyst expectations with $90.9 billion in revenue (analysts expected only $86.4 billion) and reporting $8,825 per share in profit (for the \"A\" shares), 21% better than the Street's expected $7,309 per share. And how did investors respond?\nThey bid the stock up half a percentage point.\nHalf.\nBut not to worry, says investment bank UBS. Despite investors' underwhelming response to the news, Berkshire Hathaway stock is still a buy. In fact, \"A\" shares of the company that closed Monday around $606,000 will rise to the incredibly precise figure of $734,820 within a year.\nIt may be only a coincidence that UBS raised its valuation on Berkshire Hathaway stock by exactly the amount on Saturday's earnings beat -- or it may be no coincidence. What's curious is that UBS recommends Berkshire Hathaway stock at all, considering the profits Berkshire earned were significantly less than what it earned a year ago.\nAs detailed in the company's report, profits per diluted share at Berkshire declined 64% year over year in Q1, despite Berkshire buying back 1.2% of its shares outstanding -- an action you'd ordinarily expect to concentrate earnings among fewer shares.\nMost of the decline, however, was out of Berkshire's control, being in the form of a $33.1 billion swing in the valuation of stocks owned in Berkshire's portfolio... that the company bought a while ago and still hasn't sold. These unrealized gains (a year ago) and losses (this year) accounted for literally all of the decline in Berkshire's earnings.\nMeanwhile, the company's operating profits actually increased by 39%, to $11.2 billion.\nIn other words, Berkshire Hathaway's core business continues to perform fabulously. Admittedly, the stock's not cheap at more than 1.5 times book value, and 28 times free cash flow. UBS's prediction of a price 21% higher would make Berkshire even more expensive -- perhaps even too expensive. But at a lower price, this long-term performer would indeed be a buy.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $554,830!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 6, 2024\nRich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway Stock Going to $734,820? 1 Wall Street Analyst Thinks So. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-05T21:50:51.000Z",
        "Title": "Berkshire Hathaway event gives good view of Warren Buffett's successor but also raises new questions",
        "Author": "  JOSH FUNK ",
        "Text": "This year's Berkshire Hathaway meeting gave shareholders their best chance yet to hear from the man who will one day take over as CEO when Warren Buffett is gone, but Buffett said for the first time Saturday that Greg Abel should also take responsibility for the company's investments after he takes over, raising new questions about the succession plan.\nAbel put his encyclopedic knowledge of the utility business that he led directly for years on display and delved into railroad operations and potential acquisitions that Berkshire pursued while sharing the stage with Buffett all day. For his part, the 93-year-old billionaire showed investors he is still sharp.\nAbel pointed out that it required a major culture shift to get workers at PacifiCorp and the other utilities, who have long focused all their energy on keeping the lights on, to think about shutting the power down at times when the risk that their power lines could spark wildfires is too great. He also said BNSF railroad is working on getting “our cost structure right” after delivering disappointing results.\nSuccession was clearly top of mind for many of the thousands of people who filled an Omaha arena to listen to the two men after last fall's death of Vice Chairman Charlie Munger. Buffett, Abel and Ajit Jain, Berkshire's other top executive who oversees the company's insurers, reassured investors that Berkshire's board spends plenty of time focused on “what would happen to the operation if I get hit by a truck,” as Jain put it. Finding the right replacement for any of the three of them will be important.\nPreviously, Buffett had said that when Abel becomes CEO, investment managers Ted Weschler and Todd Combs, who's also taken on the responsibility of being Geico's CEO, would handle Berkshire's massive portfolio. But Buffett said Saturday that his thinking has evolved, and that “I would probably, knowing Greg, I would leave the capital allocation to Greg.\"\nAnd Buffett said because Abel understands businesses so well, he also understands stocks.\nBut Edward Jones analyst James Shanahan said a good business doesn't always make a good stock unless you get the timing and position size right, and there is an art to that.\n\"I think stock picking is hard. I don’t think it’s something you can just start doing and be good at it,\" Shanahan said.\nAbel does have a history of making multibillion-dollar deals when he was the head of Berkshire's utility unit for a decade, including the acquisitions of NV Energy and AltaLink, but he's never been a stock picker. Weschler and Combs might be able to help Abel get the timing right and find opportunities in the stock market, but Buffett didn't say that Saturday.\nAbel just reassured shareholders that \"the capital allocation principles that we use today will be maintained.”\n“Does that give you more or less confidence post-Buffett? I would say it’s got to give you less — not because it’s a worse circumstance — but because it hasn’t been very transparent and communicated that clearly. You’ve got to start asking, well, what else is going to change?” said Cole Smead with Smead Capital Management.\nAbel definitely has the confidence of the CEOs at all of Berkshire's many varied noninsurance businesses who report to him and ask his advice on any challenges they are facing.\n“Greg sees so much more than I do on a daily basis. So his perspective is valued, and his wisdom is something that is such a luxury for all of us to be able to tap into,” said Dan Sheridan, who just became CEO of Brooks Running this year after his predecessor retired. He said Abel is always humble and curious about the business, even while asking challenging questions.\nSee's Candies CEO Pat Egan added that Abel reflects all of Berkshire's core values, with the company's emphasis on integrity, taking care of customers and strengthening brands, while still giving Berkshire's subsidiaries the freedom to operate independently.\n“He really expects us to know our business, understand the parameters, and to run our business on a day to day basis,” said Tim Baucom, CEO of flooring giant Shaw Industries. “So I feel like I have all the freedom of the world, but with freedom comes responsibility.”\nThe shareholders who attended the meeting and spent hours shopping and talking with executives at the booths Berkshire subsidiaries set up when they weren't listening to Buffett and Abel remain confident. Some of them even got the chance to take selfies with Abel, though Buffett no longer tours the exhibit hall in public.\n“I think they'll be fine,” said Michael Grizzard, who made the trip to Omaha from Richmond, Virginia, for the second time. “They're in good hands, and I think they have a good culture.”\nSmead said even Buffett, who is easily one of the greatest investors the world has ever seen, has been having a hard time lately finding good investments big enough to make a difference at Berkshire except for the $135 billion Apple stake that remains its largest investment even after some trimming this year.\nSo no matter how good an investor Abel is, he will have a hard time finding deals big enough to provide a meaningful boost to Berkshire's earnings that approached $13 billion in a down first quarter. That challenge is a big part of why Buffett has warned investors not to expect any of the \"eye-popping performance\" of Berkshire's past.\nBut for now, Buffett showed that Abel may not need to take over anytime soon because he looked good and he has long said he has no plans to retire, even if he acknowledged Saturday that he doesn't have the same energy he used to. CFRA Research analyst Cathy Seifert came away impressed with his stamina.\n“There wasn’t anything in that performance that I found worrisome or troubling,” Seifert said.\n___\nFor more AP coverage of Warren Buffett look here: https://apnews.com/hub/warren-buffett. For Berkshire Hathaway news, see here: https://apnews.com/hub/berkshire-hathaway-inc. Follow Josh Funk online at https://apnews.com/author/josh-funk,https://www.twitter.com/funkwrite and https://www.linkedin.com/in/funkwrite.\n"
    },
    {
        "Date": "2024-05-15T10:15:00.000Z",
        "Title": "Should You Buy Berkshire Hathaway While It's Below $625,000?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is a stock that most investors know about and that many would like to say they own. The problem is that buying a share of the conglomerate is rather costly, noting that the A share class has a 52-week high of around $647,000! With this stock now comfortably below $625,000, should you buy it? There are a few things to consider first.\nBerkshire Hathaway actually has two share classes, one with a price tag in the hundreds of thousands of dollars and the other with a more modest price in the hundreds. The more expensive shares can be converted into 1,500 of the less costly ones at the holder's option. Essentially, they both represent ownership in Berkshire Hathaway, just at different percentage levels. So, the first thing any investor needs to consider is which share class is more attractive.\nThe A and B shares generally trade in lockstep with each other, so the real question is how much money you have to spend. Most will probably want to opt for the B shares, given the lower price point. Berkshire Hathaway's B shares are currently trading at about $410 per share, down from their $52-week high of roughly $430.\nThe bigger question for most investors will be what they are buying when they add Berkshire Hathaway to their portfolio. This isn't as easy to discern as you might think. Although the company is usually lumped into the financial sector, its business goes well beyond that segment of the market.\nFor example, while Berkshire Hathaway owns the insurer GEICO, it also owns BNSF Railway, one of the largest train companies in North America. And it owns several regulated large utilities. And a number of midstream energy companies. These three businesses are so large that they get broken out as a separate item on Berkshire Hathaway's balance sheet. However, it also owns retail businesses, manufacturing operations, and chemical companies, among other things. Then there's the nearly $336 billion portfolio of stocks that Berkshire Hathaway owns.\nIn many ways, Berkshire Hathaway is more like a mutual fund than a company. That leads to two important concepts. First, you are really buying into the investment approach of Chief Executive Officer Warren Buffett. Second, even though there will be times when Berkshire Hathaway stock is out of favor, there's really no good or bad time to buy an investment approach. To sum up that approach, Buffett tends to buy historically well-run companies when they are out of favor, and then he holds on to them for the long term.\nIf that sounds like a good investment plan, then you might want to consider buying Berkshire Hathaway while it is trading below $625,000 per share (or around $415, in the case of the B shares). That said, the stock, despite the pullback from 52-week highs, is trading just a percentage point or two below its all-time highs. If you would rather wait for a lower price, 20% pullbacks aren't at all uncommon here.\nThe one thing you need to consider if you decide to try to time your entry point is that Berkshire Hathaway often pulls back sharply when the broader market is also pulling back sharply. So, it can be hard to pull the trigger if you don't make a specific plan to buy it ahead of time. Put another way, don't think you'll buy when the time is \"right\" because Berkshire Hathaway stock is likely to be most attractive while investors are selling stocks indiscriminately in a bear market. It's hard to be a contrarian when there's blood in the streets.\nIn some ways, there's really no good time to buy Berkshire Hathaway. When the stock is doing well, it might look expensive. When the stock is \"cheap,\" it will be hard to justify buying anything, let alone Berkshire Hathaway, because of a bear market. All in, if you want to buy Berkshire Hathaway you should probably just go ahead and start a position when you have the cash to do so. Over the long term, this unique stock has easily outdistanced the S&P 500 index because of the way the company is run, not because of any specific business within the company's highly diversified portfolio of investments (fully owned or partially owned). The one thing you do need to closely track, however, is that the investment approach doesn't change.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $553,880!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nShould You Buy Berkshire Hathaway While It's Below $625,000? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-30T19:00:39.000Z",
        "Title": "Berkshire Hathaway Profits From Crypto Despite Warren Buffet's Stance On Not Buying Even 'If All Were Offered To Me For $25'",
        "Author": "  emilylew@benzinga.com ",
        "Text": "Despite long-time Bitcoin skeptic Warren Buffett maintaining his critical viewpoint on cryptocurrencies, Berkshire Hathaway Inc. (NYSE:BRK) continues to benefit financially through its investment in Brazilian fintech Nu Holdings Ltd. (NYSE:NU).\nAlthough Buffett has been openly critical of Bitcoin, referring to it as “rat poison,” Berkshire Hathaway has reaped significant gains via its stake in Nu Holdings. Initially investing $500 million in a Series G funding round and an additional $250 million later, Berkshire’s involvement has paid off.\nDon't Miss:\nHolding 0.001 Bitcoin could make you a multimillionaire, according to Fidelity director — but for how long?\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\nIn 2018 interview with Yahoo Finance, Bitcoin’s value was questioned when Buffett said, “If you told me you own all of the Bitcoin in the world and you offered it to me for $25, I wouldn't take it because what would I do with it? I'd have to sell it back to you one way or another. It isn't going to do anything.” He views it as lacking production and relying solely on future price increases.\nNu Holdings, established in 2013, launched the Nucripto platform in 2022, allowing users to trade over 15 tokens. The company’s performance has been impressive, with a 100% market surge in 2023 and another 50% rise in early 2024.\nThis investment success has put Buffett in a tricky position, as Nu Holdings’ performance, up nearly 125% this year, is sharply contrasting with his negative stance on Bitcoin. Meanwhile, Bitcoin itself is having a remarkable year in 2024, significantly outperforming indices like the S&P 500.\nUnderstanding the broader context surrounding Berkshire Hathaway’s involvement with Nu Holdings can help assess the significance of this development. Warren Buffett’s strong objections to Bitcoin date back several years. He has consistently dismissed it as a non-productive asset without intrinsic value.\nBuffett's indirect exposure to cryptocurrencies through Nu Holdings highlights a nuanced shift in investment strategies. As reported earlier this year, Berkshire's increased exposure to companies dabbling in crypto may be reflective of a dynamic marketplace.\nIn early 2023, reports surfaced that global fintech adoption was on the rise. This trend underscores why Berkshire remains committed to fintech investments despite Buffett's personal misgivings (see Fintech Adoption On The Rise.\nBuffett’s portfolio management has always emphasized long-term profitability over short-term market trends. This strategy might explain why Berkshire continues to support Nu Holdings despite Buffett's well-publicized views on Bitcoin.\nThe broader implication is that even strong critics like Buffett can find lucrative opportunities in the growing ecosystem of digital assets, signifying an important aspect of financial diversification and adaptation.\nRead Next:\nWarren Buffett flipped his neighbor's $67,000 life savings into a $50 million fortune — How much is that worth today?\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Berkshire Hathaway Profits From Crypto Despite Warren Buffet's Stance On Not Buying Even 'If All Were Offered To Me For $25' originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-04T21:08:49.000Z",
        "Title": "Berkshire Hathaway annual shareholders meeting: Warren Buffett talks Apple, AI, Paramount, and more",
        "Author": " Myles Udland    · Head of News",
        "Text": "The Berkshire Hathaway (BRK-A, BRK-B) annual shareholders meeting on Saturday was the first in a new era for the conglomerate.\nSaturday's meeting marked the first time CEO Warren Buffett took questions from shareholders following the death of Berkshire Hathaway vice chairman Charlie Munger late last year at the age of 99.\nIn his annual letter to Berkshire shareholders, Buffett called Munger the \"architect\" of the modern Berkshire Hathaway, which takes its name from a now-defunct textile company in New England and has grown to be the largest conglomerate in the S&P 500 (^GSPC).\nFor the first time, non-shareholders were also able to watch the annual shareholders' movie, which featured a montage of some of Munger's best punchy quotes through the years, as well as some of the celebrity cameos that have been featured in these movies.\nBuffett, along with Berkshire vice chairs Greg Abel and Ajit Jain, took several hours of questions from shareholders.\nIn the early going of the Q&A, Buffett discussed the company's decision to pare its holdings of Apple (AAPL) during the first quarter, saying that while the company did sell shares, it is, in his view, \"extremely likely\" that the company will remain its largest equity investment at the end of the year.\nAs expected, Buffett fielded several questions about artificial intelligence and the impact it could have on Berkshire's portfolio or other considerations for investors. Buffett said time and again he is no AI expert, at one point characterizing himself as someone who \"doesn't understand a damn thing about it.\"\nStill, Buffett analogized the advent of the AI boom to the discovery of the nuclear bomb on more than one occasion, saying these two technologies are proverbial genies that cannot be put back in the bottle.\nAs for the company's growing pile of cash and Treasury holdings, Buffett said it is likely the value of these holdings will exceed $200 billion during the current quarter, noting he's \"quite satisfied\" with the position.\nAsked about Berkshire's appetite for increasing investments overseas, and in China specifically, Buffett said, \"Our primary investments will always be in the United States.\"\nOn succession, Buffett said Abel should be in charge of directing Berkshire's investments after his passing. Abel is set to take over as Berkshire CEO after Buffett; investment managers Todd Combs and Ted Weschler joined the company over a decade ago and have contributed to many changes within Berkshire's equity portfolio over those years.\nToward the end of the proceedings, Buffett spoke about Federal Reserve policy for the first time, suggesting to shareholders that the US government's accumulated deficit garners more of his attention than Fed policy.\nAt the conclusion of the Q&A session, Buffett left the audience with a last bit of wit — \"I not only hope that you come next year, but I hope I come next year.\"\nWarren Buffett loves index funds.\nIn his 2016 letter to shareholders, he wrote: \"If a statue is ever erected to honor the person who has done the most for American investors, the hands-down choice should be [Vanguard founder] Jack Bogle.\"\nAccordingly, Buffett has recommended most investors put most of their money in index funds that track the broader market. And that includes family.\nOn Saturday, Buffett was asked by a shareholder who submitted a question to CNBC's Becky Quick about his prior comments that he has 90% of his wife's inheritance in a low-cost S&P 500 index fund.\nThe shareholder, specifically, wanted to know whether the current weighting of tech companies within the index would move Buffett to consider shifting this allocation to something like an equal-weighted index fund, which is what the name implies: a fund that holds all members in the S&P 500 in an equal proportion, rather than proportionally by size, the way the index is constituted.\nLast fall, as the S&P 500 stumbled and Wall Street strategists offered views on what was next for the market, strategists were arguing for the merits of a position in the equal-weighted index given the run the \"Magnificent Seven\" had had to that point.\nFast forward six months, and the market is in much the same place.\nIn response to the question on Saturday, Buffett simply said: \"That's an interesting question.\"\nOf course, Buffett's responses are never (quite) that brief. And, in the end, Buffett noted he's made no recommended investment changes amid regular revisions of his will.\nBuffett added that given how much money his wife is set to inherit, it doesn't matter whether she outperforms the S&P 500 or not. \"The main thing is that she feels she's in a financial position ...that she doesn't even need to think about it,\" Buffett said.\nParamount (PARA) was a bad investment for Berkshire Hathaway (BRK.A BRK.B), one made fully by Warren Buffett.\n\"It was 100% my decision,\" Buffett acknowledged. He noted Berkshire has sold out of Paramount.\n\"I lost money, and I did it all by myself,\" Buffett added.\nParamount shares are down 44% in the past year.\nThe company is now locked in a takeover battle that could be coming to an end soon.\nParamount shareholder and Ariel Investments founder John Rogers told Yahoo Finance (video below) this week that he fully supports the $26 billion offer reportedly put forth by Apollo (APO) and Sony (SONY). The other bidder includes studio outfit Skydance.\n(Disclosure: Yahoo Finance is owned by Apollo Global Management.)\nIn the closest thing we've gotten today to a macro comment on the market from Warren Buffett, the Berkshire CEO said when asked about why the company has been so cautious around new opportunities: \"We just haven't seen anything that makes sense.\"\nSome of the main themes to emerge from Saturday's meeting — in addition to the absence of Charlie Munger — were Berkshire's decision to pare its holdings in Apple (AAPL) during the first quarter and Buffett's lack of enthusiasm for new opportunities.\nHaving gone many years without a splashy acquisition to add to the Berkshire portfolio, Buffett said this has not been a time when the phone has been ringing off the hook.\nBack in his 2014 annual letter to Berkshire shareholders — which followed a particularly acquisitive run for Berkshire, after which Buffett said the firm owned nine-and-a-half of the firms that would be listed in the Fortune 500 — Buffett wrote: \"Our lines are out.\"\nThe next year, Berkshire bought Precision Castparts for $37 billion. The company has not made a sizable acquisition since.\nMoreover, the company's biggest outlay of capital toward any idea in the nearly decade since the Precision deal has been its purchases of Apple stock.\nA big vote of confidence for Buffett's successor, Greg Abel.\nIn response to a question, Buffett said Abel will have the final say over Berkshire's (BRK.A BRK.B) stock portfolio.\n\"He understands businesses,\" Buffett said of Abel. \"The responsibilities should entirely be with Greg.\"\nTesla (TSLA) CEO Elon Musk hasn't hidden his desire to be a big player in the auto insurance industry.\nHowever, Warren Buffett, CEO of GEICO owner Berkshire Hathaway (BRK.A BRK.B), offered up this dose of wisdom at the annual shareholder meeting when asked about Tesla and insurance:\n\"Insurance always looks easier than it is. It's so much fun because you get the money at the start, you know, and then you find out that you've done something stupid later on. But it's a very tempting business when somebody hands you money, and you hand them a little piece of paper.\"\nAdded Berkshire's insurance chief Ajit Jain: \"Tesla has been toying with the idea of writing insurance directly — it hasn't been much of a success.\"\nThis year's Berkshire Hathaway annual shareholder meeting has so far featured a very reflective Warren Buffett.\nWith Saturday marking the first Berkshire annual meeting since Charlie Munger's passing in November, the absence of Buffett's longtime right-hand man has, as one would expect, influenced the proceedings.\nAs Yahoo Finance's Seana Smith reported from inside the building in Omaha, Neb., Saturday is a \"tough day\" for Berkshire shareholders.\nBut Munger's absence has been felt in more ways than one.\nBuffett, at one point, turned to Charlie for his input on an answer, only to catch himself and earn a cheer from the audience\nBuffett also regaled the audience with a tale of the two stocks former vice chair Charlie Munger argued most forcefully Berkshire needed to buy — BYD (BYDDY) and Costco (COST) — and conceded he didn't listen enough on the latter.\nLongtime shareholders can likely insert their own imagined Munger one-liner in response. Without Munger's presence, Buffett's reflection more clearly lingered over the proceedings.\nAnd while it is not breaking news that an executive approaching his mid-90s might be reflecting more than forecasting, Buffett's overall tone Saturday is one that has been far more explicit about both his limitations today and his future inability to remake Berkshire Hathaway.\nBuffett noted that, at the age of 93, he doesn't operate \"at the same level of efficiency\" as he did a few decades ago. The Oracle of Omaha quipped he likely won't be signing any four-year employment agreements.\nOn artificial intelligence, Buffett offered a view that some of his experiences with the technology have made him nervous.\nBut he said, in the end, \"As someone who doesn't understand a damn thing about it, it has enormous potential for good and an enormous potential for harm.\"\nWhen asked by shareholders about future investments in China, Canada, and India, Buffett offered similar versions of a perspective that he held a limited view of what could one day be possible.\nBuffett noted that American companies would likely always be the most prominent part of Berkshire's portfolio. How the percentages may change will, Buffett knows, not be his call in the decades ahead.\nInsurance rates nationwide, across policy types, have soared in recent years.\nAnd no state has seen more turmoil than Florida.\nAsked Saturday about the condition of the Florida insurance market, Berkshire Hathaway vice chair Ajit Jain, who runs the conglomerate's sprawling insurance operations, said the state's insurance markets have had \"a few tough years.\"\nCiting challenges with the state's legal system and storms that have caused considerable damage in the state in recent years, Jain said the state has been one where it has been \"very difficult for a risk-bearer to make money.\"\nIn March, auto insurance rates in the US rose 22.4% over the prior year, the most in 47 years. The average auto insurance premium in Florida now stands north of $2,900 a year, the third-most expensive in the country.\nJain also noted that Florida is a market currently subsidized by the rest of the country — meaning that, on balance, as a state with a higher rate of more expensive claims, insurance operators in Florida make up these costs by collecting premiums in less volatile markets — but said this dynamic won't \"stand the test of time.\"\nIn the longer term, though, Jain appeared optimistic about the market, saying: \"I hope Florida will be a fairly buoyant insurance market. Because at the end of the day, they do believe in the free market more than some of the other states that have [an] insurance crisis, like California and New York.\"\nWith Apple (AAPL) CEO Tim Cook and Microsoft (MSFT) co-founder Bill Gates in the room, Warren Buffett struck a cautious tone on artificial intelligence.\nHe said he had an experience with AI that made him very \"nervous.\"\nHe saw an image of himself \"in front of his eyes\" that had his voice, was wearing his clothes, and delivered a message that was in \"no way from him.\"\n\"If I was interested in investing in scamming, [AI] is going to be the growth industry of all time. ... Obviously, AI has potential for good things too. ... As someone who doesn't understand a damn thing about it, it has enormous potential for good and an enormous potential for harm,\" Buffett said.\nBYD (BYDDY) and Costco (COST).\nThose are the two stocks Warren Buffett told Berkshire Hathaway shareholders on Saturday that Charlie Munger argued hardest for in their years together.\n\"Charlie twice pounded the table with me and said, 'Buy, buy, buy.' BYD was one of them, and Costco was the other,\" Buffett told shareholders. \"I should've been more aggressive in Costco.\"\n\"It wasn't fatal that we weren't,\" Buffett added. \"But [Charlie] was right, big time, in both companies.\"\nBuffett's answer came in response to a question from a shareholder about what it would take for the company to increase its investments in China. Currently, EV maker BYD is the company's only investment in the country.\nBuffett said: \"Our primary investments will always be in the United States.\"\nWarren Buffett is sitting on gobs of cash at Berkshire (BRK.A BRK.B), but don't expect any large deal to come from overseas.\nBuffett reiterated his love for investing in America:\n\"You won't find us making a lot of investments outside of the United States, though we're participating through these companies in the world economy. I understand the United States rules, weaknesses, [and] strengths. ... I don't have the same feeling generally around the world. And the lucky thing this is that I don't have to.\"\nBuffett did reaffirm his commitment to investing in Japan, however.\nAs Myles Udland pointed out, Berkshire (BRK.A BRK.B) sold some Apple (AAPL) shares in the first quarter.\nBuffett moved quickly to quiet concerns about the tech giant, saying this about whether his views on Apple have changed:\n\"No, but we have sold shares. ... At the end of the year, I would think it extremely likely that Apple is the largest common stock holding we have now. ... Charlie and I looked at common stocks ... as being businesses, so when we own a Dairy Queen or whatever it may be, we look at that as a business. ... We always look at every stock as a business.\"\nBuffett later compared Apple to longtime holdings American Express (AXP) and Coca-Cola (KO), noting that Apple will be a holding when Greg Abel takes over.\nYahoo Finance's Michael Kelley contributed to this post.\n... It doesn't show on Berkshire's (BRK.A BRK.B) cash and Treasury bill line on the balance sheet.\nBerkshire disclosed it held cash and T-bills of $182 billion at the end of the first quarter. Buffett told shareholders the number could reach $200 billion at the end of the second quarter.\nConcerns about the country's debt have started to pick up on Wall Street.\nBelow is what Bank of America (BAC) CEO Brian Moynihan told Yahoo Finance about our country's debt.\nIn case you ever need this fodder at a cocktail party...\nA major driver of Berkshire's $11.22 billion in operating profit in the first quarter came from the company's insurance operations, which totaled $5.2 billion in the first quarter.\nIn a discussion of the company's first quarter results, Buffett said Ajit Jain, who leads Berkshire's insurance operations, \"wants me to point out to everyone that you cannot take the insurance earnings of the first quarter and multiply by four. It just doesn't work that way in insurance.\"\nThe company's insurance risks are spread across geographies and disaster types, but Buffett noted that a major storm along the East Coast of the US would probably be the biggest risk for the firm. Hurricane season in the Atlantic runs from June through November.\nFor the first time, Berkshire Hathaway made its annual shareholder video public on Saturday. The video — which precedes the Q&A session at the annual meeting — featured a compilation of Charlie Munger and some of his best one-liners, a fixture at annual meetings and in other public appearances.\nMunger died in November 2023 at the age of 99.\nOne of the Mungerisms featured in the movie included Munger telling an earlier shareholder meeting: \"If I can be optimistic when I'm nearly dead, surely the rest of you can handle a little inflation.\"\nElsewhere, Munger added: \"The right way to make decisions in practical life is based on your opportunity costs. When you get married, you have to choose the best that will have you. And the rest of your life is the same damn way.\"\nAhead of Saturday's annual shareholder meeting, Berkshire Hathaway reported first quarter earnings that showed a record operating profit of $11.22 billion.\nIn the first quarter of last year, operating profits at Berkshire tallied $8.1 billion.\nThe company's investment gains, however, were down sharply from the prior year period, tallying just $1.48 billion against some $24.75 billion last year.\nApple's (AAPL) roughly 10% decline in the first quarter weighed on results here, with the tech giant accounting for around 40% of Berkshire equity holdings.\nIn its first quarter report, Berkshire also disclosed it lightened up its Apple holdings during the first quarter. At the end of 2023, the value of Berkshire's Apple position stood at $174.3 billion; at the end of Q1, this position's value stood at $135.4 billion.\nAt last year's annual meeting, Buffett took time, however, to emphasize to investors that this stock does not actually comprise this percentage of Berkshire's overall portfolio, which includes its other fully-owned subsidiaries.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-06-01T12:01:00.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Has Spent $77.5 Billion Buying This Stock Since 2018",
        "Author": "  Anthony Di Pizio, The Motley Fool ",
        "Text": "Warren Buffett is the head of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B). Since 1965, he has steered the investment company to a mind-boggling return of 4,384,748%, which could have turned $1,000 into more than $43 million. By comparison, the same investment in the S&P 500 would have returned just $312,230 over the same period.\nBerkshire wholly owns a number of private companies, like GEICO, Dairy Queen, and Duracell. But it also manages a portfolio of 47 publicly-listed stocks and securities worth $372.3 billion, which includes holdings in Apple, Coca-Cola, and Bank of America.\nBerkshire spent approximately $38 billion accumulating shares of Apple since 2016. It has sold some along the way, but its holding is now worth a whopping $150.2 billion, representing 40.3% of the conglomerate's portfolio. It's Berkshire's largest position by a wide margin.\nHowever, it spent almost twice as much -- $75 billion -- buying shares of another company between 2018 and 2023: Berkshire Hathaway.\nStock buybacks are a popular way for companies to return capital to shareholders. Berkshire was sitting on a $189 billion cash pile as of Mar. 31, and it's not easy for a company this size to find quality investments large enough to move the needle. As a result, Buffett has opted to spend some of it on buybacks.\nBerkshire spent a further $2.6 billion buying back stock during the first quarter of 2024, bringing the total to $77.5 billion since 2018. And it will probably continue to repurchase shares for the foreseeable future.\nYou might say Buffett is betting billions of dollars on himself. With his stellar 58-year track record, why wouldn't he?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $677,040!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 28, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWarren Buffett's Berkshire Hathaway Has Spent $77.5 Billion Buying This Stock Since 2018 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-15T23:30:48.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway reveals new $7 billion stake in Swiss insurer Chubb",
        "Author": "  JOSH FUNK ",
        "Text": "OMAHA, Neb. (AP) — Warren Buffett's Berkshire Hathaway on Wednesday revealed a new $7 billion stake in fellow insurer Chubb.\nBerkshire disclosed the investment it has been building over the past nine months in a quarterly filing with the Securities and Exchange Commission. Buffett's conglomerate had received permission to keep the Chubb investment confidential while it was still buying.\nBerkshire said it held nearly 26 million Chubb shares at the end of March, giving it a 6.4% stake in the company. Chubb shares jumped more than 7% in after-hours trading to sell for $271.82 after Berkshire’s investment was revealed.\nMany investors follow Berkshire's portfolio closely because of Buffett's remarkably successful track record over the decades, and some will certainly speculate that Berkshire could one day buy all of Chubb.\nBerkshire owns many other companies — including BNSF railroad, a number of utilities and an assortment of manufacturing and retail companies — but insurers, like Geico and General Reinsurance, have always been at the core of the Omaha, Nebraska-based conglomerate. So it makes sense that another insurer like Zurich-based Chubb might appeal to Buffett.\nCFRA Research analyst Cathy Seifert said in a note to investors that Chubb is now one of the 10 biggest holdings in Berkshire's portfolio. “We can’t speculate whether Berkshire would pursue an outright acquisition of CB, but we note their business mixes are highly complementary,\" Seifert wrote.\nThe quarterly filing doesn't say clearly whether Buffett or one of Berkshire's two other investment managers made the Chubb investment, but Buffett generally handles all the stakes worth $1 billion or more.\nBuffett already revealed some of Berkshire's most noteworthy moves at the company's annual shareholders meeting earlier this month.\nBerkshire sold off a little over 116 million Apple shares in the quarter — accounting for about 13% of its stake — to trim its biggest single investment. But it still holds nearly 790 million Apple shares, and Buffett told shareholders that he expected the iPhone maker to remain a long-term holding.\nBuffett also revealed at the annual meeting that Berkshire had sold off all of its Paramount Global investment at a loss. That happened after the first quarter ended because Wednesday's report showed Berkshire still owning more than 7.5 million shares.\nBerkshire has also been regularly filing updates as it makes purchases of Liberty Media stock because it holds more than 10% of that stock. At the last reports, Berkshire held 70 million Liberty Media Series C shares and more than 35 million Liberty Media Series A shares. Those stocks track the shares of satellite radio provider Sirius XM holdings and have been selling at what appears to be a discount to Sirius XM shares, according to Morningstar. Berkshire trimmed its stake in Sirius XM during the quarter.\nWednesday's filing revealed a number of other changes during the quarter, including the sale of all of Berkshire's remaining 22.8 million HP Inc. shares. It also trimmed its stakes in Chevron and Louisiana Pacific stocks.\n"
    },
    {
        "Date": "2024-05-03T11:03:45.000Z",
        "Title": "Here’s Why Berkshire Hathaway (BRK-B) Outperformed in Q1",
        "Author": "  Soumya Eswaran ",
        "Text": "The London Company, an investment management company, released “The London Company Large Cap Strategy” first quarter 2024 investor letter. A copy of the same can be downloaded here. During 1Q, U.S. stocks made significant gains due to steady economic growth, decreasing inflation, and a slightly weaker labor market, increasing the likelihood of a soft landing. The fund gained 8.3% (8.2%, net) during the quarter compared to a 10.3% rise in the Russell 1000 Index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2024.\nThe London Company Large Cap Strategy featured stocks like Berkshire Hathaway Inc. (NYSE:BRK-B) in the Q1 2024 investor letter. Headquartered in Omaha, Nebraska, Berkshire Hathaway Inc. (NYSE:BRK-B) engages in insurance, freight rail transportation, and utility businesses. On May 2, 2024, Berkshire Hathaway Inc. (NYSE:BRK-B) stock closed at $400.60 per share. One-month return of Berkshire Hathaway Inc. (NYSE:BRK-B) was -4.30%, and its shares gained 23.69% of their value over the last 52 weeks. Berkshire Hathaway Inc. (NYSE:BRK-B) has a market capitalization of $867.007 billion.\nThe London Company Large Cap Strategy stated the following regarding Berkshire Hathaway Inc. (NYSE:BRK-B) in its first quarter 2024 investor letter:\n\"Berkshire Hathaway Inc. (NYSE:BRK-B) - Insurance was once again a bright spot in Berkshire Hathaway's (BRK.B) 4Q earnings; GEICO showed meaningful margin improvement. The company once again sold some securities in the quarter, resulting in near all-time highs in the balance of cash & short- term investments. Overall, we continue to appreciate BRK.B for their financial strength, investment acumen, and disciplined management.\"\nA financial adviser in a suit talking with a senior client about their life insurance policy.\nBerkshire Hathaway Inc. (NYSE:BRK-B) is in 12th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Berkshire Hathaway Inc. (NYSE:BRK-B) was held by 117 hedge fund portfolios, compared to 116 in the previous quarter, according to our database.\nWe previously discussed Berkshire Hathaway Inc. (NYSE:BRK-B) in another article, where we shared the list of best magic formula stocks to buy. In addition, please check out our hedge fund investor letters Q1 2024 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n20 Beautiful Places in the World Ruined by Overtourism\n12 Best Alternatives to Adidas Samba\n12 Most Unfriendly Cities in Canada\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-05-04T21:45:38.000Z",
        "Title": "Warren Buffett Says Berkshire Hathaway Sold All of Its Paramount Stock: ‘We Lost Quite a Bit of Money’",
        "Author": "  Adam Chitwood ",
        "Text": "As Paramount comes off a rocky week in which the company lost its CEO and its exclusive merger talks window with Skydance came to an end without a deal, Berkshire Hathaway CEO Warren Buffett says his company has now sold its entire stake in Paramount. Berkshire Hathaway had previously sold a third of its stock in Paramount during the fourth quarter of last year.\n“We sold it all, and we lost quite a bit of money, that happens in this business too,” Buffett said on Saturday at Berkshire Hathaway’s annual meeting in Omaha, Nebraska. He added that he was “100% responsible” for the Paramount decision — both buying in and getting out.\nAccording to the company’s latest available filings, Berkshire owned 63.3 million shares of Paramount Global at the end of 2023. The company disclosed a $2.6 billion stake in Paramount in 2022 and picked up even more shares after that, but now they’re out.\n“Owning Paramount made me think even deeper, but I certainly looked harder about the whole question of what people do with their leisure time and what the governing principles are of running an entertainment business of any sort, whether it’s sports or movies or whatever it might be,” Buffett said at the meeting. “I think I’m smarter now than I was a couple years ago, but I also think I’m poorer because I acquired the knowledge in the matter I did.”\nOn Friday, after a month of exclusive talks between Paramount and Skydance, their negotiation window expired without a deal, signaling one is unlikely to happen. David Ellison’s Skydance submitted a revised offer earlier this week in an effort to assuage concerns that the deal benefits non-executive chairwoman Shari Redstone over other investors. Notable investors have warned they could pursue litigation if the Skydance deal or any other bid does not adequately benefit shareholders.\nAhead of the window closing and moments before the company reported its Q1 earnings, Paramount CEO Bob Bakish was ousted and replaced with a trio of executives to form an “Office of the CEO” — CBS CEO and president George Cheeks, Paramount Media Networks CEO and president Chris McCarthy and Paramount Pictures and Nickelodeon CEO and president Brian Robbins.\nSony Pictures Entertainment and Apollo Global Management have also submitted a non-binding, joint $26 billion all-cash offer for Paramount. That deal would see Sony take a majority stake and operational control, while Apollo would have a minority stake. But such a deal would likely face regulatory scrutiny due to limitations surrounding foreign ownership.\nFor now, Paramount is going it alone.\nThe post Warren Buffett Says Berkshire Hathaway Sold All of Its Paramount Stock: ‘We Lost Quite a Bit of Money’ appeared first on TheWrap.\n"
    },
    {
        "Date": "2024-05-07T21:02:28.000Z",
        "Title": "Berkshire Hathaway Q1 Earnings: A Detailed Analysis",
        "Author": "  GuruFocus Research ",
        "Text": "Net Earnings: Reported at $12,702 million, significantly below the previous year's $35,504 million, and exceeded the current quarterly estimate of $7,302 million.\nEarnings Per Share (Class A): Achieved $8,825, exceeding the estimated $6,155.28.\nOperating Earnings: Increased to $11,222 million from $8,065 million in the previous year.\nInsurance Underwriting: Grew to $2,598 million from $911 million year-over-year.\nInvestment Gains/Losses: Reported a net gain of $1,480 million, influenced by $11.2 billion in realized gains on sales of investments.\nShare Repurchases: Approximately $2.6 billion was used to purchase shares of Class A and Class B common stock during the quarter.\nInsurance Float: Reported at approximately $168 billion as of March 31, 2024.\nBerkshire Hathaway Inc (NYSE:BRK.A) released its 8-K filing on May 4, 2024, detailing its financial performance for the first quarter of 2024. The conglomerate, known for its broad portfolio including insurance, utilities, railroad, and manufacturing operations, reported a significant shift in earnings influenced by both operational activities and investment gains.\nBerkshire Hathaway, a holding company led by CEO Warren Buffett (Trades, Portfolio), operates across various sectors with its core business in insurance, conducted through subsidiaries like Geico and Berkshire Hathaway Reinsurance Group. The firm leverages the cash flows from these operations to support other business ventures, including Burlington Northern Santa Fe (railroad) and Berkshire Hathaway Energy, alongside a host of manufacturing, service, and retail entities.\nThe first quarter of 2024 saw Berkshire Hathaway achieving net earnings of $12,702 million, a stark contrast to the $35,504 million recorded in the same quarter the previous year. This year's earnings include $1,480 million from investment gains, significantly lower than the $27,439 million from the prior year, primarily due to a downturn in unrealized gains in equity security investments. The operating earnings stood at $11,222 million, up from $8,065 million in Q1 2023, indicating robust operational growth.\nThe company's insurance operations showed remarkable improvement, with underwriting profits rising to $2,598 million from $911 million in the previous year. Investment income from insurance also saw an increase, contributing positively to the bottom line. Other segments, including the BNSF railroad and Berkshire Hathaway Energy, reported mixed results but continued to provide stable earnings contributions.\nBerkshire Hathaway's strategic financial maneuvers included the repurchase of $2.6 billion worth of Class A and Class B shares during the quarter, reflecting confidence in the intrinsic value of the company despite market fluctuations. The firms insurance float, a critical indicator of insurance leverage, stood at approximately $168 billion, underpinning its insurance operation's financial health.\nWhile the decrease in net earnings year-over-year primarily resulted from lower investment gains, the substantial increase in operating earnings highlights the company's operational strength and efficiency. The diverse portfolio of Berkshire Hathaway allows for a balanced risk management strategy, although it is subject to market volatilities, as seen in the investment segment.\nOverall, Berkshire Hathaway's first quarter performance in 2024 paints a picture of a conglomerate with strong operational health and savvy financial strategies, poised to continue its legacy of growth and profitability. Investors are encouraged to view the detailed financial statements and notes available on the Berkshire Hathaway website to gain deeper insights into the company's comprehensive financial health.\nFor more detailed information, please refer to the official earnings release and consult with financial advisors to understand the implications of Berkshire Hathaway's performance on your investment portfolio.\nExplore the complete 8-K earnings release (here) from Berkshire Hathaway Inc for further details.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-23T09:50:00.000Z",
        "Title": "This Is Warren Buffett's Top Holding in His Berkshire Hathaway Portfolio -- and It's Not Apple",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "Don't be fooled by the fact that Warren Buffett reduced Berkshire Hathaway's stake in Apple by nearly 13% in the first quarter of 2024. The iconic investor still really likes Apple and plans to own the stock for a long time to come.\nBerkshire's 5.1% stake in Apple is worth over $150 billion. However, the tech giant isn't Buffett's top holding in his Berkshire Hathaway portfolio.\nTo be sure, Apple remains by far the top stock that Berkshire owns. But Buffett and his team have invested more heavily in another asset -- U.S. Treasury Bills. As of March 31, 2024, Berkshire had $156.2 billion in Treasuries, up from $129.6 billion at the end of 2023.\nU.S. Treasuries make up the biggest part of Berkshire's overall cash position. Adding the conglomerate's cash and cash equivalents at the end of Q1 to the Treasuries figure gives a total cash stockpile of $182.3 billion.\nThis number is likely to increase. Buffett said at Berkshire's recent shareholder meeting, \"I think it's a fair assumption that they'll [cash and Treasuries] probably be at about $200 billion at the end of this quarter.\"\nIt's not unusual for Berkshire to build a big cash position. However, the company has never had as much money in cash, equivalents, and short-term investments as it does now.\nThe obvious question is: Why has Buffett amassed such a huge cash stockpile? He provided an answer at Berkshire's shareholder meeting. Buffett stated, \"I don't mind at all under current conditions building the cash position. When I look at what's available in equity markets and the composition of what's going on in the world, we find it quite attractive.\"\nIt's easy to understand the first part of his response about \"what's available in equity markets.\" Buffett has moved beyond the purist value investing approach espoused by his mentor, Benjamin Graham, but he still views valuation as a critical factor in buying a stock.\nThe overall stock market is expensive using nearly any valuation metric. The S&P 500 cyclically adjusted price-to-earnings (CAPE) ratio is near its third-highest level ever. Some stocks are still attractively valued (as evidenced by Buffett's limited buying in recent quarters). However, the legendary investor continues to sit on the sidelines for the most part.\nBuffett didn't elaborate on what he meant by \"the composition of what's going on in the world.\" He could have been thinking of stubbornly high inflation keeping interest rates (and Treasury yields) at relatively high levels.\nOrdinary investors shouldn't blindly copy the moves of famous investors like Buffett. However, it can be wise to follow in their footsteps at times. Should you have plenty of cash on hand too? The answer is... it depends.\nIf you're an active stock picker, building a larger cash position makes sense. Valuations will become more attractive when the inevitable pullback happens. A solid cash stockpile will allow you to buy great stocks at a discount. You can bet that's what Buffett will do when the opportunity arises.\nOn the other hand, if you invest regularly (monthly, quarterly, etc.), your best approach is to continue doing so. Although you'll sometimes buy at premium prices with dollar-cost averaging, you'll also buy at cheaper prices at other times.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $584,435!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nKeith Speights has positions in Apple and Berkshire Hathaway. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nThis Is Warren Buffett's Top Holding in His Berkshire Hathaway Portfolio -- and It's Not Apple was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-20T13:00:15.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK.B) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this company have returned +2.9%, compared to the Zacks S&P 500 composite's +5.8% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway B falls in, has gained 5%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Berkshire Hathaway B is expected to post earnings of $5.52 per share, indicating a change of +19.5% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $18.48 points to a change of +7.6% from the prior year. Over the last 30 days, this estimate has changed -0.1%.\nFor the next fiscal year, the consensus earnings estimate of $20.66 indicates a change of +11.8% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -6.2%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Berkshire Hathaway B is rated Zacks Rank #4 (Sell).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of Berkshire Hathaway B, the consensus sales estimate of $97.31 billion for the current quarter points to a year-over-year change of +5.2%. The $359.6 billion and $389.82 billion estimates for the current and next fiscal years indicate changes of -1.3% and +8.4%, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #4 does suggest that it may underperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-03T22:29:29.000Z",
        "Title": "At Berkshire Hathaway meeting, Warren Buffett to field questions on growth, dividend and succession",
        "Author": "  Jonathan Stempel and Koh Gui Qing ",
        "Text": "By Jonathan Stempel and Koh Gui Qing\nOMAHA, Nebraska (Reuters) - Warren Buffett takes center stage in Omaha for Berkshire Hathaway's annual shareholder meeting on Saturday, as investors size up his expected successor and get a better sense of how the conglomerate plans to grow and deploy cash.\nThe meeting is Buffett's 60th since he took over Berkshire in 1965. He has largely stopped appearing publicly to discuss the company, though he assured investors last November that he felt good but knew he was \"playing in extra innings.\"\nAt a downtown arena, Buffett, 93, and Vice Chairman Greg Abel, 61, will answer about five hours of questions. Vice Chairman Ajit Jain, 72, will also join. Abel was designated Buffett's successor as chief executive in 2021.\nInvestors are focused on how the conglomerate will evolve as it faces challenges including how best to grow without overpaying for acquisitions, whether to pay a dividend, and how to deploy $167.6 billion of cash.\n\"Buffett says it's hard to move the needle the way we used to,\" said Ted Bridges, who oversees $10 billion including Berkshire stock at Bridges Trust in Omaha. \"It would be interesting to hear how we're going to allocate capital and think about the next 10 years.\"\nIndeed, Buffett has acknowledged the limitations posed by Berkshire's size. \"We have no possibility of eye-popping performance,\" he said in his February shareholder letter.\nThe shareholder meeting is also the first since Charlie Munger, Buffett's longtime friend, business partner and foil, died in November at age 99.\nMunger was known laconic and acerbic comebacks to Buffett's often lengthy appraisals about Berkshire, the economy, Wall Street and life.\n\"It's going to be hard for Warren to not have Charlie there,\" said Paul Lountzis, president of Lountzis Asset Management, attending his 32nd Berkshire meeting.\nSUCCESSION TOP OF MIND\nBerkshire is a $862 billion conglomerate with dozens of businesses including the BNSF railroad, Geico car insurer, and a slew of industrial and retail operations, including familiar brands such as Dairy Queen and Fruit of the Loom.\nIt also owns well over $300 billion of stocks, close to half of which is Apple.\nAbel oversees Berkshire's non-insurance businesses and Jain oversees its insurance businesses.\nAfter Buffett is no longer in charge, his oldest son Howard is expected to become non-executive chairman, to help preserve Berkshire's culture.\nTodd Combs, 53, and Ted Weschler, 61, who oversee some of Berkshire's stock investments, may take over more. Neither is slated to answer shareholder questions. Combs also runs the Geico car insurer.\n\"I want to see Warren's energy,\" said Steven Check, president of Check Capital Management, attending his 27th meeting. \"It's good that Greg and Ajit will be out front. It wouldn't hurt to have Todd or Ted out front too.\"\nDuring Saturday's questioning, Berkshire may be asked how the Federal Reserve's struggle to lower inflation weighs on consumer-oriented operations including the BNSF railroad.\nBuffett may address major investments in Apple, Occidental Petroleum and five Japanese trading houses, and whether wildfire lawsuits have permanently damaged prospects for the Oregon utility PacifiCorp.\nHe might also reveal which financial services stock Berkshire been quietly buying in large quantities.\nHigh U.S. Treasury yields help when Berkshire deploys cash, given its struggles to buy whole businesses.\n\"That those guys could make 5-1/2% risk free on the short end of the curve risk free would tell you there are a lot of unattractive things out there,\" said Cole Smead, chief executive of Smead Capital Management in Phoenix.\nGOODIES FOR SALE\nBerkshire will also release first-quarter results early Saturday, with analysts expecting operating profit to exceed $9 billion.\nLater, Berkshire will consider six shareholder proposals, including that it disclose more about its plans to protect the climate, improve diversity, and its businesses' dealings with China's government. Buffett opposes all six.\nThe weekend also lets shareholders buy goodies including Berkshire t-shirts and Squishmallows at exhibits featuring Berkshire-owned companies.\nInvesting conferences and private get-togethers will also be scattered around the city.\nShareholders will notice another change.\nFor many years, The Bookworm, an Omaha bookstore, has sold some 25 to 30 Berkshire-approved titles about the company, Buffett and investing, or titles that Buffett liked.\nThis year, one book will be sold: the Charlie Munger anthology, \"Poor Charlie's Almanack.\"\n(Reporting by Jonathan Stempel and Koh Gui Qing in Omaha, Nebraska; editing by Megan Davies and Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-07T12:00:00.000Z",
        "Title": "Berkshire Hathaway ETFs Rise After Company's Strong Earnings",
        "Author": "  Sumit Roy ",
        "Text": "Berkshire Hathaway stock climbed nearly 1% on Monday after the conglomerate posted strong first quarter earnings over the weekend.\nThe Warren Buffet-led company had operating profits of $11.2 billion in Q1, up 39% from a year ago.\nNet income came in at $12.7 billion, down 64% year-over-year due to fluctuations in Berkshire’s stock portfolio.\nBerkshire owns a host of companies from many different industries, including wholly owned subsidiaries GEICO, BNSF Railway Company, and Alleghany Corporation.\nIt also owns positions in publicly traded stocks, like Apple Inc., its single most valuable holding.\nBuffet’s firm owns $135.4 billion worth of the tech giant’s shares, equal to around 40% of Berkshire’s publicly traded portfolio.\nBerkshire trimmed its position in Apple by roughly 13% during the first quarter, according to CNBC calculations.\nEven so, it remains the company’s most valuable holding by far, and at this past weekend’s annual shareholder meeting, Buffet explained that he remains bullish on the stock.\nIn addition to Apple, Berkshire also has large stakes in Bank of America, American Express, Coca-Cola, Chevron, and Occidental Petroleum.\nThough it has exposure to many sectors, Berkshire is classified as a financial company based on the Global Industry Classification Standard.\nOf the 234 U.S.-listed exchange-traded funds that own the company, many of them are ETFs that track the financial sector. \nThe iShares U.S. Financial Services ETF (IYG), the iShares U.S. Financials ETF (IYF) and the Financial Select Sector SPDR Fund (XLF) have the largest weightings in the stock, with allocations of 13% to 15%.\nOther exchange-traded funds with large weightings in Berkshire Hathaway include the Davis Select U.S. Equity ETF (DUSA), with a 10% position; the Avantis Inflation Focused Equity ETF (AVIE), with a 6% position; and the iShares Russell Top 200 Value ETF (IWX), also with a 6% position.\n\nPermalink | © Copyright 2024 etf.com. All rights reserved\n"
    },
    {
        "Date": "2024-05-06T19:31:55.000Z",
        "Title": "Warren Buffett says he was ‘100% responsible’ for Berkshire Hathaway’s bad bet on Paramount: ‘We lost quite a bit of money’",
        "Author": "  Marco Quiroz-Gutierrez ",
        "Text": "Warren Buffett made a bad call with Paramount and said he made sure Berkshire Hathaway got out before the stock fell more.\nAt Berkshire’s annual meeting on Saturday, 93-year-old CEO Buffett told shareholders that he was directly responsible for the company’s Paramount share purchases in 2022, but that the company had now changed course.\n“I was 100% responsible for the Paramount decision,” Buffett said. “It was 100% my decision, and we sold it all and we lost quite a bit of money, and that happens in this business, too.”\nBerkshire had already cut its holdings of the media company—which owns the film production company Paramount Pictures, broadcaster CBS, and the streaming service Paramount+—by a third from 93.7 million shares to 63.3 million shares that were worth about $930 million at the end of 2023.\nBuffett had previously been critical of streaming, saying in an April interview with CNBC that Paramount “isn’t fundamentally that good a business,” even as Berkshire was invested in the company. At the time, he was ambivalent, saying “we’ll see what happens.”\nThe company’s bum Paramount bet made Buffett think deeper about the industry, he told shareholders.\n“I certainly thought harder even about the whole question of what people do with their leisure time and what the governing principles are of running an entertainment business of any sort, whether it’s sports or movies or whatever it might be,” Buffett said.\nSeveral interested parties have targeted Paramount for acquisition, including Sony and private equity firm Apollo and David Ellison’s Skydance Media. On Sunday, Paramount officially opened negotiations with Sony and Apollo, the New York Times reported.\nBerkshire Hathaway reported a $12.7 billion profit for the first quarter, a drop from the $35.5 billion it netted in the same quarter a year prior. The decline was mostly due to a drop-off in the paper value of its holdings, and Buffett encouraged investors to look instead at the company’s operating earnings which exclude its investments. The company’s operating earnings skyrocketed 39% year-over-year, coming in at about $11.2 billion.\nThe annual meeting over the weekend was the first since Berkshire Vice Chairman Charlie Munger died in November at the age of 99. Buffett seemed reflective as he noted Munger’s absence, wrapping up the meeting with somber thoughts.\n“I not only hope you come next year. I hope I come next year,” he said.\nStill, when it comes to his stock bets, the legendary investor was just as keen as ever, and even at 93 years old, learning from his mistakes—the hard way.\n“I think I’m smarter now than I was a couple years ago,” Buffett said. “But I also think I’m poorer because I acquired the knowledge in the manner I did.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-05-04T12:00:00.000Z",
        "Title": "Berkshire Hathaway Inc. First Quarter 2024 Earnings Release",
        "Author": "Business Wire ",
        "Text": "OMAHA, Neb., May 04, 2024--(BUSINESS WIRE)--(BRK.A; BRK.B) – Berkshire’s operating results for the first quarters of 2024 and 2023 are summarized in the following paragraphs. However, we urge investors and reporters to read our 10-Q, which has been posted at www.berkshirehathaway.com. The limited information that follows in this press release is not adequate for making an informed investment judgment.\nEarnings of Berkshire Hathaway Inc. and its consolidated subsidiaries for the first quarters of 2024 and 2023 are summarized below. Earnings are stated on an after-tax basis. (Dollar amounts are in millions, except for per share amounts).\nFirst Quarter\n2024\n2023\nNet earnings attributable to Berkshire shareholders\n$\n12,702\n$\n35,504\nNet earnings includes:\nInvestment gains (losses)\n1,480\n27,439\nOperating earnings\n11,222\n8,065\nNet earnings attributable to Berkshire shareholders\n$\n12,702\n$\n35,504\nNet earnings per average equivalent Class A Share\n$\n8,825\n$\n24,377\nNet earnings per average equivalent Class B Share*\n$\n5.88\n$\n16.25\nAverage equivalent Class A shares outstanding\n1,439,370\n1,456,438\nAverage equivalent Class B shares outstanding\n2,159,055,134\n2,184,657,109\n* Per share amounts are 1/1,500th of those shown for Class A.\nGenerally Accepted Accounting Principles (\"GAAP\") require that we include the changes in unrealized gains/losses of our equity security investments as a component of investment gains (losses) in our earnings statements. In the table above, investment gains (losses) include losses of approximately $9.7 billion in the first quarter of 2024 and gains of approximately $23.4 billion in the first quarter of 2023 due to changes during the first quarters of 2024 and 2023 in the amount of unrealized gains that existed in our equity security investment holdings. Investment gains (losses) also include after-tax realized gains on sales of investments of $11.2 billion in the first quarter of 2024 and $1.7 billion in the first quarter of 2023. In 2023, investment gains also include a net remeasurement gain of approximately $2.4 billion related to Berkshire’s acquisition of an additional 41.4% ownership interest in Pilot Travel Centers.\nThe amount of investment gains (losses) in any given quarter is usually meaningless and delivers figures for net earnings per share that can be extremely misleading to investors who have little or no knowledge of accounting rules.\nAn analysis of Berkshire’s operating earnings follows (dollar amounts are in millions).\nFirst Quarter\n2024\n2023\nInsurance-underwriting\n$\n2,598\n$\n911\nInsurance-investment income\n2,598\n1,969\nBNSF\n1,143\n1,247\nBerkshire Hathaway Energy Company\n717\n416\nOther controlled businesses\n3,088\n3,065\nNon-controlled businesses*\n405\n568\nOther\n673\n(111\n)\nOperating earnings\n$\n11,222\n$\n8,065\n* Includes certain businesses in which Berkshire had between a 20% and 50% ownership interest.\nApproximately $2.6 billion was used to purchase shares of Class A and Class B common stock during the first quarter of 2024. On March 31, 2024, there were 1,437,251 Class A equivalent shares outstanding. At March 31, 2024, insurance float (the net liabilities we assume under insurance contracts) was approximately $168 billion.\nUse of Non-GAAP Financial Measures\nThis press release includes certain non-GAAP financial measures. The reconciliations of such measures to the most comparable GAAP figures in accordance with Regulation G are included herein.\nBerkshire presents its results in the way it believes will be most meaningful and useful, as well as most transparent, to the investing public and others who use Berkshire’s financial information. That presentation includes the use of certain non-GAAP financial measures. In addition to the GAAP presentations of net earnings, Berkshire shows operating earnings defined as net earnings exclusive of investment gains (losses) and impairments of goodwill and intangible assets.\nAlthough the investment of insurance and reinsurance premiums to generate investment income and investment gains or losses is an integral part of Berkshire’s operations, the generation of investment gains or losses is independent of the insurance underwriting process. Moreover, as previously described, under applicable GAAP accounting requirements, we are required to include the changes in unrealized gains (losses) of our equity security investments as a component of investment gains (losses) in our periodic earnings statements. In sum, investment gains (losses) for any particular period are not indicative of quarterly business performance.\nAbout Berkshire\nBerkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, freight rail transportation, utilities and energy, manufacturing services and retailing. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.\nCautionary Statement\nCertain statements contained in this press release are \"forward looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not guaranties of future performance and actual results may differ materially from those forecasted.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240504932623/en/\nContacts\nMarc D. Hamburg402-346-1400\n"
    },
    {
        "Date": "2024-05-01T10:55:00.000Z",
        "Title": "Berkshire Hathaway Inc. Information Regarding First Quarter Earnings Release and 2024 Annual Shareholders Meeting",
        "Author": "Business Wire ",
        "Text": "OMAHA, Neb., May 01, 2024--(BUSINESS WIRE)--(BRK.A; BRK.B) – Berkshire Hathaway Inc.’s first quarter earnings release and its quarterly report on Form 10-Q will be posted on the Internet on Saturday, May 4, 2024, at approximately 7:00 a.m. Central time where it can be accessed at www.berkshirehathaway.com.\nBerkshire Hathaway will hold its 2024 Annual Shareholders Meeting on Saturday May 4, 2024. Prior to the Annual Shareholders Meeting, Warren Buffett, Berkshire’s Chairman and Chief Executive Officer, Greg Abel, Vice Chairman Non-Insurance Operations and Ajit Jain, Vice Chairman Insurance Operations, will hold a question-and-answer session that will commence at approximately 9:15 a.m. Central time. The question-and-answer session will be broadcast on CNBC and webcast on CNBC.com. The broadcast on CNBC and webcast will begin at 8:30 a.m. Central time and at 8:45 a.m. will feature Berkshire’s Annual Meeting movie. In prior years the Annual Meeting movie was only seen by those in attendance at the meeting in Omaha. Visit www.cnbc.com/brklive.\nAbout Berkshire\nBerkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, freight rail transportation, utilities and energy, manufacturing services and retailing. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.\nCautionary Statement\nCertain statements contained in this press release are \"forward looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. Berkshire assumes no obligation and does not intend to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240501237109/en/\nContacts\nMarc D. Hamburg402-346-1400\n"
    },
    {
        "Date": "2024-05-03T00:06:54.000Z",
        "Title": "Berkshire Hathaway board feels sure Greg Abel is the man to eventually replace Warren Buffett",
        "Author": "  JOSH FUNK ",
        "Text": "OMAHA, Neb. (AP) — Everyone knows Warren Buffett 's successor won't be able to match the legendary investor, but Berkshire Hathaway 's board remains confident Greg Abel is the right guy to one day lead the conglomerate into the future.\nLongtime Berkshire board member Ron Olson told investors gathered Thursday at a conference two days ahead of the company's annual shareholders meeting that Abel understands all the fundamental principles that guided Buffett, like letting Berkshire's companies largely run themselves. And Abel will be committed to running Berkshire in a conservative way that will protect the company that's known for it financial strength, he said.\n“Greg is not somebody who is going to be as likely to create the kind of following in the press that I think Warren has had,” Olson said. “On the other hand. I have every reason to believe that he will run the companies that we have the responsibility for in the same way that Warren ran them.”\nOlson said he's confident business owners will still be willing to sell their companies to Berkshire once the Canadian utility executive takes over after the 93-year-old Buffett is gone.\nOlson said he doesn't think last year's public legal fight with the billionaire Haslam family over how much Berkshire would ultimately pay for the last 20% of the Pilot truck stop chain the family agreed to sell to Buffett will be a deterrent to future deals either. Both the Haslams and Berkshire accused each other of trying to manipulate Pilot's earnings to affect the final $2.6 billion price.\nBusiness owners considering selling can see all the positive and respectful relationships Berkshire has with its dozens of other subsidiaries on display in the 200,000-square-foot exhibit hall adjoining the arena where Saturday's meeting will be held, Olson said.\nIn fact the legal battle gave Olson, who is a partner at Berkshire's primary law firm, the chance to work closely with Abel, giving him even more confidence in the board's chosen successor.\n“I could tell you that his preparation and thinking was impressive. He is strategic in his thinking. And he is decisive in his judgement,” Olson said.\nPlus, Berkshire is sitting on more than $167 billion cash, so it has ample resources to do deals and, Olson said, “people generally like to be paid in cash.”\nAbel, who keeps a low profile and doesn't typically grant interviews, will be answering questions alongside Buffett for hours Saturday, trying to help fill the role Buffett's longtime partner Charlie Munger held for decades before he died last fall. Abel has been overseeing all of Berkshire's varied non-insurance businesses for several years while another vice chairman, Ajit Jain, oversees the insurance businesses, including Geico and General Reinsurance.\nOlson said Abel is a numbers guy who can dissect a business' balance sheet as quickly and well as Buffett, and he's also a great listener that people like to work with.\nBut, Olson said, “Greg is not going to be as entertaining as Warren and Charlie have been through the years.”\nSo Munger's absence will be felt acutely on Saturday by all the thousands of people attending the meeting. There simply is no way to replace the expertise, advice and friendship Munger offered to Buffett for more than six decades.\nProfessor Lawrence Cunningham, who has written several books about Berkshire, said he thinks even with the profound loss of Munger the company he helped build will endure.\n“The chair is empty. There’s no way to fill it. But I’m also confident that Warren — and especially Greg and Ajit — will carry on the torch,” Cunningham said.\nBerkshire has been grappling with succession questions for decades, but Cunningham said he thinks Buffett and Munger built an organization bigger than themselves that will endure.\nOlson said Berkshire's board knows there just isn't another Warren Buffett or Charlie Munger out there to replace those two men.\nAfter Buffett dies, Berkshire will face pressure as the shareholder base evolves to include more index and activist investors. One of the things investors may demand is that Berkshire change its longstanding policy and start paying a dividend if it can't find a good use for all that cash.\nOlson said the board hasn't ruled out paying a dividend at some point in the future, but it also hasn't seriously considering approving one now with Buffett still at the helm.\n"
    },
    {
        "Date": "2024-05-31T13:00:15.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK.B) is Attracting Investor Attention: Here is What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this company have returned +2% over the past month versus the Zacks S&P 500 composite's +4.1% change. The Zacks Insurance - Property and Casualty industry, to which Berkshire Hathaway B belongs, has gained 2.8% over this period. Now the key question is: Where could the stock be headed in the near term?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nBerkshire Hathaway B is expected to post earnings of $5.10 per share for the current quarter, representing a year-over-year change of +10.4%. Over the last 30 days, the Zacks Consensus Estimate has changed -7.6%.\nThe consensus earnings estimate of $18.71 for the current fiscal year indicates a year-over-year change of +8.9%. This estimate has changed +1.1% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $19.87 indicates a change of +6.2% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -9.8%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Berkshire Hathaway B is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Berkshire Hathaway B, the consensus sales estimate for the current quarter of $97.31 billion indicates a year-over-year change of +5.2%. For the current and next fiscal years, $368.44 billion and $374.39 billion estimates indicate +1.1% and +1.6% changes, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-04T15:29:55.000Z",
        "Title": "Berkshire pares huge Apple stake as cash, operating profit set records",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Neb. (Reuters) - Berkshire Hathaway significantly reduced its enormous stake in Apple in the first quarter, as Warren Buffett's conglomerate let its cash hoard swell to a record $189 billion.\nBuffett's company also posted a record operating profit exceeding $11 billion, as its insurance operations benefited from improved underwriting and higher income from investments as interest rates rose.\nThe value of Berkshire's stake in Apple fell 22% to $135.4 billion as of March 31 from $174.3 billion at the end of 2023, even though the iPhone maker's share price fell just 11% in the quarter.\nBased on changes in Apple's stock price, Berkshire appears to have sold about 115 million shares, or 13% of its holdings, in the quarter, ending with about 790 million.\nA large sale is an about-face for Buffett, who is normally tech-phobic but came to view Apple as a consumer goods company with strong pricing power and devoted customers.\nSome investors, however, have expressed concern that Apple consumed too much of Berkshire's investment portfolio.\nBut the sales leave Buffett with more than six times the minimum $30 billion cash cushion he has pledged to keep.\nAt Berkshire's annual meeting on Saturday, Buffett assured shareholders that \"unless something dramatic happens that really changes capital allocation, we will have Apple as our largest investment.\"\nHe also said \"I don't mind\" expanding the cash stake, in light of alternatives in the equity markets and conflicts around the world, and said cash could top $200 billion by the end of June.\nThe Apple sales resulted in Berkshire's realizing $11.2 billion of after-tax gains in the quarter from selling investments. Buffett maintained that he doesn't mind paying taxes.\nFirst-quarter operating profit rose 39% to $11.22 billion, or about $7,807 per Class A share, from $8.07 billion a year earlier.\n\"Berkshire continues to benefit from attractive yields on short-term investments and large cash balances,\" Edward Jones analyst James Shanahan said in a research note.\nNet income fell 64% to $12.7 billion, or $8,838 per share, from $35.5 billion a year earlier, when Berkshire had large unrealized gains from its stocks.\nAn accounting rule requires Berkshire to report those gains with its financial results. Buffett urges investors to ignore the resulting volatility.\nBerkshire also repurchased $2.6 billion of its own stock in the first quarter, and a small amount in the first three weeks of April.\nThe results were released ahead of Berkshire's annual shareholder meeting in Omaha, part of a weekend that draws tens of thousands of people to the city.\nBuffett, 93, has led Berkshire since 1965, transforming it from a struggling textile company into a conglomerate whose dozens of businesses including Geico, the BNSF railroad, Berkshire Hathaway Energy, and Dairy Queen and See's Candies.\nThe diversification has led many investors, not just Buffett fans, to view Berkshire as a stable long-term investment even amid recession fears and concerns about the banking industry.\nInsurance profit soared 80% to $5.2 billion. This included a more than doubling of underwriting profit at Geico, which benefited from rate increases and a large decline in the percentage of premiums it used to pay for accident losses.\nProfit fell 8% at the BNSF railroad, in part because of lower fuel surcharges and an \"unfavorable business mix.\"\nBerkshire Hathaway Energy saw profit rise 72%, as improved operating performance from utilities helped offset rising legal costs at the HomeServices of America real estate brokerage related to legal settlements over brokerage commissions.\nThe energy business still faces billions of dollars in claims against its PacifiCorp unit over Oregon wildfires in 2020.\n(Reporting by Jonathan Stempel in Omaha, Nebraska; editing by Jason Neely and Diane Craft)\n"
    },
    {
        "Date": "2024-05-16T01:19:31.000Z",
        "Title": "Bill Gates Adjusts Holdings: A Closer Look at Berkshire Hathaway's Impact",
        "Author": "  GuruFocus Research ",
        "Text": "Bill Gates (Trades, Portfolio), a titan of industry and philanthropy, has recently made significant adjustments to his investment portfolio according to the latest 13F filing for the first quarter of 2024. Gates, who co-founded Microsoft in 1975, has been a prominent figure in technology and global philanthropy. His investment decisions, managed under the Bill & Melinda Gates Foundation Trust since June 2009, are closely watched for insights into the strategies of one of the world's wealthiest individuals. The trust's investments are guided by a commitment to good governance, management, and ethical considerations that align with the foundation's objectives.\nWarning! GuruFocus has detected 5 Warning Sign with MSFT.\nDuring the first quarter of 2024, Bill Gates (Trades, Portfolio) opted to reduce holdings in two major stocks, reflecting a strategic shift in his portfolio. The adjustments include:\nReduced Berkshire Hathaway Inc (NYSE:BRK.B) by 2,613,252 shares, resulting in a -13.12% decrease in shares and a -2.2% impact on the portfolio. The stock, which traded at an average price of $393.34 during the quarter, has seen a return of 2.43% over the past three months and 15.87% year-to-date.\nReduced Microsoft Corp (NASDAQ:MSFT) by 1,711,272 shares, leading to a -4.48% reduction in shares and a -1.52% impact on the portfolio. The stock's average trading price was $404.82 during the quarter, with a return of 4.25% over the past three months and 12.92% year-to-date.\nAs of the first quarter of 2024, Bill Gates (Trades, Portfolio)'s investment portfolio included 24 stocks. The top holdings were significantly concentrated in several key companies and industries, reflecting Gates's investment strategy and market outlook. The major holdings included:\n33.49% in Microsoft Corp (NASDAQ:MSFT), 16.38% in Waste Management Inc (NYSE:WM), 15.87% in Berkshire Hathaway Inc (NYSE:BRK.B), 15.75% in Canadian National Railway Co (NYSE:CNI), and 5.88% in Caterpillar Inc (NYSE:CAT). These investments span across diverse sectors such as Industrials, Technology, Financial Services, Consumer Defensive, and more, indicating a broad yet focused investment approach.\nThe strategic reductions and allocations in Gates's portfolio highlight a meticulous approach to capital distribution, influenced by both market performance and the foundational principles of the Bill & Melinda Gates Foundation Trust. Investors and analysts alike will be watching closely to see how these changes might signal broader economic trends or strategic shifts in the investment landscape.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-04T21:52:40.000Z",
        "Title": "Berkshire shareholders reject climate, diversity, China proposals",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Nebraska (Reuters) - Berkshire Hathaway Inc shareholders on Saturday overwhelmingly rejected six proposals addressing environmental and social policy issues at Warren Buffett's conglomerate, all of which the billionaire investor and his board opposed.\nBy margins of more than 4-to-1, shareholders at Berkshire's annual meeting voted against two proposals that the company's insurance and energy operations disclose more about their efforts to address climate change including greenhouse gas emissions.\nThey also turned down a proposal for more disclosure about efforts to promote diversity, equity and inclusion in the workplace.\nBy overwhelming majorities, shareholders voted against a separate environment-related proposal, creating a board-level committee to monitor safety at the BNSF railroad unit, and requiring Berkshire to report annually on how much its business operations depend on the \"hostile\" Chinese government.\nBerkshire invested in Chinese electric car company BYD in 2008, though it began reducing that stake in 2022.\nThe votes were not surprising because Buffett owns special shares that give him a 31% voting stake in Berkshire. That makes it difficult to adopt proposals Buffett opposes.\nBerkshire shareholders also reelected the company's 14-person board.\n(Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-02T19:00:14.000Z",
        "Title": "Warren Buffett Isn't Worried About Berkshire After He Dies, Says 'If I Die Tonight, I Think the Stock Would Go Up Tomorrow'",
        "Author": "  Caleb Naysmith ",
        "Text": "Warren Buffett, one of the most successful investors of all time, is still going strong at 93 years old. However, he is not unaware of his eventual mortality, saying \"I feel good but fully realize I am playing in extra innings.\"\nLike any good CEO, he's been thinking about his succession planning. Greg Abel, who runs Berkshire Hathaway's (NYSE:BRK) non-insurance business operations, is set to succeed Buffett as CEO when Buffett passes.\nWhile some investors in Berkshire fear that the stock will sell off on that day, Buffett has a contrarian view.\nDon't Miss:\nInvest in time-tested solution that aims to solve this $600 billion women’s health problem at 80 cents per share.\nThis Uber-for-moving startup is quietly taking the world by storm, here’s how anyone can invest for a limited time.\nBuffett said that when he dies, he thinks \"the stock would go up tomorrow.\"\nChris Davis, a Berkshire board member and investment manager, explains that a price increase would be because of an attempted value-enhancing conglomerate breakup. He believes that \"every activist and investment banker will argue that in a world without Warren and Charlie, Berkshire's unorthodox structure shouldn't persist.\"\nBuffett has consistently been vehemently opposed to breaking up Berkshire's conglomerate structure.\nTrending: Join the elite. Invest in Epic Games and own a piece of the $17 billion Fortnite empire.\nIf history is a guide, Berkshire's stock-picking team may have trouble replicating Buffett's incredible track record. Todd Combs and Ted Weschler, who currently manage about 10% of Berkshire's equity portfolio and are expected to eventually manage the entire portfolio, probably would've been better off investing in a market tracking index since joining the company.\nWhile Buffett has not mentioned their performance since 2019, that year he did say that they lagged the market slightly since joining the company a decade prior.\nEven Buffett hasn't had the same success as his early years, with Berkshire almost exactly even to the S&P 500 over the past decade.\nRegardless of Berkshire's stock performance, the eventual death of one of the world's brightest business and investing minds will be sad news for Berkshire shareholders and investors everywhere. As with his succession plan, his timeless lessons are designed to last.\nKeep Reading About Startups:\nHere is where your most successful angel investment may be hidden.\nAmid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Warren Buffett Isn't Worried About Berkshire After He Dies, Says 'If I Die Tonight, I Think the Stock Would Go Up Tomorrow' originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-02T22:50:07.000Z",
        "Title": "Berkshire director says board may not give Buffett successor Abel the same leeway",
        "Author": "  Jonathan Stempel and Koh Gui Qing ",
        "Text": "By Jonathan Stempel and Koh Gui Qing\nOMAHA, Nebraska (Reuters) - A longtime Berkshire Hathaway director said Greg Abel, who is expected to succeed Warren Buffett as chief executive, may not get the same leeway from the conglomerate's board of directors to make acquisitions.\nRonald Olson, a Berkshire director since 1997, said at an investing conference on Thursday that the board would not \"handcuff\" Abel from making acquisitions, in his expected role in allocating Berkshire's capital.\nBut he also said Abel's recent handling of difficult litigation against the billionaire Haslam family over the acquisition of truck stop chain Pilot Travel Centers cemented confidence in his leadership. It was the first time Olson, a lawyer, said he worked closely with Abel.\n\"There [are] going to be changes in terms of the confidence level that we had in Warren,\" Olson said when asked if Abel would have the same latitude as Buffett to spend cash as he saw fit. \"I don't know how changes will evolve when somebody replaces Warren. Let's not get too anxious about it. He's going to be around for a while. But once that happens, there may well be changes.\"\nAt Berkshire's annual meeting on Saturday, Buffett and Abel are likely to get shareholder questions about the conglomerate's future after Abel takes over.\nSuccession at Berkshire has long been on investors' minds as Buffett aged, working at least two decades past when most top executives retire.\nThose concerns grew after his longtime second-in-command Charlie Munger died in November at age 99.\nBerkshire acknowledged that Abel was Buffett's successor-in-waiting after Munger let slip at Berkshire's 2021 annual meeting when discussing Berkshire's decentralized, hands-off business model that \"Greg will keep the culture.\"\nAbel, 61, has since 2018 been a vice chairman overseeing Berkshire's non-insurance businesses including the BNSF railroad and Berkshire Hathaway Energy, his former home.\nAfter Buffett leaves, his son Howard Buffett is expected to become nonexecutive chairman, while others would handle common stock investments.\nThe dispute with the Haslams, including Cleveland Browns owner Jimmy Haslam, centered on how much Berkshire should pay for the 20% of Pilot it didn't already own.\nIn competing lawsuits, each side accused the other of manipulating Pilot's accounting in bad faith, with the Haslams saying Berkshire was undervaluing its stake, and Berkshire concerned it might overpay.\nTensions had been rising earlier, after Berkshire took an 80% stake and replaced top Pilot management.\nBuffett tasked Abel to sort out the issue, and Olson said \"it was not pleasant going through the litigation.\"\nBut both sides settled in January, and Berkshire paid $2.6 billion for the final 20% of Pilot.\n\"That was a problem that Warren put in Greg's lap,\" Olson said. \"His preparation and thinking was impressive. He is strategic in his thinking, and he is decisive in his judgment.\"\\\nBerkshire also owns several insurers including Geico, the BNSF railroad, a slew of industrial and retail businesses, and hundreds of billions of dollars of stocks including Apple and Bank of America.\n(Reporting by Jonathan Stempel and Koh Gui Qing in Omaha, Nebraska, editing by Deepa Babington)\n"
    },
    {
        "Date": "2024-05-04T18:43:45.000Z",
        "Title": "Berkshire's profit plunges 64% on portfolio holdings as Buffett sells Apple",
        "Author": "  JOSH FUNK ",
        "Text": "OMAHA, Neb. (AP) — Berkshire Hathaway's first quarter profits plummeted along with the paper value of its investments, but the company said Saturday that most of the businesses it owns outright performed well.\nThe company reported reported a $12.7 billion profit, or $8.825 per Class A share, in the quarter. That’s roughly one-third of last year's $35.5 billion, or $24,377 per A share.\nThe figures were heavily influenced by a large drop in the paper value of Berkshire’s investments. Buffett encourages investors to pay more attention to the conglomerate’s operating earnings that exclude the investment figures. Operating earnings jumped 39% to $11.222 billion from last year’s $8.065 billion as its insurance companies showed strong results.\nOn a per share basis, this year's first quarter operating figure amounts to $7,796.47 per Class A share, beating three analysts' estimates by FactSet Research, who predicted $6,701.87 per Class A share.\nBuffett was a net seller of $17 billion in stocks during the quarter, including trimming about 13% of Berkshire’s massive Apple stake. At $135.4 billion, the iPhone maker still accounts for the biggest share of Berkshire's $364 billion portfolio. Buffett said he expects it to remain so even up to when his successor Greg Abel takes over.\nThe estimated value of Berkshire’s Apple stake suggests Buffett sold off more than 100 million shares. In the past, Buffett has said he invested in Apple’s stock because of how devoted consumers are to the company's products, similar to consumer brands he loves like Berkshire's own See's Candy.\nApple CEO Tim Cook, who is at the Berkshire meeting, told CNBC that he still considers it a privilege to have Berkshire as a major shareholder, and he knew about the sales before Berkshire disclosed them Saturday.\nBerkshire reported a $2.6 billion underwriting profit at its insurers, up from $911 million a year ago, as Geico in particular continued to improve its results. However, BNSF railroad’s profits dropped 8% to $1.143 billion.\nMost of Berkshire's many other companies delivered solid results, including a 72% jump in operating profits at the utility unit, adding $717 million to Berkshire’s total.\nRevenue grew 5% to $89.87 billion in the quarter. The two analysts who reported estimates to FactSet predicted $87.044 billion.\nWith no major acquisitions in sight, Berkshire’s cash pile climbed to a record $188.993 billion even after it spent $2.6 billion repurchasing shares during the first three months of the year. Holdings including Geico insurance, BNSF railroad, several major utilities and an assortment of dozens of others keep generating mountains of cash.\n“We’d love to spend it but we won’t spend it unless we’re doing something with very little risk that will make us a lot of money,” Buffett said.\n"
    },
    {
        "Date": "2024-05-17T00:08:00.000Z",
        "Title": "Warren Buffett's Best Tips from the 2024 Berkshire Annual Meeting",
        "Author": "  Tracey Ryniec ",
        "Text": "(0:30) - Breaking Down The Berkshire Hathaway Annual Meeting\n(5:30) - Top Takeaways From Warren Buffett\n(17:10) - Stocks To Keep On Your Watchlist: Invest Like Buffett\n(34:00) - Episode Roundup: GOOGL, SONY, UNP, V, MA\n Podcast@Zacks.com\n \nWelcome to Episode #369 of the Value Investor Podcast.\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\n93-year-old Warren Buffett hosted another Berkshire Hathaway annual meeting on May 4, 2024 in Omaha. It is the biggest annual gathering of value investors in the world.\nThankfully, if you aren’t a Berkshire Hathaway shareholder, you can now watch the event “live” on CNBC. CNBC also does interviews with some of the Berkshire Hathaway company CEOs during the lunch break.\nIt’s a multi-hour question and answer session with Berkshire shareholders. And even though this year was a tribute to Buffett’s right-hand-man, Charlie Munger, who passed away in 2023 at the age of 99, there was still plenty of Buffett’s typical folksy advice.\nHe always makes investing seem so easy to navigate.\nThe Best Tips from the Annual Meeting\nSome of Buffett’s most interesting comments at the meeting don’t always have to do with investing. Many are just about life. Here are some of the notes Tracey scribbled while watching the Q&A.\nThese are three of the best tips.\n1.       Compounding is one of the most important factors in investing.\n2.       Read top books, like Ben Graham’s the Intelligent Investor, several times.\n3.       The deficit is not keeping him up at night.\n5 Stocks That are Berkshire Hathaway Approved\nBerkshire was sitting on $182 billion in cash as of the annual meeting. What stocks are Buffett-like that he could buy, or buy more, of?\n1.       Alphabet Inc. (GOOGL)\nAlphabet fits the mold of a Berkshire stock. It has moats and plenty of free cash flow. Alphabet had $108.1 billion in cash as of Mar 31, 2024.\nShares of Alphabet are near all-time highs, up 24.4% year-to-date. But it’s actually cheap on a historic basis and compared to the other Magnificent 7 stocks.\nAlphabet trades with a forward P/E of 22.8. It has a PEG ratio of just 1.3. A PEG under 1.0 usually indicates both value and growth. But 1.3 is still low.\nWill Berkshire Hathaway eventually buy shares of Alphabet?\n2.       Sony Group Corp. (SONY)\nSony is a global powerhouse in gaming, cameras, chips, entertainment, and music. It has plenty of moats. In May 2024, Sony announced it was raising its dividend and would target a 40% total payout ratio by the end of Fiscal 2027.\nShares of Sony are down 11.9% year-to-date. It’s cheap on P/E and P/B ratio levels. Sony’s forward P/E is just 14.5, which puts it as a value stock. It has a P/B ratio of only 2.0. A P/B ratio under 3.0 usually indicates value.\nBerkshire owns other Japanese companies. Will Sony be next?\n3.       Union Pacific Corp. (UNP)\nBerkshire Hathaway owns one of the largest railroads in America with BNSF. But Buffett talked about how Berkshire almost bought Union Pacific instead. Union Pacific has paid a dividend for 125 consecutive years. That’s impressive.\nShares of Union Pacific are up just 0.1% year-to-date. But earnings are expected to rise 7.6% this year. Union Pacific has a forward P/E of 21.9.\nIf you want to own a railroad, Union Pacific is one to keep on your short list.\n4.       Visa Inc. (V)\nBerkshire Hathaway has owned shares of Visa since the third quarter of 2011. Visa is an earnings all-star. It hasn’t missed since it went IPO in 2008. Earnings are expected to rise 13.3% in fiscal 2024.\nShares of Visa are up just 7.5% year-to-date. It trades with a forward P/E of 28.3.\nShould value investors still be buying Visa in 2024?\n5.       Mastercard Inc. (MA)\nBerkshire Hathaway also owns shares of Mastercard, which it bought before Visa, in the first quarter of 2011. Mastercard also has an outstanding earnings surprise track record with just 2 misses in the last 10 years.\nShares of Mastercard are up 7.6% year-to-date. It trades with a forward P/E of 32.2, which is well above the classic “value” P/E level of 15.\nIs it too late for value investors to buy Mastercard?\nWhat Other Tidbits of Wisdom Did Buffett Drop at the Berkshire Annual Meeting?  \nTune into this week’s podcast to find out.\n[In full disclosure, Tracey owns shares of GOOGL in her personal portfolio.]\n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMastercard Incorporated (MA) : Free Stock Analysis Report\nVisa Inc. (V) : Free Stock Analysis Report\nUnion Pacific Corporation (UNP) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nSony Corporation (SONY) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-06T10:20:50.000Z",
        "Title": "Warren Buffett's successor Greg Abel seen preserving Berkshire's culture",
        "Author": "  Koh Gui Qing ",
        "Text": "By Koh Gui Qing\nOMAHA, Nebraska (Reuters) - When Greg Abel succeeds Warren Buffett at the helm of Berkshire Hathaway, he is expected to preserve the culture at the behemoth even if he does not match the star power of his legendary boss.\nA 25-year Berkshire veteran, Vice Chairman Abel, 61, is expected by investors and analysts to uphold the $865 billion conglomerate's track record of investing in companies for the long haul and eschewing dividend payments to shareholders.\nBerkshire, which owns railroads, insurance companies and an ice-cream maker, has been planning for decades for the eventuality when Buffett, 93, who has run the company since 1965, is no longer there.\nEven though Buffett has shown no signs of wanting to step aside, investor focus on Berkshire's future came to the fore again after Charlie Munger, Buffett's long-time friend and business partner, died in November at age 99. At Berkshire's annual shareholder meeting in Omaha on Saturday, investors questioned Buffett and Abel about succession.\n\"We have a very special company in Berkshire, but it's that culture that makes it special, and that's not going to change,\" Abel, who was designated Buffett's successor as chief executive in 2021, said at the shareholder meeting.\nBuffett repeatedly assured shareholders that Berkshire is in good hands, saying that Abel is \"in charge of really everything except insurance\" these days.\n\"We (have) got the same feeling in terms of judging the attractiveness of businesses and making capital decision and that sort of thing,\" Buffett said.\nThat sentiment was echoed by Ronald Olson, a Berkshire director.\n\"Greg understands the (Berkshire) culture and he will honour that,\" said Olson ahead of the meeting. \"Greg doesn't think of himself as Warren Buffett, but I have no doubt seeing Greg running (Berkshire) the same way.\"\nAbel and Berkshire did not respond to requests for interviews.\nGregory Edward Abel was born in Edmonton, Alberta, on June 1, 1962, to a working-class family. Working odd jobs, he cleaned discarded bottles and filled fire extinguishers, according to the Horatio Alger Association of Distinguished Americans, an education non-profit that honoured Abel in 2018.\n“It was a real working-class family where sometimes people had jobs and sometimes they didn’t,” Abel said of his childhood in a video posted on the Horatio Alger website. “You realised we were all working hard to try to advance our family.”\nAbel graduated in 1984 from the University of Alberta and worked at PricewaterhouseCoopers and energy firm CalEnergy. He joined Berkshire Hathaway Energy, then known as MidAmerican Energy, in 1992, which Berkshire took over in 1999 and became MidAmerican's chief in 2008. He now oversees Berkshire's non-insurance operations such as BNSF, Berkshire Hathaway Energy and dozens of chemical, industrial and retail operations.\nSome executives who work with Abel say he scrutinises financial metrics such as inventory levels, cash flows, capital expenditure and earnings before interest, taxes, depreciation and amortization.\n\"Greg looks at our inventory levels more than Warren did. He will sometimes circle it and be like 'Oh, that looks high,'\" Adrienne Perry, chief revenue officer at Borsheims, a Berkshire-owned jeweller, said last week at a talk in Omaha.\nDan Sheridan, chief executive of Brooks Running, a maker of running shoes that is owned by Berkshire, said Abel advises his executives broadly, but keeps an eye on the bottom line.\n\"If there are warts on your balance sheet, he's going to find them,\" Sheridan said in an interview.\nEven Buffett conceded on Saturday that Abel is a tougher boss.\n\"We haven't had a history of being very tough on people that coasted and we've had some that would do that,\" Buffett said. \"Greg will do something about it and Charlie and I wouldn't have.\"\nAccording to Berkshire’s succession plan, Abel will replace Buffett in making all major investment and capital allocation decisions. Vice Chairman Ajit Jain, who joined Berkshire in 1986, according to Berkshire’s website, will oversee insurance operations.\nBuffett said on Saturday he would want Abel to have final say on decisions regarding Berkshire's portfolio of public stocks.\n“I would leave the capital allocation to Greg,\" Buffett said on Saturday. \"He understands businesses extremely well, and if you understand businesses you understand common stocks.”\nThe transition “has already begun because Warren, five years ago, shifted these responsibilities onto Greg and Ajit directly,” said Adam Mead, the CEO of Mead Capital and author of “The Complete History of Berkshire Hathaway.”\nBuffett indicated on Saturday that his subordinates are already taking on much more of the day-to-day responsibility.\n“The number of calls I get from managers is essentially awfully close to zero and Greg is handling those,\" Buffett said. \"I don’t know quite how he does it, but we’ve got the right person, I can tell you that.”\n(Reporting by Koh Gui Qing in Omaha; additional reporting by Jonathan Stempel; editing by Megan Davies and Diane Craft)\n"
    },
    {
        "Date": "2024-05-16T19:20:48.000Z",
        "Title": "Bill Gates Sells Microsoft, Berkshire Hathaway Shares In Q1: Are These Still Top Positions?",
        "Author": "  Chris Katje ",
        "Text": "Billionaire Bill Gates is best known as the co-founder and former CEO of Microsoft Corp. (NASDAQ:MSFT). He is also known for his philanthropic efforts with the Bill and Melinda Gates Foundation Trust.\nThose two items collided in the first quarter with the sale of Microsoft stock. Here's what to know.\nWhat Happened: Gates stepped down as the CEO of Microsoft in 2000 and later left the board of directors in 2020.\nThe co-founder of the software giant remains a large shareholder in the company through his own holdings and the stock holdings of the Bill and Melinda Gates Foundation Trust.\nA new 13F filing for the Bill and Melinda Gates Foundation Trust reveals two key changes made in the first quarter.\nThe trust sold 1.7 million Microsoft shares and 2.6 million shares of Berkshire Hathaway Inc (NYSE:BRK). The trades lowered the weighting of these two stocks by 4.5% and 13.1%, respectively.\nAfter the sales, the top holdings of the trust are, with values from the end of the first quarter:\nMicrosoft: 33.5% of the portfolio, 36,499,597 shares, $15.4 billion\nWaste Management, Inc. (NYSE:WM): 16.4% of the portfolio, 35,234,344 shares, $7.5 billion\nBerkshire Hathaway: 15.9% of the portfolio, 17,303,097 shares, $7.3 billion\nWith the latest trades, Berkshire Hathaway moved from the second-place spot down to third place.\nRelated Link: Microsoft Q3 Earnings: Revenue Beat, EPS Beat, ‘New Era Of AI Transformation’ And More\nWhy It's Important: Gates owns Microsoft shares in his Cascade Investments vehicle and his personal holdings. The former CEO once owned 45% of the company when it went public in 1986.\nThe ownership stake has been reduced over the years by Gates and the foundation trust, which represents his philanthropic efforts.\nBerkshire Hathaway, led by Gates' friend Warren Buffett, has been a top investment of Gates and also sees shares donated by Buffett to the trust.\nThe latest moves in the first quarter come as it was recently announced that Gates' ex-wife Melinda French Gates is stepping down as the co-chair of the trust. French Gates will be leaving for her own philanthropic efforts with an added $12.5 billion commitment.\nThe former Microsoft CEO is listed as the fifth richest person on the Bloomberg Billionaires Index with a wealth of $154 billion, up $13.6 billion year-to-date.\nGates' sale of Microsoft stock comes as shares have soared in the last year thanks to new artificial intelligence initiatives and growth. Microsoft shares are up 37% over the last year.\nRead Next: How Bill Gates Almost Killed The Xbox: ‘This Is An Insult To Everything I’ve Done’ \nPhoto: Lev Radin via Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nMICROSOFT (MSFT): Free Stock Analysis Report\nThis article Bill Gates Sells Microsoft, Berkshire Hathaway Shares In Q1: Are These Still Top Positions? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-23T15:00:09.000Z",
        "Title": "3 Ways Berkshire Hathaway’s Charlie Munger Lived Frugally",
        "Author": "  Gabrielle Olya ",
        "Text": "A prolific investor and long-time business partner of Warren Buffett, Charlie Munger had accumulated a net worth of $2.2 billion by the time of his death in November 2023. Although Munger could have easily afforded to live lavishly, he remained frugal during his lifetime.\nHere are a few of the ways Munger lived frugally.\nRead Next: 5 Unnecessary Bills You Should Stop Paying in 2024\nFind Out: How To Get $340 Per Year in Cash Back on Gas and Other Things You Already Buy\nBoth Munger and Buffett “lived in the same house for decade after decade after decade,” Munger told CNBC in one of his last interviews.\nMunger admitted that he was tempted to upgrade at some points, but didn’t want his children to be spoiled.\n“All of our friends get rich and build bigger and better houses, and naturally, we both considered bigger and better houses,” he said. “I had a huge number of children, so it was justifiable even, and I still decided not to live a life where I looked like the Duke of Westchester or something. I was going to avoid it.\n“I did it on purpose,” Munger continued. “I didn’t think it would be good for the children.”\nLearn More: 5 Frugal Habits of Mark Cuban\nUntil he was wheelchair-bound, Munger drove himself around rather than hire a private driver, Reuters reported. The outlet noted that Munger “lived modestly” throughout his life.\nIn his 1989 chairman’s letter to Berkshire Hathaway shareholders, Buffett wrote that the company had sold the corporate jet it had purchased for $850,000 three years prior and bought another used jet for $6.7 million. In the letter, Buffett said that Munger wasn’t a fan of private jets and joked about his frugal preferences.\n“His idea of traveling in style is an air-conditioned bus,” Buffett wrote, “a luxury he steps up to only when bargain fares are in effect.”\nMore From GOBankingRates\nBarbara Corcoran: 3 Cities To Invest in Real Estate Now Before Prices Skyrocket\n10 Best New Buys at Big Lots That Are Worth Every Penny\nThis is The Single Most Overlooked Tool for Becoming Debt-Free\n3 Things You Must Do When Your Savings Reach $50,000\nThis article originally appeared on GOBankingRates.com: 3 Ways Berkshire Hathaway’s Charlie Munger Lived Frugally\n"
    },
    {
        "Date": "2024-05-16T01:18:57.000Z",
        "Title": "Bruce Berkowitz's Strategic Moves in Q1 2024: A Closer Look at Berkshire Hathaway's Impact",
        "Author": "  GuruFocus Research ",
        "Text": "Bruce Berkowitz (Trades, Portfolio), the founder and Managing Member of the Fairholme Fund (Trades, Portfolio), is renowned for his focused investment approach, inspired by Benjamin Graham's \"The Intelligent Investor\". With a philosophy centered on investing in companies with exceptional management and undervalued stocks, Berkowitz's latest N-PORT filing for the first quarter of 2024 reveals significant moves that reflect his strategic thinking. His investment decisions this quarter highlight a preference for quality management and substantial value, even in less performing companies, provided they offer a significant discount to intrinsic value.\nWarning! GuruFocus has detected 7 Warning Signs with JOE.\nBruce Berkowitz (Trades, Portfolio) has notably increased his stakes in two stocks during the first quarter of 2024:\nBank OZK (NASDAQ:OZK) saw an addition of 273,300 shares, bringing the total to 324,500 shares. This adjustment represents a significant 533.79% increase in share count, impacting the current portfolio by 0.83%, with a total value of $14,751,770.\nEnterprise Products Partners LP (NYSE:EPD) was augmented by 228,200 shares, resulting in a total of 5,436,600 shares. This adjustment represents a 4.38% increase in share count, with a total value of $158,639,990.\nConversely, Berkowitz has reduced his positions in two key stocks:\nBerkshire Hathaway Inc (NYSE:BRK.B) was reduced by 74,000 shares, marking a -60.18% decrease in shares and a -1.69% impact on the portfolio. The stock traded at an average price of $393.34 during the quarter and has returned 2.43% over the past three months and 15.87% year-to-date.\nThe St. Joe Co (NYSE:JOE) saw a reduction of 166,000 shares, resulting in a -0.73% reduction in shares and a -0.64% impact on the portfolio. The stock traded at an average price of $55.21 during the quarter and has returned 7.19% over the past three months and -2.12% year-to-date.\nAs of the first quarter of 2024, Bruce Berkowitz (Trades, Portfolio)'s portfolio included 7 stocks, with the top holdings comprising 86.35% in The St. Joe Co (NYSE:JOE), 10.5% in Enterprise Products Partners LP (NYSE:EPD), 1.36% in Berkshire Hathaway Inc (NYSE:BRK.B), 0.98% in Bank OZK (NASDAQ:OZK), and 0.74% in WR Berkley Corp (NYSE:WRB). The holdings are primarily concentrated in four industries: Real Estate, Energy, Financial Services, and Technology.\nThis strategic portfolio adjustment reflects Berkowitz's ongoing commitment to investing in value, guided by a disciplined approach to capital allocation. His moves this quarter, particularly the significant reduction in Berkshire Hathaway Inc, underscore a tactical shift that aligns with his investment philosophy of focusing on intrinsic value and potential catalysts for narrowing the gap between market price and intrinsic value.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-06T13:34:00.000Z",
        "Title": "Berkshire (BRK.B) Q1 Earnings Rise Y/Y, Segment Results Solid",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway Inc. (BRK.B) delivered first-quarter 2024 operating earnings of $11.2 billion, which increased 39% year over year. The increase was driven by higher earnings in insurance-underwriting and insurance-investment income, other controlled businesses and non-controlled businesses.\nBerkshire Hathaway Inc. price-consensus-eps-surprise-chart | Berkshire Hathaway Inc. Quote\nRevenues rose 5.2% year over year to $89.8 billion, attributable to an increase in revenues in Insurance and Other and Railroad, Utilities and Energy.Costs and expenses increased 0.6% year over year to $76.5 billion, largely driven by a rise in costs and expenses in Railroad, Utilities and Energy.\nBerkshire’s Insurance and Other segment revenues increased 3.2% year over year to $65.4 billion on the back of higher insurance premiums earned, leasing revenues, interest, dividend and other investment income.Insurance underwriting produced operating earnings of $2.6 billion, which surged nearly three-fold year over year.Railroad operating revenues rose 4.1% year over year to $5.6 billion, reflecting lower revenues per car/unit, partially offset by higher volumes of 6.6%. Pre-tax earnings of Railroad decreased 7.9% year over year to $1.5 billion.Operating earnings from the Railroad business declined 7.5% year over year.Total revenues at Manufacturing, Service and Retailing decreased 1.3% year over year to $40.7 billion. Pre-tax earnings increased 1% year over year to $3.9 billion.After-tax earnings from manufacturing, service and retailing businesses rose 1.3% year over year. This reflected growth at several manufacturing businesses, which were substantially offset by lower earnings from service and retailing businesses.\nAs of Mar 31, 2024, consolidated shareholders’ equity was $577.8 billion, up 1.8% from the level as of Dec 31, 2023. Cash and cash equivalents and restricted cash were $36.2 billion, up 32.5% from the 2023-end level.Berkshire exited the first quarter of 2024 with a float of about $168 billion, up from $169 billion as of Dec 31, 2023.Cash flow from operating activities totaled $10.5 billion, up 21.5% from the year-ago period.BRK.B bought back shares worth $2.6 billion in the first quarter.\nBerkshire currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nCincinnati Financial Corporation CINF reported first-quarter 2024 operating income of $1.72 per share, which beat the Zacks Consensus Estimate by 1.7%. The bottom line surged 93.2% year over year. Total operating revenues in the quarter under review were $2.3 billion, which missed the Zacks Consensus Estimate by 1.4%. The top line, however, improved 8.8% year over year. Net written premiums climbed 11% year over year to $2.2 billion.Investment income, net of expenses, increased 17% year over year to $245 million, as bond interest grew 21% and dividends from the equity portfolio jumped 9%. The figure was higher than our estimate of $227.7 million. Total benefits and expenses of Cincinnati Financial increased 0.4% year over year to $1.9 billion. The figure was lower than our estimate of $2 billion. In its property & casualty insurance business, Cincinnati Financial recorded an underwriting income of $131 million against the year-ago loss of $10 million. The figure was higher than our estimate of $60.7 million underwriting income.AXIS Capital Holdings Limited AXS posted first-quarter 2024 operating income of $2.57 per share, beating the Zacks Consensus Estimate by 1.2%. The bottom line increased 10.3% year over year. Total operating revenues of $1.4 billion missed the Zacks Consensus Estimate by 2.8%. The top line, however, rose 5% year over year. Net investment income jumped 25% year over year to $167 million. Our estimate was $164.8 million.Total expenses in the quarter under review increased 0.7% year over year to $1.15 billion. Our estimate was $1.1 billion. Pre-tax catastrophe and weather-related losses, and net of reinsurance were $20 million. This compares favorably with the year-ago loss of $38 million. AXIS Capital’s underwriting income of $145.6 million increased 4.5% year over year. Our estimate was $141.5 million. The combined ratio deteriorated 20 bps to 91.1.American Financial Group, Inc. AFG reported first-quarter 2024 net operating earnings per share of $2.76, which missed the Zacks Consensus Estimate by 0.3%. The bottom line decreased 4.5% year over year. Total revenues of $1.8 billion increased 5.1% year over year in the quarter. The growth came on the back of higher P&C insurance net earned premiums and other income. The top line missed the Zacks Consensus Estimate by 0.2%.P&C insurance net earned premiums of $1.5 billion climbed 7.5% year over year. Net investment income decreased 8.7% year over year to $198 million in the quarter under review. The figure was lower than our estimate of $226.8 million. Total cost and expenses increased 8.5% year over year to $1.6 billion due to higher P&C insurance losses & expenses and other expenses. The figure was lower than our estimate of $1.7 billion.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nCincinnati Financial Corporation (CINF) : Free Stock Analysis Report\nAxis Capital Holdings Limited (AXS) : Free Stock Analysis Report\nAmerican Financial Group, Inc. (AFG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-05-16T15:54:49.000Z",
        "Title": "Warren Buffett's Berkshire Confirms Apple Sale, Dumps This PC Maker, Finally Reveals Mystery Stock: Here Are The Portfolio Changes To Know",
        "Author": "  Shanthi Rexaline ",
        "Text": "Investment guru Warren Buffett confirmed Wednesday the trimming of his Apple, Inc. (NASDAQ:AAPL) stake and finally shed light on the mystery stock his firm, Berkshire Hathaway, Inc. (NYSE:BRK) (NYSE:BRK), accumulated ahead of the first quarter.\nApple, Chevron Trimmed: Berkshire reduced its Apple position by a little over 116 million.\nThe firm now owns 789,368,450 Apple shares valued at $135.36 billion, a 13F filing shows. This is the second straight quarter that the Buffett-led company has diluted its Apple stake.\nThe iPhone manufacturer remains Berkshire’s top holding.\nEarlier this month, Buffett — at the annual Berkshire shareholder meeting — said the dilution has to do with footing the tax bill and the desire to hold more cash due to economic uncertainties.\nAfter adding 15.9 million Chevron Corp. (NYSE:CVX) shares in the fourth quarter, the firm sold 3.1 million shares of the oil giant in the first quarter. The latest 13F showed Berkshire owning 112.98 million shares worth $305.70 million.\nBut Berkshire added 4.32 million shares of  Occidental Petroleum Corp. (NYSE:OXY), with its latest stake amounting to 248.02 million.\nBerkshire maintained its stake in its other three core holdings:\nBank of America, Inc. (NYSE:BAC): 1.03 million shares valued at $39.17 billion\nAmerican Express Co. (NYSE:AXP): 151.61 million shares valued at $34.52 billion\nCoca-Cola Co. (NYSE:KO): 400 million shares valued at $24.47 billion\nSee Also: Best Growth Stocks Right Now\nMystery Stock Unveiled: Berkshire also finally disclosed the mystery stock it sounded out earlier. The firm bought a big chunk of Chubb Limited (NYSE:CB) shares.\nBerkshire accumulated 25.92 million shares of the property and casualty insurer at a valuation of $6.72 billion. This stake gives Berkshire a 6.4% stake in the insurer (based on 406 million in outstanding shares).\nInsurance has been a staple sector in Berkshire’s portfolio. Other holdings include auto insurer GEICO, reinsurance company General Re and Alleghany Corporation, a holding company of property and casualty reinsurance and insurance operating subsidiaries.\nHP Stake Jettisoned: Berkshire cashed out of HP Inc. (NYSE:HPQ) in the first quarter. The firm sold all the 22.85 million shares (worth $687.64 million) of the computer and peripherals maker it held at the fourth quarter.\nOther Disposals: Among the other portfolio stocks, the firm part disposed include:\n\nCurrent Position(number of shares)\nQ-o-Q Change\nLouisiana-Pacific Corporation (NYSE:LPX)\n6.60M\n-6.34%\nParamount Global (NASDAQ:PARA)\n7.53M\n-88.11%\nSirius XM Holdings Inc. (NASDAQ:SIRI)\n36.68M\n-8.85%\nAt the shareholder meeting, Buffett previewed the Paramount Global sale and took the responsibility for zeroing in on the investment.\n“It was 100% my decision, and we’ve sold it all, and we lost quite a bit of money,” he said.\nBerkshire Hathaway’s Class A shares were little changed at $413.01 in premarket trading, according to Benzinga Pro data.\nNow Read: Bill Ackman’s Pershing Square Q1 Shake-Up: Home Retailer Dumped, Hot Restaurant Stake Trimmed And A ‘Magnificent 7’ Holding Juggled\nImage: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Warren Buffett's Berkshire Confirms Apple Sale, Dumps This PC Maker, Finally Reveals Mystery Stock: Here Are The Portfolio Changes To Know originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-04T23:18:54.000Z",
        "Title": "Buffett says Berkshire in good hands, lauds Apple despite lowering stake",
        "Author": "  Jonathan Stempel and Koh Gui Qing ",
        "Text": "By Jonathan Stempel and Koh Gui Qing\nOMAHA, Nebraska (Reuters) -Warren Buffett assured Berkshire Hathaway shareholders on Saturday that the executives expected to succeed him were ready for the job, and he heaped praise on Apple although Berkshire trimmed its position in the iPhone maker.\nSpeaking at Berkshire’s annual meeting, the legendary investor paid tribute to his late business partner Charlie Munger and said he expected the conglomerate’s cash pile, now a record $189 billion, to keep growing.\nThe meeting was the 60th for Buffett, who since 1965 transformed Berkshire from a failing textile company into an $862 billion colossus owning the BNSF railroad, Geico car insurance, Dairy Queen and dozens of other businesses.\nBuffett, 93, told shareholders that Vice Chairmen Greg Abel and Ajit Jain have proven themselves the right people to lead Berkshire after he departs.\nAbel, who was designated Buffett's successor as chief executive in 2021, and Jain have directly overseen Berkshire's operating subsidiaries since 2018.\n\"When you've got somebody like Greg and Ajit, why settle for me?\" Buffett said. \"It has worked out extremely well.\"\n\"I don't know quite how (Abel) does it, but we've got the right person, I can tell you that,\" he added.\nBuffett said he would want Abel, 61, upon becoming chief executive, to have final say on capital allocation decisions regarding Berkshire's portfolio of public stocks.\nInvestors had long considered Todd Combs and Ted Weschler, who manage part of Berkshire's $335.9 billion equity portfolio, leading candidates to manage more or all of it.\nThe meeting, part of a weekend Buffett calls \"Woodstock for Capitalists,\" was the first since Munger died in November at age 99. Buffett described Munger, his longtime his friend and foil, as the \"architect of today's Berkshire.\"\nBuffett gave no sign he plans to step aside, telling shareholders, \"I feel fine,\" while joking he shouldn't take on four-year employment contracts.\nDECREASING APPLE STAKE, GROWING CASH\nBefore the meeting, Berkshire announced first-quarter results, including a 39% jump in operating profit to a record $11.2 billion.\nIn a surprise, Berkshire reported it had sold about 13% of its Apple shares, reducing the value of its stake to $135.4 billion from $174.3 billion. Apple's stock price fell 11% in the quarter.\nThe sale was the main reason Berkshire's cash hoard soared. Buffett said cash might grow to $200 billion this quarter, reflecting the risks he sees from high stock market valuations and geopolitical conflicts.\nDespite reducing the Apple stake, Buffett praised the company, saying it was \"an even better business\" than two of Berkshire's oldest and largest investments, American Express and Coca-Cola.\nThe iPhone was \"one of the greatest products, and it may be the greatest product, of all time,\" Buffett said with Apple Chief Executive Tim Cook in the audience.\nBerkshire invested in Apple in 2016, and the normally tech-phobic Buffett came to view it as a consumer goods company with strong pricing power and devoted customers.\nWhile some investors have expressed concern that Apple comprised too much of Berkshire's equity portfolio, Buffett said Apple would remain his company's biggest stock investment, barring unforeseen events.\nAbel, meanwhile, pledged to fight lawsuits seeking tens of billions of dollars from Berkshire's PacifiCorp utility unit over Oregon wildfires in 2020. He described it as a substantial challenge, and said many claims were unfounded.\nShareholders reelected all 14 Berkshire directors, and rejected six shareholder proposals, all of which Buffett opposed.\nAt the start of the meeting, shareholders watched a video tribute to Munger, including scenes of Omaha from 1924 when he was born and clips of Buffett and Munger through the years.\nMunger had been a fixture on stage with Buffett at the meetings, known for laconic and acerbic comebacks to Buffett's musings about Berkshire, the economy, Wall Street and life.\nBerkshire's stock is up 23% over the last year. While that lags the Standard & Poor's 500's 25% gain, Berkshire has risen 218% over the last decade versus the S&P's 172% gain.\nLINES FORMED HOURS BEFORE MEETING\nBefore the meeting, thousands lined up in raw, rainy weather to enter the arena, sometimes several hours in advance. When the doors opened at 7 a.m., many ran for the best seats.\nThe weekend also featured an exhibit hall for shareholders to buy goodies such as Berkshire T-shirts and Squishmallows toys at exhibits by Berkshire-owned companies.\nSerena Lam, 32, an investment manager who traveled with 40 others from Hong Kong, said she arrived at 2:30 a.m.\n\"I want to see Warren Buffett,\" she said. \"I want to get his perspective about Japanese stocks. I flew over 25 hours for this.\"\nAs usual, Buffett interspersed comments on Berkshire's portfolio with musings about wealth and life, including his own.\n“I enjoy managing money for the people who trust me. I like the feeling of being trusted,\" he said. \"If I'm lucky, I can go on for six or seven years, or it might end tomorrow.\"\n(Reporting by Gui Qing Koh and Jonathan Stempel in Omaha; additional reporting by Scott Morgan in Omaha and Davide Barbuscia in New York; editing by Ira Iosebashvili, Megan Davies, Cynthia Osterman, Jason Neely and Diane Craft)\n"
    },
    {
        "Date": "2024-05-14T18:01:23.000Z",
        "Title": "Tom Russo's Strategic Moves in Q1 2024: A Closer Look at Berkshire Hathaway's Adjustment",
        "Author": "  GuruFocus Research ",
        "Text": "Tom Russo (Trades, Portfolio), the seasoned investor at the helm of Gardner Russo & Quinn LLC, has made notable changes to his investment portfolio in the first quarter of 2024. With a career that began in 1989 and a managing role since 2014, Russo manages over $8 billion in assets. His investment strategy focuses on companies with robust cash-flow characteristics and high returns on invested capital, favoring those with strong balance sheets and significant free cash flow.\nTom Russo (Trades, Portfolio) expanded his portfolio by adding two new stocks in this quarter:\nLvmh Moet Hennessy Louis Vuitton SE (LVMUY) with 1,121 shares, valued at approximately $201.87 million.\nUnum Group (NYSE:UNM) with 4,050 shares, valued at approximately $217.32 million.\nRusso also increased his stakes in a total of 12 stocks, with significant boosts in:\nPernod Ricard SA (PDRDF), adding 211,183 shares to bring the total to 3,026,620 shares. This adjustment increased the share count by 7.51% and had a 0.35% impact on the current portfolio, totaling $489.66 million.\nUber Technologies Inc (NYSE:UBER), with an additional 218,865 shares, bringing the total to 3,300,228 shares. This represents a 7.1% increase in share count, totaling $254.08 million.\nIn the first quarter of 2024, Tom Russo (Trades, Portfolio) exited three positions:\nGraham Holdings Co (NYSE:GHC), selling all 1,161 shares, impacting the portfolio by -0.01%.\nPioneer Natural Resources Co (NYSE:PXD), liquidating all 2,400 shares, also impacting the portfolio by -0.01%.\nSignificant reductions were made in 50 stocks, including:\nBerkshire Hathaway Inc (NYSE:BRK.A), reduced by 285 shares, resulting in an 11.79% decrease in shares and a -1.58% impact on the portfolio. The stock traded at an average price of $593,888 during the quarter and has returned 2.80% over the past three months and 13.86% year-to-date.\nNetflix Inc (NASDAQ:NFLX), reduced by 250,887 shares, resulting in a 22.3% reduction in shares and a -1.24% impact on the portfolio. The stock traded at an average price of $563.82 during the quarter and has returned 6.22% over the past three months and 26.39% year-to-date.\nAs of the first quarter of 2024, Tom Russo (Trades, Portfolio)'s portfolio included 81 stocks. The top holdings were:\n13.88% in Berkshire Hathaway Inc (NYSE:BRK.A)\n11.03% in Alphabet Inc (NASDAQ:GOOG)\n10.38% in Mastercard Inc (NYSE:MA)\n7.9% in Nestle SA (NSRGY)\n7.26% in Compagnie Financiere Richemont SA (CFRHF)\nThe holdings are mainly concentrated in 10 of the 11 industries, including Financial Services, Consumer Defensive, and Technology, among others.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-04T19:59:20.000Z",
        "Title": "Warren Buffett says Berkshire sold entire Paramount stake at a loss",
        "Author": "Reuters ",
        "Text": "NEW YORK (Reuters) -Warren Buffett said on Saturday that Berkshire Hathaway sold its entire holding in media and entertainment company Paramount Global at a loss and he took sole responsibility for the decision.\n\"It was 100% my decision, and we've sold it all, and we lost quite a bit of money,\" Buffett said at Berkshire's annual shareholder meeting in Omaha, Nebraska.\nBerkshire held 63.3 million Paramount Class B shares at the end of 2023 or about 10.1% of the company.\nParamount, like other studios, has been struggling to recover from strikes by Hollywood writers and actors last year, a soft advertising market and falling U.S. cable subscriptions that have eroded its TV profits.\nA special committee of the Paramount board, created to evaluate offers for the company, has been holding exclusive deal talks with Skydance Media. But Paramount will end those negotiations without a deal, a person familiar with the discussions told Reuters on Friday, allowing it to evaluate a rival bid.\nThe media giant declined to comment on Berkshire's stock sale.\n(Reporting by Davide Barbuscia; Editing by Josie Kao and Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-10T10:50:00.000Z",
        "Title": "Elon Musk says Warren Buffett should buy Tesla stock — Berkshire already even owns a stake in its top competitor",
        "Author": "  Jing Pan ",
        "Text": "Warren Buffett is one of the most closely watched investors in the world — and with good reason. From 1964 to 2023, he steered Berkshire Hathaway (BRK.B) to an astounding overall gain of 4,384,748%.\nFollowing Berkshire's recent annual shareholders meeting, the internet is abuzz with discussions of Buffett's current investments and potential future moves.\nCommercial real estate has beaten the stock market for 25 years — but only the super rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger\nCost-of-living in America is still out of control — use these 3 'real assets' to protect your wealth today, no matter what the US Fed does or says\nThese 5 magic money moves will boost you up America's net worth ladder in 2024 — and you can complete each step within minutes. Here's how\nOn X, one user made a daring proposition to the Oracle of Omaha, stating, “c'mon Warren Buffett, sell all your $AAPL and buy $TSLA.”\nGiven that Apple is currently Berkshire's largest holding, it’s a bold suggestion.\nThe post also caught the attention of Tesla CEO Elon Musk, who replied, “He should take a position in Tesla. It’s an obvious move.”\nTesla is one of the most volatile names in the market. While shares are down nearly 30% year to date, they’re up a whopping 992% over the last five years.\nBuffett hasn’t invested in Tesla, but he holds Musk in high regard. He called him “a brilliant, brilliant guy” at Berkshire’s annual shareholders meeting in 2023.\nBuffett also noted, “We don't want to compete with Elon in a lot of things.”\nBuffett’s late right-hand man, Charlie Munger, concurred. “We don’t want that much failure,” he said.\nStill, in a post on X last year, Musk revealed that Munger had the chance to invest in Tesla but chose not to, potentially missing out on substantial profits.\n“Munger could’ve invested in Tesla at ~$200M valuation when I had lunch with him in late 2008,” he wrote.\nTo put things in perspective, Tesla now commands a market cap of over $540 billion.\nRead more: Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2024\nTo be sure, Buffett hasn't entirely sidestepped the EV race.\nChinese EV manufacturer BYD has been a part of investing legend Warren Buffett's portfolio for more than a decade.\nIn 2008, Berkshire Hathaway acquired 225 million shares of BYD for $232 million, a move that proved to be highly lucrative. By the end of 2020, as stated in Berkshire’s shareholder letter, their stake was valued at approximately $5.9 billion.\nAlthough Buffett later began reducing his stake in BYD, an October 2023 stock exchange filing reported on by Reuters revealed that Berkshire still held a sizable 7.98% stake in the company.\nIn the fourth quarter of 2023, BYD’s EV sales reached 526,409 vehicles, overtaking Tesla's deliveries of 484,507 EVs, according to Reuters, and displacing it as the top EV manufacturer globally.\nMusk has acknowledged the competitive threat posed by Chinese automakers.\nIn January, he said that without trade barriers, Chinese car companies “will pretty much demolish most other companies in the world.”\nIn this year’s Berkshire shareholders meeting, Buffett did comment on Tesla, but it was in response to a question on how Tesla’s autonomous driving technology might reduce accidents, potentially affecting the business of Geico, an auto insurance company owned by Berkshire.\n“If accidents get reduced by 50%, it's going to be good for society and it's going to be bad for insurance companies' volume. But good for society is what we're looking for,” Buffett said.\nAjit Jain, vice chairman of insurance operations at Berkshire Hathaway, added that while the number of accidents might decrease as a result of autonomous driving technology, the repair cost per accident could be substantially higher.\n“If you multiply the number of accidents times the cost of each accident, I'm not sure that total number has come down as much as Tesla would like us to believe,” he explained.\nJain also remarked on Tesla’s own ventures into the insurance industry.\n“Tesla has been toying with the idea of writing insurance directly or indirectly, and so far it hasn’t really been much of a success.”\nCar insurance premiums in America are through the roof — and only getting worse. But 5 minutes could have you paying as little as $29/month\nJeff Bezos, Mark Zuckerberg, and Jamie Dimon are selling out of US stocks in a big way — here's how to diversify into private real estate within minutes\n'It's not taxed at all': Warren Buffett shares the 'best investment' you can make when battling rising costs — take advantage today\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind.\n"
    },
    {
        "Date": "2024-05-06T10:27:59.000Z",
        "Title": "The Oracle of Omaha warns about AI: What Buffett said at Berkshire",
        "Author": " Sam Ro    · Contributor",
        "Text": "A version of this post first appeared on TKer.co\nOMAHA, Neb. — Warren Buffett, CEO of Berkshire Hathaway, has mixed feelings about artificial intelligence (AI).\n\"It has enormous potential for good and enormous potential for harm,\" Buffett said at Berkshire’s annual shareholders meeting on Saturday.\nHe shared a personal experience with AI that had him shook.\n\"Fairly recently, I saw an image in front of my screen,\" he said. \"It was me, and it was my voice and wearing the kind of clothes I wear. My wife or my daughter wouldn't have been able to detect any difference. And it was delivering a message that in no way it came from me.\"\nHe explained: \"When you think about the potential for scamming people … Scamming has always been part of the American scene. If I was interested in investing in scamming — it’s going to be the growth industry of all time.\"\nBuffett drew comparisons to the emergence of nuclear weapons.\n\"We let the genie out of the bottle when we developed nuclear weapons, and that genie has been doing some terrible things,\" he said. \"The power of that genie scares the hell out of me. And I don’t know of any way to get the genie back in the bottle. And AI is somewhat similar. It’s part of the way out of the bottle.\"\nIn the context of investing, analysts have mostly spoken bullishly about AI thanks to the potential for improving productivity across many sectors. TKer has written about this narrative here, here, and here.\nAsked later about how Berkshire’s own businesses could be disrupted by AI, Buffett noted the technology would affect \"anything that’s labor sensitive\" and that for workers it could \"create an enormous amount of leisure time.\"\nGreg Abel, vice chairman of Berkshire’s non-insurance businesses, added that \"we’re in the early innings\" of understanding the impact.\nBuffett, arguably the most successful stock market investor in history, is well-known for his persistent bullish long-term view of the US economy and stock market.\n\"I understand the United States’ rules, weaknesses, strengths,\" Buffett said on Saturday. \"I don't have the same feeling generally around the world. And the lucky thing is that I don't have to.\"\nBut he’s no stranger to expressing caution on matters with significant downside risks — especially in regards to technology.\nFor example, Buffett has been vocal about his concerns about cyber attacks. Here’s some language I shared in the March 5, 2023 issue of TKer:\n\"There is, however, one clear, present and enduring danger to Berkshire against which Charlie and I are powerless. That threat to Berkshire is also the major threat our citizenry faces: a ‘successful’ (as defined by the aggressor) cyber, biological, nuclear or chemical attack on the United States.\" - Buffett in 2016\"\n\"I don't know that much about cyber, but I do think that's the number one problem with mankind.\" - Buffett in 2017\n\"Cyber is uncharted territory. It’s going to get worse, not better.\"- Buffett in 2018\n\"I think cyber poses real risks to humanity.\" - Buffett in 2019\nAs you can see, this dire tone from Buffett is not new.\nWhat’s important is that it has never stopped him from being bullish on stocks for the long run.\nEmerging technologies like AI come with risk, as they have the potential to scale up bad behavior in the same ways they’ll scale up good behavior.\nBroadly speaking, you can never be certain about how risky anything is. And even worse, there are limits to how much you can hedge a risk before you eliminate the potential for a reasonable return.\nUnfortunately, this is just the nature of investing in stocks. And it speaks to why returns in the stock market are relatively high — investors demand a high premium for the uncertainty tied to taking on the risk.\n\"Nothing’s sure tomorrow,\" Buffett said at last year’s meeting. \"Nothing’s sure next year. Nothing is ever sure in markets or in business forecasts or anything else.\"\nWe can only hope that history repeats and the good outcomes far outweigh the bad outcomes — as they always have.\nThere were a few notable data points and macroeconomic developments from last week to consider:\nStocks climbed last week with the S&P 500 rising 0.5% to close at 5,127.79. The index is now up 7.5% year to date and up 43.4% from its October 12, 2022 closing low of 3,577.03. \nThe labor market continues to add jobs. According to the BLS’s Employment Situation report released Friday, US employers added 175,000 jobs in April. It was the 40th straight month of gains, reaffirming an economy with robust demand for labor.\nTotal payroll employment is at a record 158.29 million jobs, up 5.98 million from the pre-pandemic high.\nThe unemployment rate — that is, the number of workers who identify as unemployed as a percentage of the civilian labor force — rose to 3.9% during the month. It was the 27th consecutive month below 4%. While it’s above its cycle low of 3.4%, it continues to hover near 50-year lows.\nWage growth cools. Average hourly earnings rose by 0.2% month-over-month in April, down from the 0.3% pace in March. On a year-over-year basis, this metric is up 3.9%, the lowest rate since June 2021.\nJob openings fall. According to the BLS’s Job Openings and Labor Turnover Survey, employers had 8.49 million job openings in March, down from 8.81 million in February. While this remains elevated above pre-pandemic levels, it’s down from the March 2022 high of 12.18 million.\nDuring the period, there were 6.43 million unemployed people — meaning there were 1.32 job openings per unemployed person. This continues to be one of the most obvious signs of excess demand for labor.\nLayoffs remain depressed, hiring remains firm. Employers laid off 1.53 million people in March. While challenging for all those affected, this figure represents just 1.0% of total employment. This metric continues to trend below pre-pandemic levels.\nHiring activity continues to be much higher than layoff activity. During the month, employers hired 5.5 million people.\nPeople are quitting less. In March, 3.33 million workers quit their jobs. This represents 2.1% of the workforce, which is the lowest level since August 2020 and below the pre-pandemic trend.\nA low quits rate could mean a number of things: More people are satisfied with their jobs; workers have fewer outside job opportunities; cooling wage growth; and productivity will improve as fewer people are entering new unfamiliar roles.\nLabor productivity inches up. From the BLS: \"Nonfarm business sector labor productivity increased 0.3% in the first quarter of 2024 … as output increased 1.3 percent and hours worked increased 1.0%. … From the same quarter a year ago, nonfarm business sector labor productivity increased 2.9%.\"\nFrom JPMorgan: \"Labor productivity had been running at a particularly strong pace for much of last year ... and some reversion lower was likely, but we suspect the underlying trend for productivity growth remains stronger than today’s preliminary quarterly growth suggests.\"\nJob switchers still get better pay. According to ADP, which tracks private payrolls and employs a different methodology than the BLS, annual pay growth in April for people who changed jobs was up 9.3% from a year ago. For those who stayed at their job, pay growth was 5%.\nKey labor costs metric heat up. The employment cost index in Q1 2024 was up 1.2% from the prior quarter, up from the 0.9% rate in Q4. This was the hottest print since Q3 2022. On a year-over-year basis, it was up 4.2% in Q1, unchanged from the Q4 level.\nFrom Renaissance Macro: \"Plenty of indicators out there that show cooling labor costs. Unfortunately, the best one, the Employment Cost Index, is not one of them.\"\nUnemployment claims tick lower. Initial claims for unemployment benefits stood at 207,000 during the week ending April 27, unchanged from the week prior. While this is above the September 2022 low of 187,000, it continues to trend at levels historically associated with economic growth.\nConsumer vibes recovery stalls. The Conference Board’s Consumer Confidence Index fell in April. From the firm’s Dana Peterson: \"Confidence retreated further in April, reaching its lowest level since July 2022 as consumers became less positive about the current labor market situation, and more concerned about future business conditions, job availability, and income. … In the month, confidence declined among consumers of all age groups and almost all income groups except for the $25,000 to $49,999 bracket. Nonetheless, consumers under 35 continued to express greater confidence than those over 35. In April, households with incomes below $25,000 and those with incomes above $75,000 reported the largest deteriorations in confidence. However, over a six-month basis, confidence for consumers earning less than $50,000 has been stable, but confidence among consumers earning more has weakened.\"\nConsumers feel less great about the labor market. From The Conference Board’s April Consumer Confidence survey: \"Consumers’ appraisal of the labor market deteriorated in April. 40.2% of consumers said jobs were 'plentiful,' down from 41.7% in March. 14.9% of consumers said jobs were 'hard to get,' up from 12.2%.\"\nMany economists monitor the spread between these two percentages (a.k.a., the labor market differential), and it’s been reflecting a cooling labor market.\nGas prices tick up. From AAA: \"The national average for a gallon of gas waffled up and down over the past week before settling higher by two cents at $3.67. The slight increase in pump prices happened despite a lull in domestic gasoline demand and falling oil prices. … According to new data from the Energy Information Administration (EIA), gas demand rose slightly from 8.42 million b/d to 8.62 last week. Meanwhile, total domestic gasoline stocks increased by .4 million bbl to 227.1 million bbl. Tepid demand, increasing supply, and falling oil prices could lower pump prices.\"\nCard data mixed on April spending. From JPMorgan: \"As of 23 Apr 2024, our Chase Consumer Card spending data (unadjusted) was 2.6% below the same day last year. Based on the Chase Consumer Card data through 23 Apr 2024, our estimate of the U.S. Census April control measure of retail sales m/m is 0.28%.\"\nFrom Bank of America: \"Total card spending per HH was up 0.5% y/y in the week ending Apr 27, according to BAC aggregated credit & debit card data. This was a bounce back from last week's -0.5% y/y total card spending growth rate. Retail ex auto spending per HH came in at -0.2% y/y in the week ending Apr 27.\"\nHome prices rise. According to the S&P CoreLogic Case-Shiller index, home prices rose 0.6% month-over-month in February. From S&P Dow Jones Indices' Brian Luke: \"Since the previous peak in prices in 2022, this marks the second time home prices have pushed higher in the face of economic uncertainty. The first decline followed the start of the Federal Reserve’s hiking cycle. The second decline followed the peak in average mortgage rates last October. Enthusiasm for potential Fed cuts and lower mortgage rates appears to have supported buyer behavior, driving the 10- and 20- City Composites to new highs.\"\nMortgage rates rise. According to Freddie Mac, the average 30-year fixed-rate mortgage rose to 7.22% from 7.17% the week prior. From Freddie Mac: \"The 30-year fixed-rate mortgage increased for the fifth consecutive week as we enter the heart of Spring Homebuying Season. On average, more than one-third of home sales for the entire year occur between March and June. With two months left of this historically busy period, potential homebuyers will likely not see relief from rising rates anytime soon. However, many seem to have acclimated to these higher rates, as demonstrated by the recently released pending home sales data coming in at the highest level in a year.\"\nThere are 146 million housing units in the US, of which 86 million are owner-occupied. 39% are mortgage-free. Of those carrying mortgage debt, almost all have fixed-rate mortgages, and most of those mortgages have rates that were locked in before rates surged. All of this is to say: Most homeowners are not particularly sensitive to movements in home prices or mortgage rates.\nServices surveys signal growth is cooling. From S&P Global’s April US Services PMI: \"Demand has weakened, as signaled by the first fall in new orders for goods and services for six months, in part a reflection of both businesses and households adjusting to higher costs and the prospect of higher for longer interest rates. Business optimism has likewise cooled, dropping to the lowest since November, and companies are taking a more cautious approach to staffing levels.\"\nThe ISM’s April Manufacturing PMI signaled a contraction in the industry.\nManufacturing surveys deteriorate. From S&P Global’s April US Manufacturing PMI: \"Business conditions stagnated in April, failing to improve for the first time in four months and pointing to a weak start to the second quarter for manufacturers. Order inflows into factories fell for the first time since December, meaning producers had to rely on orders placed in prior months to keep busy. However, there are some encouraging signs. The drop in orders appears to have been largely driven by reduced demand for semi-manufactured goods – inputs produced for other firms – as factories adjust their inventories of inputs. In contrast, consumer goods producers reported a further strengthening of demand, hinting that the broader consumer-driven economic upturn remains intact.\"\nIt’s worth remembering that soft data like the PMI surveys don’t necessarily reflect what’s actually going on in the economy.\nConstruction spending ticks lower. Construction spending declined 0.2% to an annual rate of $2.1 trillion in March.\nBusiness investment activity is up. Orders for nondefense capital goods excluding aircraft — a.k.a. core capex or business investment — grew 0.1% to $73.76 billion in March.\nCore capex orders are a leading indicator, meaning they foretell economic activity down the road. While the growth rate has leveled off a bit, orders continue to signal economic strength in the months to come.\nNear-term GDP growth estimates look good. The Atlanta Fed’s GDPNow model sees real GDP growth climbing at a 3.3% rate in Q2.\nThe Fed holds steady. The Federal Reserve announced it would keep its benchmark interest rate target high at a range of 5.25% to 5.5% as inflation data remain hotter than desired.\nFrom the Fed’s statement (emphasis added): \"Recent indicators suggest that economic activity has continued to expand at a solid pace. Job gains have remained strong, and the unemployment rate has remained low. Inflation has eased over the past year but remains elevated. In recent months, there has been a lack of further progress toward the Committee's 2% inflation objective.\"\nThe bottom line: The Fed will keep monetary policy tight until inflation rates cool further. That means the odds of a rate cut in the near term will remain low.\nWe continue to get evidence that we are experiencing a bullish “Goldilocks” soft landing scenario where inflation cools to manageable levels without the economy having to sink into recession.\nThis comes as the Federal Reserve continues to employ very tight monetary policy in its ongoing effort to get inflation under control. While it’s true that the Fed has taken a less hawkish tone in 2023 and 2024 than in 2022, and that most economists agree that the final interest rate hike of the cycle has either already happened, inflation still has to stay cool for a little while before the central bank is comfortable with price stability.\nSo we should expect the central bank to keep monetary policy tight, which means we should be prepared for relatively tight financial conditions (e.g., higher interest rates, tighter lending standards, and lower stock valuations) to linger. All this means monetary policy will be unfriendly to markets for the time being, and the risk of the economy slipping into a recession will be relatively elevated.\nAt the same time, we also know that stocks are discounting mechanisms — meaning that prices will have bottomed before the Fed signals a major dovish turn in monetary policy.\nAlso, it’s important to remember that while recession risks may be elevated, consumers are coming from a very strong financial position. Unemployed people are getting jobs, and those with jobs are getting raises.\nSimilarly, business finances are healthy as many corporations locked in low interest rates on their debt in recent years. Even as the threat of higher debt servicing costs looms, elevated profit margins give corporations room to absorb higher costs.\nAt this point, any downturn is unlikely to turn into economic calamity given that the financial health of consumers and businesses remains very strong.\nAnd as always, long-term investors should remember that recessions and bear markets are just part of the deal when you enter the stock market with the aim of generating long-term returns. While markets have recently had some bumpy years, the long-run outlook for stocks remains positive.\nA version of this post first appeared on TKer.co\n"
    },
    {
        "Date": "2024-05-05T10:09:41.000Z",
        "Title": "Berkshire's Brooks Running CEO sees China, Europe as growth areas",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Neb. (Reuters) - The new chief executive of Brooks Running said the running shoe maker owned by Warren Buffett's Berkshire Hathaway views China and Europe as growth areas for a business that generates most revenue in the U.S.\nDan Sheridan, who became chief executive on April 26, said in an interview at Berkshire's annual shareholder weekend that Brooks plans to open its first store in China this fall in Shanghai, with possibly more later.\n\"China is a top-10 market for running participation,\" he said on Friday. \"This is a 30- to 50-year strategy for Brooks. We're in this for the long haul.\"\nEuropean markets are starting to revive after the Russia-Ukraine war and rising energy costs caused consumers to pull back, while retailers struggled with excess inventory and falling margins.\nSheridan, 51, said the number of runners globally could double by 2031. He believes 110-year-old Brooks is well-positioned to capture sales with 300 million people running or walking as their main fitness activity.\n\"When you look at the opportunities for this brand, and trends that underpin those opportunities, it's easy to be excited in our growth and our future,\" he said.Sheridan succeeded Jim Weber, who led Brooks for 23 years and took the brand from near bankruptcy to $1.2 billion in revenue. Weber, 64, stepped back primarily for health reasons.\nThe new CEO joined Brooks in 1998 and has spent his entire career there, becoming chief operating officer in 2019 and president in 2022.\nThe Seattle-based company commands an industry-leading 21% U.S. market share in adult performance running shoes, according to Circana/Retail Tracking Service, with its Ghost and Adrenaline GTS the top sellers.\nNEW PRODUCTS\nBrooks, which derives 85% of revenue from the U.S., focuses on the top of the market. \"The right way for us to win the runner is through a science-based approach matched with great design,\" Sheridan said.\nPandemic-fueled growth in running has helped support pricing, he said. The average retail price for performance running shoes rose 11% in a little over a year, to an average $87 in the U.S.\nInflation pressures and supply chain problems are moderating as well, he said. Most Brooks' shoes are made in Vietnam, with a small percentage coming from Indonesia.\nThose supply chain snags disrupted the company's annual and semi-annual product launch cycles. \"That took almost $150 million out of our revenue annually. We're back to a full assortment of product and a full playbook,\" he said.\nThe latest innovation: nitrogen-infused cushioning in the $160 Glycerin 21, which Sheridan says dampens impact but returns energy to the runner.\n(Reporting by Jonathan Stempel in Omaha, Nebraska)\n"
    },
    {
        "Date": "2024-05-01T16:21:45.000Z",
        "Title": "Solar Stocks, Berkshire and the Latest Costco Craze",
        "Author": "  Wall Street Horizon ",
        "Text": "After a cool spell late last week, springtime is in full bloom around our parts in the Northeast. As the calendar flips to May, the second quarter has not come without its bouts of uncomfortable market conditions either. The S&P 500 pared its 2024 gains in April, but earnings growth appears on track, according to the latest collective numbers by the world's biggest companies. Along with a Federal Reserve meeting this week, key macro data will shower investors on Friday and thereafter via employment and inflation updates.\nThis week, let's shine a light on one stock market niche that has been flat-out burned ever since interest rates began to lift off in late 2021. The solar industry, once tied to happenings in the Energy sector, is now among the most susceptible areas to higher borrowing costs. The debt-dependent group seems to just live and die by the latest moves in the U.S. Treasury bond market. When yields spike, you tend to see an impact to names like Invesco Solar ETF (TAN), charted below. The market has shown that when rates retreat, relief rallies often ensue.\nWhen will that intermarket relationship break? It is hard to pinpoint, but we will hear from a few of the solar industry's big players in May through quarterly reports, shareholder meetings and corporate conferences.\nSource: Stockcharts.com\nLast week, Enphase Energy (NASDAQ:ENPH) was among the biggest earnings movers after it posted a double miss on the evening of April 23. The $15 billion market cap Semiconductor Materials & Equipment industry company within the Information Technology sector recorded first-quarter non-GAAP earnings per share of 35 cents, while revenue of $263 million also came up shy of the Wall Street consensus.1\nShares plunged immediately after the numbers hit the tape, but then found some footing by Wednesday morning. It was really a triple-play miss considering Enphase's management team lowered top-line guidance amid softening domestic demand, though sales growth in Europe jumped 70% from the first quarter.\nIt seems to be the same old story for solar stocks. The TAN ETF notched multiyear lows in April and traded lower after the ENPH report. There is potential for more volatility. According to Wall Street Horizon's data, TAN's biggest weight, First Solar (NASDAQ:FSLR), is confirmed to report first-quarter 2024 earnings on Wednesday, May 1 AMC with a conference call immediately after the numbers cross the wires. China's GCL Technology Holdings (GCPEF) also issues quarterly numbers then.\nThen, on the afternoon of May 8, First Solar holds its annual shareholder meeting right before a pair of industry companies post their quarterly results; the embattled SolarEdge Technologies (NASDAQ:SEDG), down more than 80% over the past 12 months, and Sunrun (NASDAQ:RUN), off by more than half since this time in 2023, both post first-quarter numbers and host earnings calls. Array Technology (NASDAQ:ARRY) reports the following afternoon.\nOn the conference front, updates from many major solar industry players will be heard at Citi's 2024 Energy and Climate Technology Conference from May 14 to 15 and the Deutsche Bank Global Solar & Clean Tech Conference 2024 (virtual) on May 16. So, as executives shed light on existing issues and emerging trends, keep this slice of the market on your radar.\nWhat else is happening as the new month gets going? The first Saturday in May does not only mark the big race at Churchill Downs. It's also when Berkshire Hathaway's (NYSE:BRK.A) (NYSE:BRK.B) annual shareholder meeting takes place. The first year without the esteemed presence of the late Charlie Munger will be tough, but investors may take solace in seeing Warren Buffett (Trades, Portfolio) on stage along with other Berkshire execs.\nIt comes at a time when the insurance industry faces increasing scrutiny considering steep rate increases in the homeowner and auto categories. Berkshire stock has come off its highs after rallying sharply in the previous 18 months. In general, rising interest rates are a net positive for insurers. Following somewhat sanguine comments from JPMorgan Chase (NYSE:JPM) CEO Jamie Dimon last week, describing the U.S. economy as booming, we'll hear how Buffett views the state of the macro.2\nBerkshire shares take a greather after a big run-up\nSource: Stockcharts.com\nAfter Cinco de Mayo, Costco (NASDAQ:COST) offers among the first April reads on consumer spending via its monthly same-store sales report. With full quarterly earnings not due until May 30, investors will find out if the $317 billion market cap retailer built on its March 9.40% year-over-year net sales jump.3 You might have heard that Costco is now in the gold market. Last summer, it began offering gold at relatively cheap prices compared to other physical gold sellers.4\nThe strategy was apparently a hit as the company then started offering low-markup silver to its members. It is estimated that the precious metals business could be adding 1% to comparable-store revenue and 3% to its General Merchandise sales tally.5 At the very least, media attention has been high as gold prices have increased toward $2400 per ounce.\nFirst-quarter results are tracking pretty well for S&P 500 companies through week three of the reporting season. Not all areas enjoyed profitability gains, however. The troubled solar industry continues to grapple with higher interest rates and ongoing tariff chatter. Elsewhere, Berkshire Hathaway issues its first-quarter results this Saturday in Omaha at the Woodstock for Capitalists. Finally, will Costco's move into the metals dealing business be a hit? We might get details on that later in May when the company issues its results.\n[1] Enphase Energy Reports Financial Results for the First Quarter of 2024, Enphase Energy, Inc., April 23, 2024, https://investor.enphase.com[2] JPMorgan CEO Dimon says US economy is booming, Reuters, Nupur Anand, April 23, 2024, https://www.reuters.com[3] Costco Wholesale Corporation Reports March Sales Results and Announces an Increase in Its Quarterly Cash Dividend, Costco Wholesale Corporation, April 10, 2024, https://investor.costco.com[4] Costco now sells up to $200 million a month in gold and silver, CBS News, Khristopher K. Brooks, April 10, 2024, https://www.cbsnews.com[5] Precious metals buyer cashes in on Costco's gold bar rush: 'I consider this savings', Fox Business, Madeline Coggins, April 13, 2024, https://www.foxbusiness.com\nCopyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-05-10T16:05:51.000Z",
        "Title": "Baby Berkshire Bombshell: What's Happening at Boston Omaha (and What It Means for Investors)",
        "Author": "  Jason Hall, The Motley Fool ",
        "Text": "In this video, Motley Fool contributor Jason Hall breaks down the sudden and unexpected departure from Boston Omaha (NYSE: BOC) of co-CEO (and great-nephew of Warren Buffett) Alex Rozek, how this changes the investing thesis, and what investors should be thinking right now.\n*Stock prices used were from the morning of May 10, 2024. The video was published on May 10, 2024.\nBefore you buy stock in Boston Omaha, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Boston Omaha wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $543,758!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 6, 2024\nJason Hall has positions in Boston Omaha. The Motley Fool has positions in and recommends Boston Omaha. The Motley Fool has a disclosure policy. Jason Hall is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\nBaby Berkshire Bombshell: What's Happening at Boston Omaha (and What It Means for Investors) was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-04T21:52:40.000Z",
        "Title": "Berkshire shareholders reject climate, diversity, China proposals",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Nebraska (Reuters) - Berkshire Hathaway Inc shareholders on Saturday overwhelmingly rejected six proposals addressing environmental and social policy issues at Warren Buffett's conglomerate, all of which the billionaire investor and his board opposed.\nBy margins of more than 4-to-1, shareholders at Berkshire's annual meeting voted against two proposals that the company's insurance and energy operations disclose more about their efforts to address climate change including greenhouse gas emissions.\nThey also turned down a proposal for more disclosure about efforts to promote diversity, equity and inclusion in the workplace.\nBy overwhelming majorities, shareholders voted against a separate environment-related proposal, creating a board-level committee to monitor safety at the BNSF railroad unit, and requiring Berkshire to report annually on how much its business operations depend on the \"hostile\" Chinese government.\nBerkshire invested in Chinese electric car company BYD in 2008, though it began reducing that stake in 2022.\nThe votes were not surprising because Buffett owns special shares that give him a 31% voting stake in Berkshire. That makes it difficult to adopt proposals Buffett opposes.\nBerkshire shareholders also reelected the company's 14-person board.\n(Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-06T19:31:55.000Z",
        "Title": "Warren Buffett says he was ‘100% responsible’ for Berkshire Hathaway’s bad bet on Paramount: ‘We lost quite a bit of money’",
        "Author": "  Marco Quiroz-Gutierrez ",
        "Text": "Warren Buffett made a bad call with Paramount and said he made sure Berkshire Hathaway got out before the stock fell more.\nAt Berkshire’s annual meeting on Saturday, 93-year-old CEO Buffett told shareholders that he was directly responsible for the company’s Paramount share purchases in 2022, but that the company had now changed course.\n“I was 100% responsible for the Paramount decision,” Buffett said. “It was 100% my decision, and we sold it all and we lost quite a bit of money, and that happens in this business, too.”\nBerkshire had already cut its holdings of the media company—which owns the film production company Paramount Pictures, broadcaster CBS, and the streaming service Paramount+—by a third from 93.7 million shares to 63.3 million shares that were worth about $930 million at the end of 2023.\nBuffett had previously been critical of streaming, saying in an April interview with CNBC that Paramount “isn’t fundamentally that good a business,” even as Berkshire was invested in the company. At the time, he was ambivalent, saying “we’ll see what happens.”\nThe company’s bum Paramount bet made Buffett think deeper about the industry, he told shareholders.\n“I certainly thought harder even about the whole question of what people do with their leisure time and what the governing principles are of running an entertainment business of any sort, whether it’s sports or movies or whatever it might be,” Buffett said.\nSeveral interested parties have targeted Paramount for acquisition, including Sony and private equity firm Apollo and David Ellison’s Skydance Media. On Sunday, Paramount officially opened negotiations with Sony and Apollo, the New York Times reported.\nBerkshire Hathaway reported a $12.7 billion profit for the first quarter, a drop from the $35.5 billion it netted in the same quarter a year prior. The decline was mostly due to a drop-off in the paper value of its holdings, and Buffett encouraged investors to look instead at the company’s operating earnings which exclude its investments. The company’s operating earnings skyrocketed 39% year-over-year, coming in at about $11.2 billion.\nThe annual meeting over the weekend was the first since Berkshire Vice Chairman Charlie Munger died in November at the age of 99. Buffett seemed reflective as he noted Munger’s absence, wrapping up the meeting with somber thoughts.\n“I not only hope you come next year. I hope I come next year,” he said.\nStill, when it comes to his stock bets, the legendary investor was just as keen as ever, and even at 93 years old, learning from his mistakes—the hard way.\n“I think I’m smarter now than I was a couple years ago,” Buffett said. “But I also think I’m poorer because I acquired the knowledge in the manner I did.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-05-16T19:20:48.000Z",
        "Title": "Bill Gates Sells Microsoft, Berkshire Hathaway Shares In Q1: Are These Still Top Positions?",
        "Author": "  Chris Katje ",
        "Text": "Billionaire Bill Gates is best known as the co-founder and former CEO of Microsoft Corp. (NASDAQ:MSFT). He is also known for his philanthropic efforts with the Bill and Melinda Gates Foundation Trust.\nThose two items collided in the first quarter with the sale of Microsoft stock. Here's what to know.\nWhat Happened: Gates stepped down as the CEO of Microsoft in 2000 and later left the board of directors in 2020.\nThe co-founder of the software giant remains a large shareholder in the company through his own holdings and the stock holdings of the Bill and Melinda Gates Foundation Trust.\nA new 13F filing for the Bill and Melinda Gates Foundation Trust reveals two key changes made in the first quarter.\nThe trust sold 1.7 million Microsoft shares and 2.6 million shares of Berkshire Hathaway Inc (NYSE:BRK). The trades lowered the weighting of these two stocks by 4.5% and 13.1%, respectively.\nAfter the sales, the top holdings of the trust are, with values from the end of the first quarter:\nMicrosoft: 33.5% of the portfolio, 36,499,597 shares, $15.4 billion\nWaste Management, Inc. (NYSE:WM): 16.4% of the portfolio, 35,234,344 shares, $7.5 billion\nBerkshire Hathaway: 15.9% of the portfolio, 17,303,097 shares, $7.3 billion\nWith the latest trades, Berkshire Hathaway moved from the second-place spot down to third place.\nRelated Link: Microsoft Q3 Earnings: Revenue Beat, EPS Beat, ‘New Era Of AI Transformation’ And More\nWhy It's Important: Gates owns Microsoft shares in his Cascade Investments vehicle and his personal holdings. The former CEO once owned 45% of the company when it went public in 1986.\nThe ownership stake has been reduced over the years by Gates and the foundation trust, which represents his philanthropic efforts.\nBerkshire Hathaway, led by Gates' friend Warren Buffett, has been a top investment of Gates and also sees shares donated by Buffett to the trust.\nThe latest moves in the first quarter come as it was recently announced that Gates' ex-wife Melinda French Gates is stepping down as the co-chair of the trust. French Gates will be leaving for her own philanthropic efforts with an added $12.5 billion commitment.\nThe former Microsoft CEO is listed as the fifth richest person on the Bloomberg Billionaires Index with a wealth of $154 billion, up $13.6 billion year-to-date.\nGates' sale of Microsoft stock comes as shares have soared in the last year thanks to new artificial intelligence initiatives and growth. Microsoft shares are up 37% over the last year.\nRead Next: How Bill Gates Almost Killed The Xbox: ‘This Is An Insult To Everything I’ve Done’ \nPhoto: Lev Radin via Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nMICROSOFT (MSFT): Free Stock Analysis Report\nThis article Bill Gates Sells Microsoft, Berkshire Hathaway Shares In Q1: Are These Still Top Positions? originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-05-04T22:29:37.000Z",
        "Title": "Why Warren Buffett's billions in cash at Berkshire Hathaway is a bearish stock market signal",
        "Author": " Seana Smith    · Host",
        "Text": "Queue the bears.\nBerkshire Hathaway's (BRK-A, BRK-B) cash pile hit another record high in the first quarter of $189 billion, the industrial giant said in its earnings release on Saturday.\nThat massive cash war chest will likely reach $200 billion by the end of the current quarter, Buffett told shareholders at a packed CHI Health Center today.\nSuch a hoard of greenbacks signals Buffett is “bearish” on the stock market right now, according to one veteran value investor.\n“Buffett is bearish on the stock market. He shows this by growing his massive cash position to $200 billion, selling Apple (AAPL) shares and saying that he doesn’t see bargains,” Smead Capital Management CIO and long-time Buffett watcher Bill Smead told me on the grounds of the Woodstock of Capitalism.\nBerkshire’s decision to reduce its stake in Apple and boost the company’s cash position is a move that Buffett says makes sense given the current macroeconomic environment.\n“I don’t think anyone sitting at this table has any idea how to use it effectively, and therefore we don’t use it,” Buffett said in response to a shareholder question of why Berkshire isn’t putting the cash reserve to work.\n“As the world gets more sophisticated, complicated and intertwined, more can go wrong” and you want to be able to “act when that happens,” Buffett added.\nThe bears have some meat to feast on, compliments of Buffett.\nBerkshire reduced its position in Apple by about 13% during the first three months of the year, marking the second quarter in a row that the conglomerate reduced its stake in the iPhone maker.\nAs of March 31, Apple accounted for about 40% of Berkshire’s vast stock portfolio, worth a total of $135.4 billion.\nBerkshire reduced its position in Apple as the tech giant has struggled in recent quarters and valuation on the stock remains elevated. The stock fell about 10% during the first three months of the year, weighing on Berkshire’s quarterly results.\nWhile some initially looked at Buffett’s decision to reduce the Apple stake as a sign that his stance on the tech beast has changed, one analyst told Yahoo Finance that \"taking a little off the top doesn’t hurt.\"\n\"This does not concern us all that much because Apple was such a large position in the 13-F portfolio at the end of 2023, so anything to lessen that exposure is good from a diversification perspective,\" Morningstar analyst Greggory Warren told me at the meeting.\nThe legendary investor was also quick to reassure shareholders as to his confidence in Apple.\n“At the end of the year, I would think it’s extremely likely that Apple is the largest common stock holding we have now,” Buffett told a packed house, which included Apple CEO Tim Cook.\nBuffett compared Apple to two of Berkshire’s most well-known, top holdings: Coca-Cola (KO) and American Express (AXP). While he called Coca-Cola and American Express “wonderful businesses,” he noted Apple was an “even better business.”\nWhile Buffett remains optimistic on Apple, the business does face short-term headwinds.\nWeakness in China has been front and center for Apple investors as it loses market share to domestic players. A more cautious US consumer hasn't aided investor sentiment, either.\n“It's easy to blame the overall consumer environment but there's also a market share dynamic that's occurring with Huawei and others becoming extremely competitive,” Ariel Investments emerging markets equities senior vice president Christine Phillpotts told me at Berkshire's annual meeting.\nIt’s a trend that Phillpotts says will likely accelerate as domestic players continue to “increase the value proposition.”\nApple shares have declined 4.8% since the start of the year despite coming AI announcements, far underperforming the S&P 500’s 8% gain.\nBuffett's cash hoard hints other stocks may follow Apple's lead lower as the year treks along.\nCurious on what Apple is up against in terms of AI competition? Yahoo Finance executive editor Brian Sozzi goes inside Amazon's AI plans with AWS CEO Adam Selipsky in a new episode of the Opening Bid podcast below.\nSeana Smith is an anchor at Yahoo Finance. Follow Smith on Twitter @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-05-15T10:15:00.000Z",
        "Title": "Should You Buy Berkshire Hathaway While It's Below $625,000?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) is a stock that most investors know about and that many would like to say they own. The problem is that buying a share of the conglomerate is rather costly, noting that the A share class has a 52-week high of around $647,000! With this stock now comfortably below $625,000, should you buy it? There are a few things to consider first.\nBerkshire Hathaway actually has two share classes, one with a price tag in the hundreds of thousands of dollars and the other with a more modest price in the hundreds. The more expensive shares can be converted into 1,500 of the less costly ones at the holder's option. Essentially, they both represent ownership in Berkshire Hathaway, just at different percentage levels. So, the first thing any investor needs to consider is which share class is more attractive.\nThe A and B shares generally trade in lockstep with each other, so the real question is how much money you have to spend. Most will probably want to opt for the B shares, given the lower price point. Berkshire Hathaway's B shares are currently trading at about $410 per share, down from their $52-week high of roughly $430.\nThe bigger question for most investors will be what they are buying when they add Berkshire Hathaway to their portfolio. This isn't as easy to discern as you might think. Although the company is usually lumped into the financial sector, its business goes well beyond that segment of the market.\nFor example, while Berkshire Hathaway owns the insurer GEICO, it also owns BNSF Railway, one of the largest train companies in North America. And it owns several regulated large utilities. And a number of midstream energy companies. These three businesses are so large that they get broken out as a separate item on Berkshire Hathaway's balance sheet. However, it also owns retail businesses, manufacturing operations, and chemical companies, among other things. Then there's the nearly $336 billion portfolio of stocks that Berkshire Hathaway owns.\nIn many ways, Berkshire Hathaway is more like a mutual fund than a company. That leads to two important concepts. First, you are really buying into the investment approach of Chief Executive Officer Warren Buffett. Second, even though there will be times when Berkshire Hathaway stock is out of favor, there's really no good or bad time to buy an investment approach. To sum up that approach, Buffett tends to buy historically well-run companies when they are out of favor, and then he holds on to them for the long term.\nIf that sounds like a good investment plan, then you might want to consider buying Berkshire Hathaway while it is trading below $625,000 per share (or around $415, in the case of the B shares). That said, the stock, despite the pullback from 52-week highs, is trading just a percentage point or two below its all-time highs. If you would rather wait for a lower price, 20% pullbacks aren't at all uncommon here.\nThe one thing you need to consider if you decide to try to time your entry point is that Berkshire Hathaway often pulls back sharply when the broader market is also pulling back sharply. So, it can be hard to pull the trigger if you don't make a specific plan to buy it ahead of time. Put another way, don't think you'll buy when the time is \"right\" because Berkshire Hathaway stock is likely to be most attractive while investors are selling stocks indiscriminately in a bear market. It's hard to be a contrarian when there's blood in the streets.\nIn some ways, there's really no good time to buy Berkshire Hathaway. When the stock is doing well, it might look expensive. When the stock is \"cheap,\" it will be hard to justify buying anything, let alone Berkshire Hathaway, because of a bear market. All in, if you want to buy Berkshire Hathaway you should probably just go ahead and start a position when you have the cash to do so. Over the long term, this unique stock has easily outdistanced the S&P 500 index because of the way the company is run, not because of any specific business within the company's highly diversified portfolio of investments (fully owned or partially owned). The one thing you do need to closely track, however, is that the investment approach doesn't change.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $553,880!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 13, 2024\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nShould You Buy Berkshire Hathaway While It's Below $625,000? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-05-04T21:52:40.000Z",
        "Title": "Berkshire shareholders reject climate, diversity, China proposals",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Nebraska (Reuters) - Berkshire Hathaway Inc shareholders on Saturday overwhelmingly rejected six proposals addressing environmental and social policy issues at Warren Buffett's conglomerate, all of which the billionaire investor and his board opposed.\nBy margins of more than 4-to-1, shareholders at Berkshire's annual meeting voted against two proposals that the company's insurance and energy operations disclose more about their efforts to address climate change including greenhouse gas emissions.\nThey also turned down a proposal for more disclosure about efforts to promote diversity, equity and inclusion in the workplace.\nBy overwhelming majorities, shareholders voted against a separate environment-related proposal, creating a board-level committee to monitor safety at the BNSF railroad unit, and requiring Berkshire to report annually on how much its business operations depend on the \"hostile\" Chinese government.\nBerkshire invested in Chinese electric car company BYD in 2008, though it began reducing that stake in 2022.\nThe votes were not surprising because Buffett owns special shares that give him a 31% voting stake in Berkshire. That makes it difficult to adopt proposals Buffett opposes.\nBerkshire shareholders also reelected the company's 14-person board.\n(Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-04T22:29:37.000Z",
        "Title": "Why Warren Buffett's billions in cash at Berkshire Hathaway is a bearish stock market signal",
        "Author": " Seana Smith    · Host",
        "Text": "Queue the bears.\nBerkshire Hathaway's (BRK-A, BRK-B) cash pile hit another record high in the first quarter of $189 billion, the industrial giant said in its earnings release on Saturday.\nThat massive cash war chest will likely reach $200 billion by the end of the current quarter, Buffett told shareholders at a packed CHI Health Center today.\nSuch a hoard of greenbacks signals Buffett is “bearish” on the stock market right now, according to one veteran value investor.\n“Buffett is bearish on the stock market. He shows this by growing his massive cash position to $200 billion, selling Apple (AAPL) shares and saying that he doesn’t see bargains,” Smead Capital Management CIO and long-time Buffett watcher Bill Smead told me on the grounds of the Woodstock of Capitalism.\nBerkshire’s decision to reduce its stake in Apple and boost the company’s cash position is a move that Buffett says makes sense given the current macroeconomic environment.\n“I don’t think anyone sitting at this table has any idea how to use it effectively, and therefore we don’t use it,” Buffett said in response to a shareholder question of why Berkshire isn’t putting the cash reserve to work.\n“As the world gets more sophisticated, complicated and intertwined, more can go wrong” and you want to be able to “act when that happens,” Buffett added.\nThe bears have some meat to feast on, compliments of Buffett.\nBerkshire reduced its position in Apple by about 13% during the first three months of the year, marking the second quarter in a row that the conglomerate reduced its stake in the iPhone maker.\nAs of March 31, Apple accounted for about 40% of Berkshire’s vast stock portfolio, worth a total of $135.4 billion.\nBerkshire reduced its position in Apple as the tech giant has struggled in recent quarters and valuation on the stock remains elevated. The stock fell about 10% during the first three months of the year, weighing on Berkshire’s quarterly results.\nWhile some initially looked at Buffett’s decision to reduce the Apple stake as a sign that his stance on the tech beast has changed, one analyst told Yahoo Finance that \"taking a little off the top doesn’t hurt.\"\n\"This does not concern us all that much because Apple was such a large position in the 13-F portfolio at the end of 2023, so anything to lessen that exposure is good from a diversification perspective,\" Morningstar analyst Greggory Warren told me at the meeting.\nThe legendary investor was also quick to reassure shareholders as to his confidence in Apple.\n“At the end of the year, I would think it’s extremely likely that Apple is the largest common stock holding we have now,” Buffett told a packed house, which included Apple CEO Tim Cook.\nBuffett compared Apple to two of Berkshire’s most well-known, top holdings: Coca-Cola (KO) and American Express (AXP). While he called Coca-Cola and American Express “wonderful businesses,” he noted Apple was an “even better business.”\nWhile Buffett remains optimistic on Apple, the business does face short-term headwinds.\nWeakness in China has been front and center for Apple investors as it loses market share to domestic players. A more cautious US consumer hasn't aided investor sentiment, either.\n“It's easy to blame the overall consumer environment but there's also a market share dynamic that's occurring with Huawei and others becoming extremely competitive,” Ariel Investments emerging markets equities senior vice president Christine Phillpotts told me at Berkshire's annual meeting.\nIt’s a trend that Phillpotts says will likely accelerate as domestic players continue to “increase the value proposition.”\nApple shares have declined 4.8% since the start of the year despite coming AI announcements, far underperforming the S&P 500’s 8% gain.\nBuffett's cash hoard hints other stocks may follow Apple's lead lower as the year treks along.\nCurious on what Apple is up against in terms of AI competition? Yahoo Finance executive editor Brian Sozzi goes inside Amazon's AI plans with AWS CEO Adam Selipsky in a new episode of the Opening Bid podcast below.\nSeana Smith is an anchor at Yahoo Finance. Follow Smith on Twitter @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-05-04T21:52:40.000Z",
        "Title": "Berkshire shareholders reject climate, diversity, China proposals",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\nOMAHA, Nebraska (Reuters) - Berkshire Hathaway Inc shareholders on Saturday overwhelmingly rejected six proposals addressing environmental and social policy issues at Warren Buffett's conglomerate, all of which the billionaire investor and his board opposed.\nBy margins of more than 4-to-1, shareholders at Berkshire's annual meeting voted against two proposals that the company's insurance and energy operations disclose more about their efforts to address climate change including greenhouse gas emissions.\nThey also turned down a proposal for more disclosure about efforts to promote diversity, equity and inclusion in the workplace.\nBy overwhelming majorities, shareholders voted against a separate environment-related proposal, creating a board-level committee to monitor safety at the BNSF railroad unit, and requiring Berkshire to report annually on how much its business operations depend on the \"hostile\" Chinese government.\nBerkshire invested in Chinese electric car company BYD in 2008, though it began reducing that stake in 2022.\nThe votes were not surprising because Buffett owns special shares that give him a 31% voting stake in Berkshire. That makes it difficult to adopt proposals Buffett opposes.\nBerkshire shareholders also reelected the company's 14-person board.\n(Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Cynthia Osterman)\n"
    },
    {
        "Date": "2024-05-07T12:00:00.000Z",
        "Title": "Berkshire Hathaway Stock vs SPY: Which Is Best?",
        "Author": "  Kent Thune ",
        "Text": "While investors have focused on high-flying Magnificent 7 stocks, Warren Buffett’s Berkshire Hathaway has quietly outperformed the SPDR S&P 500 ETF Trust (SPY), the stock market proxy and largest exchange-traded fund on the market.\nAs a conglomerate that owns shares of 41 publicly traded companies, Berkshire possesses multiple ETF qualities and makes for an interesting comparison to SPY and other ETFs tracking the S&P 500.\nIn this educational article, we break down the key similarities and differences between Berkshire Hathaway Stock and the SPY ETF.\nBerkshire Hathaway Inc. is a multinational holding company headquartered in Omaha, Nebraska. Led by co-founder, chairman and CEO Warren Buffett, Berkshire has built a reputation for successful value investing and long-term outperformance of the broader stock market, hence Buffett’s “Oracle of Omaha” nickname.\nHere's a breakdown of Berkshire Hathaway's key characteristics:\nFounded in 1839 as a textile manufacturer, it transformed into a conglomerate under Buffett's leadership in the 1960s.\nBerkshire Hathaway doesn't directly manufacture or sell products. Instead, it owns a diverse portfolio of subsidiaries and equity investments in various sectors.\nBerkshire Hathaway is known for its value investing philosophy, focusing on acquiring undervalued companies with strong long-term potential.\nFor companies it owns, Berkshire prioritizes financial strength, stable businesses, and excellent management, and it often holds its investments for long periods.\nBerkshire Hathaway owns a wide range of businesses, including insurance companies like its wholly owned subsidiary, GEICO, as well as utilities and railroads. Top stock holdings include Apple Inc., Amazon.com Inc., and American Express Co. \nBerkshire Hathaway has a long history of successful investment performance, generating significant returns for shareholders under Warren Buffett's leadership.\nFrom 1965 to 2022, Berkshire Hathaway stock averaged a 20% compound annual growth rate, which compares to 9.9% annualized return for the S&P 500 in that period, according to U.S. News.\nThe SPY ETF is the SPDR S&P 500 ETF Trust, the largest and one of the most widely traded exchange-traded funds in the world with over $500 billion in assets under management. It passively tracks the performance of the S&P 500 index, which represents the 500 largest publicly traded companies in the United States.\nSince SPY holds hundreds of companies, it offers instant diversification across different industries and sectors. This diversification helps mitigate risk compared to investing in individual stocks.\nCompared to actively managed funds, ETFs like SPY typically have lower expense ratios. The expense ratio covers the operational costs of the ETF. In the case of SPY, the expense ratio is around 0.095%, which translates to $9.50 per year for a $10,000 investment. Some S&P 500 ETFs have expense ratios as low as 0.03%.\nSPY is a highly liquid ETF, meaning you can easily buy and sell shares on a stock exchange throughout the trading day.\nSPY's performance is directly tied to the S&P 500 index. Historically, the S&P 500 has outperformed more than 80% of large-cap stock funds over the long term, but with periods of volatility.\nHere's a head-to-head comparison of Berkshire Hathaway (BRK.A & BRK.B) and the SPDR S&P 500 ETF Trust (SPY):\nFeature\nBerkshire Hathaway Stock\nSPDR S&P 500 ETF Trust (SPY)\nInvestment Style\nValue investing, actively managed\nGrowth/Value blend, passively managed\nDiversification\nConcentrated portfolio\nHighly diversified\nFees\nNo management fees\nLow expense ratio (0.095%)\nLiquidity\nBRK.A low, BRK.B more liquid\nHighly liquid\nPerformance\nHistorically outperformed S&P 500\nHistorically outperformed average large-cap fund\nValuation\n9.1 P/E ratio\n20.8 P/E ratio\nMarket Cap\n$870 billion\n$507 billion\nDividends\nDoes not pay dividends\nHas historically paid quarterly dividend\nData as of May 3, 2024, from Morningstar and Y Charts.\nBerkshire Hathaway: Focuses on value investing, selecting individual companies believed to be undervalued with strong long-term potential. Managed by Warren Buffett and his team, with a focus on long-term holding periods.\nSPY ETF: Passively tracks the S&P 500 index, providing exposure to the performance of the 500 largest U.S. publicly traded companies.\nBerkshire Hathaway: Owns a concentrated portfolio of approximately 40 wholly owned subsidiaries and significant equity investments in various sectors. While diverse, it's not as diversified as an S&P 500 ETF.\nSPY ETF: Provides instant diversification across 500 companies in various sectors of the US economy. Since it’s cap-weighted, the heaviest allocations lean toward mega-cap tech stocks like Apple, Microsoft Corp., and Nvidia Corp.\nBerkshire Hathaway: Doesn't charge management fees.\nSPDR ETF: Has a low expense ratio of 0.09%, which covers the costs of managing the ETF. Other S&P 500 ETFs, such as the iShares S&P 500 Index (IVV) and Vanguard S&P 500 ETF (VOO), have lower expense ratios at 0.03%.\nBerkshire Hathaway: BRK.A shares are very expensive at over $600,000 per share, making them less accessible to many investors. BRK.B shares are more affordable at just above $400 per share but have limited voting rights.\nSPY ETF: Highly liquid with tight bid-ask spreads for easy buying and selling.\nBerkshire Hathaway: Has historically outperformed the S&P 500 over the long term under Warren Buffett's leadership. However, past performance doesn't guarantee future results.\nSPY ETF: Reflects the historical performance of the S&P 500 index, which has generated consistent growth and outperformed more than 80% of professional money managers in the long term, albeit with periods of volatility.\nBerkshire Hathaway: The company’s price-earnings ratio was 9.1, as of May 6, 2024, according to Y Charts.\nSPY ETF: The average holding P/E ratio for SPY was 20.8, as of May 2, 2024, according to Morningstar.\nInvestors who have faith in Warren Buffett's investment philosophy and are comfortable with a concentrated holding, Berkshire Hathaway might be an option. However, due to the high price of BRK.A shares, BRK.B might be more accessible for some investors, though they come with limited voting rights.\nInvestors preferring a diversified, low-cost approach that tracks the overall market, SPY is a suitable choice. In addition, SPY offers potential dividend income while Berkshire Hathaway doesn't pay dividends.\nBefore buying shares of either investment, investors should their investment goals, time horizon, and risk tolerance.\n\nPermalink | © Copyright 2024 etf.com. All rights reserved\n"
    }
]