[
    {
        "Date": "2024-06-29T22:26:00.000Z",
        "Title": "Where Will Berkshire Hathaway Be in 10 Years?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock has been a terrific investment for patient shareholders. Since 1965, shares have risen in value by nearly 4,000,000%.\nBut what does the future look like for this iconic company? The answer might surprise you.\nWarren Buffett's claim to fame is that he has been able to consistently beat the market for far longer than nearly anyone else. That's an incredibly difficult feat to pull off. Over the past 20 years, around 95% of funds failed to beat their index. Buffett, meanwhile, has trounced the index. Since inception, shares of Berkshire Hathaway have averaged annual returns of around 20%, roughly double the rate of the S&P 500 over the same time period.\nThere's only one problem: Berkshire's returns have slowed heavily in recent years. Over the past decade, for instance, Berkshire stock underperformed the market by around 2%. This is a rare occurrence, but it makes sense given the company's circumstances. In the 1980s, for instance, Berkshire stock regularly rose more than 30% in value in a single year. In 1985, it nearly doubled in value. Over the last decade, however, it failed to achieve annual returns of 30% or more even once. The issue isn't poor investing, but that the game has grown significantly more difficult.\nIn 1999, Buffett joked that he could post 50% annual returns if he managed only $1 million. \"It's a huge structural advantage not to have a lot of money,\" he explained. \"I think I could make you 50% a year on $1 million. No, I know I could. I guarantee that.\"\nToday, Berkshire's cash pile alone is worth around $189 billion. Its total market cap is around $900 billion. For the stock to rise 10%, the company would need to add another $90 billion in value. To put that into perspective, around 400 of the companies in the S&P 500 have market caps under $90 billion. To add another 10% to its stock price, Berkshire essentially needs to create enough value that would, on its own, be one of the top 100 most valuable companies in America. Then it needs to replicate this feat again the following year to an even larger degree.\nWhatever happens to Berkshire over the next decade, one thing is clear: Its returns likely won't match anything it has achieved in previous decades. The company is simply too big to keep doubling in size at the rate it's used to. \"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others,\" Buffett wrote in a recent shareholder letter. \"All in all, we have no possibility of eye-popping performance.\"\nThe second thing to expect is for Berkshire to increasingly be run by people other than Buffett, who will turn 94 this summer. Already, Buffett has handed over large sections of the portfolio to trusted lieutenants, including Todd Combs and Ted Weschler. It has been reported that one of these men initiated Berkshire's $189 billion bet on Apple, one of the largest and most successful Berkshire investments in recent history.\nFor his part, Buffett isn't worried about the transition. He's had succession plans in place for some time, and his recent letter shows confidence that these patient personnel investments will pay off. \"By both luck and pluck, a few huge winners have emerged from a great many dozens of decisions,\" Buffett wrote. \"And we now have a small cadre of longtime managers who never muse about going elsewhere and who regard 65 as just another birthday.\"\nWhere will Berkshire be ten years from now? Trusted lieutenants including Combs and Weschler have already been with the company for years. Guided by their experience and acumen, expect Berkshire's current portfolio of public and private business to do well. But it will be harder than ever for the company to beat the market by any significant margin. This is still a wonderful business to bet on, but the decade ahead will likely be characterized by slow and steady moves that focus more on patient asset allocation than superstar bets.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $757,001!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 24, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWhere Will Berkshire Hathaway Be in 10 Years? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-04T12:15:00.000Z",
        "Title": "Can Berkshire Hathaway Stock Keep Outpacing the S&P 500?",
        "Author": "  George Budwell, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) CEO Warren Buffett is widely considered a legend on Wall Street, and for good reason. The conglomerate's portfolio has substantially outperformed the benchmark S&P 500 since Buffett became CEO in 1965.\nThe graph below illustrates this point:\nMoreover, Buffett's investing methodology runs counter to modern portfolio theory and the efficient markets hypothesis.\nModern portfolio theory advocates for diversification as a risk-management strategy. According to this theory, spreading investments across various assets reduces risk, thereby increasing the probability of generating positive annual returns.\nHowever, Buffett's approach is anything but diversified. Berkshire Hathaway's portfolio is concentrated, with approximately 50 stocks in its holdings at the time of this writing.\nMoreover, a select few equities such as Apple (NASDAQ: AAPL), Bank of America (NYSE: BAC), American Express (NYSE: AXP), Chevron (NYSE: CVX), Coca-Cola (NYSE: KO), and Occidental Petroleum (NYSE: OXY) account for a staggering 76.6% of the conglomerate's stock investments.\nBy contrast, most of Buffett's money manager contemporaries have typically crafted portfolios consisting of hundreds -- and sometimes thousands -- of equities, in line with the main tenet of modern portfolio theory.\nBuffett and his team have also overcome the potentially disadvantageous effects stemming from the legal requirement to disclose their quarterly buys and sells. The efficient market hypothesis suggests that such disclosures should nullify Buffett's edge by allowing other investors to mimic his portfolio.\nSurprisingly, this constraint hasn't significantly impacted the company's ability to deliver excess returns relative to the broader market.\nIn 2024, for instance, Berkshire Hathaway's shares have outperformed the sizzling S&P 500, and historically, the company has delivered returns in excess of the broader market by around 8 percentage points per year.\nWhen considering the likelihood of Berkshire Hathaway's stock outperforming the S&P 500, it's essential to analyze the company's principal stock holdings and key economic metrics, and then compare these with the benchmark index.\nThe six largest stock holdings in Berkshire's portfolio have an average forward price-to-earnings (P/E) ratio of 18.3 and anticipated earnings growth of 12.4% by 2025 (see table below).\nStock\nForward P/E Ratio\nProjected 2025 Earnings Growth\nApple\n29.9\n9.7%\nBank of America\n12.3\n9.6%\nAmerican Express\n18.6\n14.9%\nCoca-Cola\n22.3\n6.9%\nChevron\n12.5\n10.3%\nOccidental Petroleum\n14.5\n23.1%\n \n \n \nAverage\n18.3\n12.4%\nData source: Yahoo! Finance.\nIn contrast, the S&P 500 index is trading at a higher forward P/E ratio of 21.1, with an expected average earnings growth rate of 14.2% for the same period, according to FactSet analysts.\nAlthough Berkshire Hathaway's core stock holdings are relatively more affordable, they are projected to have a marginally lower earnings growth rate.\nTurning to Berkshire Hathaway stock itself, the company's shares are trading at a forward P/E ratio of 18.8 and are predicted to have earnings growth of 2.4% for the following year.\nThis significantly lower earnings growth rate suggests that Berkshire Hathaway's stock may not be well positioned to outperform the S&P 500 in the short term.\nStill, a deeper analysis is ultimately required to answer the original question, because Berkshire Hathaway isn't a typical stock.\nBuffett and his team have amassed a diverse portfolio of assets, including stocks, bonds, businesses, and a substantial cash reserve. This multifaceted approach sets it apart from most other companies.\nWhat does this all mean in practical terms? Due to its diverse asset portfolio, Wall Street regards Berkshire Hathaway as an exceptional hedge against broad market downturns.\nUnlike the S&P 500, which lacks built-in downside protection, Berkshire Hathaway's strategic composition provides a safety net during turbulent times.\nNow, let's explore why this distinction matters. The S&P 500's recent bull market surge owes much to the enthusiasm surrounding artificial intelligence (AI). Notably, Nvidia (NASDAQ: NVDA) -- the chipmaker at the forefront of the AI revolution -- holds the second-largest weight within the S&P 500. Consistently surpassing Wall Street's earnings expectations, Nvidia has become a linchpin for the index's performance lately.\nHowever, here's the crux: If Nvidia encounters any obstacles, ripple effects could reverberate throughout the entire U.S. stock market. In contrast, Berkshire Hathaway maintains limited exposure to this AI-centric theme. Its substantial focus lies in sectors such as finance, energy, and consumer goods, shielding it to a degree from the hype surrounding AI.\nAlthough Apple is Berkshire Hathaway's largest holding by a country mile, the tech giant doesn't rely on AI to fuel sales. Instead, Apple leverages its loyal customer base to drive sales of its iconic iPhone. Berkshire Hathaway, in turn, isn't overly reliant on AI to drive its share-price performance, counter to the broader market.\nBerkshire Hathaway's ability to outperform the S&P 500 in the short term hinges on Nvidia's trajectory. Should Nvidia continue to exceed Wall Street's estimates by a wide margin, Buffett's conglomerate is unlikely to best the S&P 500 over the next 18 months.\nHowever, a more profound concern looms: The S&P 500 appears markedly overvalued based on its cyclically adjusted price-to-earnings ratio. Furthermore, its bull run appears overly reliant on a single stock.\nPerhaps most concerning is that Nvidia's shares are trading at over 42 times forward earnings. This premium valuation may be warranted, but it also suggests that a fair amount of the chipmaker's near-term upside is already accounted for, curtailing its power to drive the S&P 500 much higher.\nIf investors balk at paying this hefty premium for Nvidia, Berkshire Hathaway should deliver superior results relative to the benchmark index over the next 18 months.\nIn other words, Nvidia stock may lose momentum as investors search for more attractive growth vehicles. This dynamic that favors companies like Berkshire Hathaway -- namely, ones that aren't entirely dependent on AI to create shareholder value.\nBerkshire Hathaway, despite its unfavorable econometrics relative to the S&P 500, could thus deliver strong returns for shareholders over the remainder of 2024 and the whole of 2025 if this scenario plays out.\nThat's a testament to Buffett's slow-and-steady approach to value creation, which has consistently beaten the broader markets over the past seven decades and counting.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $671,728!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. George Budwell has positions in Apple. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, and Nvidia. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nCan Berkshire Hathaway Stock Keep Outpacing the S&P 500? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-01T12:01:00.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Has Spent $77.5 Billion Buying This Stock Since 2018",
        "Author": "  Anthony Di Pizio, The Motley Fool ",
        "Text": "Warren Buffett is the head of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B). Since 1965, he has steered the investment company to a mind-boggling return of 4,384,748%, which could have turned $1,000 into more than $43 million. By comparison, the same investment in the S&P 500 would have returned just $312,230 over the same period.\nBerkshire wholly owns a number of private companies, like GEICO, Dairy Queen, and Duracell. But it also manages a portfolio of 47 publicly-listed stocks and securities worth $372.3 billion, which includes holdings in Apple, Coca-Cola, and Bank of America.\nBerkshire spent approximately $38 billion accumulating shares of Apple since 2016. It has sold some along the way, but its holding is now worth a whopping $150.2 billion, representing 40.3% of the conglomerate's portfolio. It's Berkshire's largest position by a wide margin.\nHowever, it spent almost twice as much -- $75 billion -- buying shares of another company between 2018 and 2023: Berkshire Hathaway.\nStock buybacks are a popular way for companies to return capital to shareholders. Berkshire was sitting on a $189 billion cash pile as of Mar. 31, and it's not easy for a company this size to find quality investments large enough to move the needle. As a result, Buffett has opted to spend some of it on buybacks.\nBerkshire spent a further $2.6 billion buying back stock during the first quarter of 2024, bringing the total to $77.5 billion since 2018. And it will probably continue to repurchase shares for the foreseeable future.\nYou might say Buffett is betting billions of dollars on himself. With his stellar 58-year track record, why wouldn't he?\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $677,040!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of May 28, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWarren Buffett's Berkshire Hathaway Has Spent $77.5 Billion Buying This Stock Since 2018 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-26T12:00:23.000Z",
        "Title": "Berkshire Hathaway Inc. (NYSE:BRK.A) is largely controlled by institutional shareholders who own 55% of the company",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Given the large stake in the stock by institutions, Berkshire Hathaway's stock price might be vulnerable to their trading decisions\nA total of 25 investors have a majority stake in the company with 50% ownership\n Insider ownership in Berkshire Hathaway is 15%\nEvery investor in Berkshire Hathaway Inc. (NYSE:BRK.A) should be aware of the most powerful shareholder groups. We can see that institutions own the lion's share in the company with 55% ownership. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nSince institutional have access to huge amounts of capital, their market moves tend to receive a lot of scrutiny by retail or individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future.\nIn the chart below, we zoom in on the different ownership groups of Berkshire Hathaway.\n View our latest analysis for Berkshire Hathaway \nMany institutions measure their performance against an index that approximates the local market. So they usually pay more attention to companies that are included in major indices.\nBerkshire Hathaway already has institutions on the share registry. Indeed, they own a respectable stake in the company. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Berkshire Hathaway, (below). Of course, keep in mind that there are other factors to consider, too.\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. Berkshire Hathaway is not owned by hedge funds. With a 15% stake, CEO Warren Buffett is the largest shareholder. The Vanguard Group, Inc. is the second largest shareholder owning 6.9% of common stock, and BlackRock, Inc. holds about 5.1% of the company stock.\nOur studies suggest that the top 25 shareholders collectively control less than half of the company's shares, meaning that the company's shares are widely disseminated and there is no dominant shareholder.\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. There is a little analyst coverage of the stock, but not much. So there is room for it to gain more coverage.\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. Company management run the business, but the CEO will answer to the board, even if he or she is a member of it.\nMost consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group.\nOur most recent data indicates that insiders own a reasonable proportion of Berkshire Hathaway Inc.. Insiders own US$138b worth of shares in the US$894b company. That's quite meaningful. It is good to see this level of investment. You can check here to see if those insiders have been buying recently. \nThe general public-- including retail investors -- own 29% stake in the company, and hence can't easily be ignored. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\nIt's always worth thinking about the different groups who own shares in a company. But to understand Berkshire Hathaway better, we need to consider many other factors. For example, we've discovered 1 warning sign for Berkshire Hathaway that you should be aware of before investing here.\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this free report on analyst forecasts.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n"
    },
    {
        "Date": "2024-06-04T20:27:15.000Z",
        "Title": "Traders who scooped up Warren Buffett’s Berkshire Hathaway shares at a massive $620,000 discount during glitch will have their deals canceled by the NYSE",
        "Author": "  Eleanor Pringle ",
        "Text": "Investors who purchased shares in Warren Buffett's Berkshire Hathaway yesterday at a huge discount will see their trades canceled following a technical issue on the stock exchange.\nOn June 3, a data glitch led the global conglomerate's stock price to fall to $185 a share, having previously closed at over $620,000. The drop meant a more than 99% discount on the Warren Buffett-led company.\nThis means a trader who snapped up just $925 worth of the stock at the rock-bottom price would now see their investment worth over $3 million today.\nWhile it hasn't been confirmed how many people purchased the Class A stock during the technical error—which lasted for around an hour and a half—the New York Stock Exchange (NYSE) has swiftly undone their trades.\nIn an update posted at 9 p.m. last night, NYSE said it would \"bust\" all the \"erroneous\" trades of Berkshire Hathaway stock at or below $603,718.30 a share.\nThe issue, the exchange added, is related to a problem at the Consolidated Tape Association (CTA), which provides real-time information about quotes and trades on the exchange. The CTA oversees part of the Securities Information Processor (SIP) which consolidates all protected bid/ask quotes and trades into a single data stream.\nThe CTA said it experienced problems with price banding which \"may have been related to a new software release\" on SIP. As a result the CTA has reverted to the previous version of the software. The CTA did not immediately respond to Fortune's request for comment.\nDuring the blip, the NYSE placed halts on certain trades, and will seek to determine which are erroneous and thus eligible to be canceled. The technical issue has now been resolved, it added, with all tickers trading as normal.\nTraders who didn't hop on a discounted Berkshire Hathaway stock but did buy heavily discounted shares in other brands will also be subject to having their trades struck off—with the ruling not eligible for appeal.\nOther tickers that were impacted include American restaurant chain Chipotle (CMG), mining company Barrack Gold Corporation (GOLD) and meme stock darling GameStop (GME). \nFor Berkshire Hathaway, the good news is that its Class B Stock (BRK.B) was not impacted by the ticker problem, and its Class A stock closed at more than $631,000 a share.\nBerkshire Hathaway did not immediately respond to Fortune's request for comment.\nThe Berkshire Hathaway mega-bargain is one of many hiccups experienced by various international stock exchanges—and is unlikely to be the last.\nJust last week, live data from the S&P 500 and the Dow Jones Industrial Average disappeared from traders screens for around an hour, the Financial Times reported. The system then returned to normal but the cause of the outage is being investigated.\nWhile the NYSE issue has been fixed with limited fallout, the same couldn't be said for a LSE incident that has cost Wall Street giant Citigroup tens of millions. \nIn May 2022, a London trader bypassed hundreds of warning notifications to create a basket worth $444 billion.\nWhile $255 billion was blocked from trading by Citi's internal management systems, a basket worth $189 billion was still released to the global markets.\nA total of $1.4 billion of equities were sold across various European exchanges before the trader canceled the order. Citi was fined a near-$70 million by the UK's Financial Conduct Authority for the oversight and related matters.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-06-28T10:59:00.000Z",
        "Title": "Berkshire Hathaway Inc. News Release",
        "Author": "Business Wire ",
        "Text": "OMAHA, Neb., June 28, 2024--(BUSINESS WIRE)--(BRK.A; BRK.B) – Today, Warren E. Buffett will convert 8,674 A shares into 13,011,000 B shares in order to donate 13,008,758 shares of Berkshire Hathaway \"B\" stock to five foundations: 9,930,357 to the Bill & Melinda Gates Foundation Trust, 993,035 shares to the Susan Thompson Buffett Foundation and 695,122 shares to each of the Sherwood Foundation, Howard G. Buffett Foundation and NoVo Foundation. The donations will be delivered today.\nMr. Buffett’s ownership of Berkshire now consists of 207,963 A shares and 2,586 B shares.\n* * * * * * * * * * * *\nMr. Buffett’s comments follow:\n\"The mathematics of the lifetime commitments to the five foundations are interesting. The schedule for annual grants was made on June 26, 2006, and has since been supplemented by significant grants to four of the five recipients. When originally made, I owned 474,998 Berkshire A shares worth about $43 billion and those shares represented more than 98% of my net worth. I have converted A shares into B shares before making contributions.\nDuring the following 18 years, I have neither bought nor sold any A or B shares nor do I intend to do so. The five foundations have received Berkshire B shares with a value when received of about $55 billion, substantially more than my entire net worth in 2006. I have no debts and my remaining A shares are worth about $127 billion, roughly 99½% of my net worth.\nNothing extraordinary has occurred at Berkshire; a very long runway, simple but generally sound capital deployment, the American tailwind and compounding effects produced my current wealth. My will provides that more than 99% of my estate is destined for philanthropic usage.\nThe lifetime commitments expire upon my death or at an earlier time if certain conditions set forth in the 2006 letter occur. All of these conditions continue to be met.\nMy November 21, 2023 letter set forth procedures of my will that are unlikely to be changed before my death. My then-current will becomes public upon my death.\"\nAbout Berkshire\nBerkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, utilities and energy, freight rail transportation, manufacturing, retailing and services. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240628425257/en/\nContacts\nMarc D. Hamburg402-346-1400\n"
    },
    {
        "Date": "2024-06-06T09:44:00.000Z",
        "Title": "4 Incredible Stocks Berkshire Hathaway Has Held for 13 Years or More",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Warren Buffett is a legend on Wall Street. Since becoming CEO of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) in 1965, Buffett turned a failing textile business into one of the largest companies in the world today. His company has averaged 20% annualized returns since then, crushing the S&P 500's performance over the same period.\nOne key to Buffett's long-term success is his buy-and-hold approach to investing. He focuses on buying and holding high-quality businesses for a long time, ignoring short-term market fluctuations and allowing winning investments to compound over time. Here are four incredible stocks that Berkshire Hathaway has continuously held for 13 years or more.\nCompanies with strong brands tend to have good customer loyalty and the advantage of name recognition as compared to peers. American Express (NYSE: AXP) has one of the strongest brands, and when current CEO Stephen Squeri took over, Buffett told him, \"The most important thing about American Express is the brand and the customers that aspire to be associated with the brand.\"\nAmerican Express attracts many customers, but its focus on high-earning, high-spending customers makes it stand out.\nThe coveted Black Card is American Express' luxury spending card and reportedly requires between $500,000 to $1 million in annual spending to be invited. Meanwhile, its Platinum Card commands a $695 annual fee and appeals to high-spending consumers with expensive tastes. It offers perks and rewards from high-end travel providers, luxury hotels, airlines, and high-end clothing lines.\nAmerican Express' strong brand is why it can command higher processing fees than competitors. The company also earns fees from interest income for credit card loans its customers take out. In the first quarter, the company raked in $3.8 billion in net interest income, up 26% from the year before.\nMoody's (NYSE: MCO) is one of the largest credit rating agencies in the world, with a distinct competitive advantage of its own. It's the second-largest credit-rating agency in the U.S., holding a sizable 32% share of the total market. Only S&P Global's 50% share is larger.\nIt's difficult for new competitors to enter the credit-rating space. It takes companies time to build up a reputation as a trusted resource for assessing the creditworthiness of bonds and other instruments. Despite credit-rating agencies' role in the 2007-08 financial crisis, they've maintained their stronghold on the market as investors and large institutions are hesitant to trust newcomers.\nMoody's is a play on the U.S. economy and, more specifically, corporate debt issuance. In recent years, the company has struggled with low issuance volumes, especially from corporate borrowers. As a result, its adjusted operating revenue from its Moody's Investors Servies (MIS) segment fell 33% over two years.\nThis slowdown over the past few years has led to pent-up demand for debt issuance. The first quarter showed green shoots of potential new growth as issuance volumes rose and its MIS segment operating income grew 51%.\nVisa (NYSE: V) and Mastercard (NYSE: MA) are two businesses with incredible network effects, giving them a robust competitive advantage in the payments space. A couple of years ago, the two companies combined for $22.2 trillion in total volume through their networks, trouncing the next closest competitor, American Express, which had $1.5 trillion in total volume.\nTheir pivotal roles in the payments industry make Visa and Mastercard compelling investments. The two companies essentially hold a duopoly over competitors as the de facto card issuers that banks turn to.\nAs a result, they have incredible profit margins and cash flow. In the last year, Visa's free cash flow was $19.7 billion, with a profit margin of 54%, while Mastercard's free cash flow was $10.6 billion, with a profit margin of 46%.\nAccording to Allied Market Research, the global credit card payments market is projected to grow 8.8% annually through 2032. With their outsized role in the payments industry, Visa's and Mastercard's robust payment networks have them well-positioned for future growth.\nBefore you buy stock in American Express, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and American Express wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $713,416!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Courtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway, Mastercard, Moody's, S&P Global, and Visa. The Motley Fool recommends the following options: long January 2025 $370 calls on Mastercard and short January 2025 $380 calls on Mastercard. The Motley Fool has a disclosure policy.\n4 Incredible Stocks Berkshire Hathaway Has Held for 13 Years or More was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-26T13:00:16.000Z",
        "Title": "Here is What to Know Beyond Why Berkshire Hathaway Inc. (BRK.B) is a Trending Stock",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nShares of this company have returned +1.8% over the past month versus the Zacks S&P 500 composite's +3.2% change. The Zacks Insurance - Property and Casualty industry, to which Berkshire Hathaway B belongs, has gained 0.5% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nBerkshire Hathaway B is expected to post earnings of $5.10 per share for the current quarter, representing a year-over-year change of +10.4%. Over the last 30 days, the Zacks Consensus Estimate remained unchanged.\nFor the current fiscal year, the consensus earnings estimate of $18.71 points to a change of +8.9% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $19.61 indicates a change of +4.8% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -1.3%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Berkshire Hathaway B.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of Berkshire Hathaway B, the consensus sales estimate of $97.31 billion for the current quarter points to a year-over-year change of +5.2%. The $368.44 billion and $374.39 billion estimates for the current and next fiscal years indicate changes of +1.1% and +1.6%, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-06T10:11:00.000Z",
        "Title": "If You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today",
        "Author": "  Matt Frankel, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) is well-known for delivering incredible returns for investors in the 60 years since Warren Buffett took control of the company -- and for good reason. Since Buffett took over in 1964, Berkshire has delivered an unbelievable 4,384,748% total return for investors.\nThink about that for a minute. This means that a $10,000 investment in Berkshire at that time would be worth $438 million today. For comparison, a $10,000 investment in the S&P 500 over the same period would be worth $3.1 million -- still a respectable return, but not in the same ballpark.\nThat massive total-return figure makes an excellent statistic for writers like me to use. But the reality is that even most of the long-term investors reading this don't have a 60-year time horizon in mind. And let's face it -- very few people would have been interested in Berkshire Hathaway at the time (it was little more than a struggling textile company).\nWith that in mind, let's look at a more conceivable long-term investment time horizon -- 30 years. Let's say that you invested $1,000 in Berkshire Hathaway 30 years ago. At that point (1994), Warren Buffett had been in charge for four decades and Berkshire was already a massive success story.\nHowever, Berkshire has continued to deliver market-beating performance. A $10,000 investment 30 years ago in Berkshire Hathaway would be worth $377,000 today. That's a 12.8% annualized return -- still well above the long-term average of the S&P 500.\nThe point is that thinking you're \"late\" to an investment that has been a winner for decades is a faulty mindset. In simple terms, winners keep on winning. And Berkshire Hathaway is a great example of that.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $713,416!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nMatt Frankel has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIf You'd Invested $10,000 in Berkshire Hathaway Stock 30 Years Ago, Here's How Much You'd Have Today was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-24T14:11:30.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 400 million shares of The Coca-Cola Company (NYSE:KO) stock, which is roughly 9.3% of the company. And it's a significant stake for Berkshire, representing approximately 6.5% of its portfolio.\nCoca-Cola is one of the world's leading beverage companies and it currently rewards its shareholders with a quarterly dividend of $0.485 per share, equating to an annual dividend of $1.94 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk has reportedly bought 6,000 acres of land just outside of this city. Here’s how to invest in its growth before he floods it with new tech workers.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of Coca-Cola: 400,000,000\nCoca-Cola annual dividend per share: $1.94\nTotal Annual Dividend = 400,000,000 x 1.94\nResult: $776,000,000\nBerkshire Hathaway will receive $776 million in dividends from Coca-Cola this year based on its current dividend rate. This equates to $194 million quarterly, or about $2.13 million daily.\nThe income Berkshire earns from Coca-Cola aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Coca-Cola has raised its annual dividend payment for 62 consecutive years, so Berkshire's annual income will likely grow in the years ahead.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nCOCA-COLA (KO): Free Stock Analysis Report\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-18T16:54:16.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway buys more Occidental Petroleum stock",
        "Author": " Ines Ferré    · Senior Business Reporter",
        "Text": "Warren Buffett's Berkshire Hathaway (BRK-A, BRK-B) scooped up more shares of the billionaire's favorite oil and gas producer, Occidental Petroleum (OXY), increasing its stake to nearly 29% of the company.\nBuffett has said Berkshire has no interest in buying control of Occidental, but the conglomerate has been a repeat dip buyer of the Houston-based company as the stock sits roughly 12% off its April peak. Prior to the Monday filing, Berkshire disclosed the purchase of 7.3 million shares.\nOccidental stock gained more than 1% on Tuesday to trade above the $61 level.\n“Mr. Buffett appears to step in and buy more OXY shares whenever the share price falls near or below $60. This bid sure appears to have set a floor on the share price,” James Shanahan, senior equity research analyst at Edward Jones, told Yahoo Finance.\nShanahan notes Berkshire’s $15.4 billion position makes Occidental its sixth-largest stock holding. The company’s top holding is Apple (AAPL), which currently sits at roughly 20% of Berkshire's market cap, after Berkshire trimmed its position in the iPhone maker in May.\nBerkshire is still highly involved in energy plays, as Chevron (CVX) remains a top-five holding despite the company selling some of its position as recently as March.\n“Together with the preferred share investment in OXY, Berkshire's bet on oil is almost $43 billion. Interestingly, this total has been $41-51 billion at the end of each quarter dating back to March 2022, which was the quarter when Berkshire began to buy OXY,” said Shanahan.\nBuffett has been a vocal backer of Occidental Petroleum, publicly praising the company’s CEO Vicki Hollub. He was also instrumental in helping finance Occidental’s acquisition of Anadarko Petroleum in 2019.\nIn December, Occidental announced it would buy Midland, Texas-based CrownRock for $12 billion, the latest in a string of industry consolidation moves across the Permian Basin.\nIn a vote of confidence, Berkshire Hathaway purchased nearly $600 million worth of OXY shares within a three-day span following the acquisition announcement.\nOccidental recently put some of its assets up for sale in order to purchase the privately held oil and gas producer.\nIn May, Hollub told Yahoo Finance the company would taper stock buybacks for the next couple of years as it focuses on reducing its debt.\n“We’ve had a very healthy repurchase program over the last couple of years because of the fact that our stock right now is very undervalued, in our view,” said Hollub.\nLast year, Occidental paid out $600 million in dividends, repurchased $1.8 billion of common shares, and redeemed $1.5 billion of preferred shares.\nThe stock declined 5% in 2023 after skyrocketing 119% in the prior year when oil peaked, making it the best-performing equity of the S&P 500 (^GSPC) that year.\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on Twitter at @ines_ferre.\n"
    },
    {
        "Date": "2024-06-03T19:17:18.000Z",
        "Title": "Berkshire Hathaway stock appears to drop 99.9% after NYSE technical glitch",
        "Author": " Ines Ferré    · Senior Business Reporter",
        "Text": "A technical glitch on the New York Stock Exchange shortly after the market open on Monday temporarily showed incorrect stock prices or volatility halts on several stocks, most notably a 99.9% drop in the price of Warren Buffett's Berkshire Hathaway (BRK-A) A-shares.\nBerkshire Hathaway (BRK-B) B-shares, which trade at 1/1,500th the price of the A-shares, were down as much as 1.1% on Monday and appeared largely unaffected by the error, though volatility was pronounced in both issues as A-shares reopened for trading near 11:35 a.m. ET.\nA NYSE spokesperson later said \"a technical issue involving industry-wide price bands published by the Consolidated Tape Association’s Securities Information Processor triggered “limit-up/limit down” trading halts on up to 40 symbols listed on NYSE Group exchanges.\nPrice bands on securities prevent outsized volatility or extreme movements. The spokesperson said shortly before noon, the issue was resolved and trading in the impacted stocks resumed.\nChipotle (CMG) stock was temporarily halted for volatility about 14 minutes after the market opened, even though the stock was down only 1.2%.\nOther stocks which were impacted include Abbot Laboratories (ABT), Barrick Gold (GOLD), GameStop (GME), AMC (AMC), and Bank of Montreal (BMO).\nMonday's technical glitch comes days after the disappearance of live calculations for the S&P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) for about an hour.\nAbout a week ago, the NYSE began settling stocks in one business day to comply with a new rule from the Securities and Exchange Commission, with the time between a trade and settlement decreased from two days to one day.\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on X at @ines_ferre.\n"
    },
    {
        "Date": "2024-06-17T14:15:11.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Disclosed A Major Stake In Chubb — Valuing $6.7 billion",
        "Author": "  Jason Collins ",
        "Text": "The long-awaited stock-related mystery has been revealed. American business owner and philanthropist Warren Buffett has finally unveiled his business's significant stake in a well-known insurance company. Here's all you need to know about Berkshire Hathaway's mystery stake.\nDon't Miss:\nAre you rich? Here’s what Americans think you need to be considered wealthy.\nThe average American couple has saved this much money for retirement — How do you compare?\nBuffett, the CEO of Berkshire Hathaway, a multinational conglomerate holding company, has finally lifted the veil on his secretive stock purchase. Nearly a year ago, his business discreetly acquired a substantial amount of publicly traded stock, leaving the public to speculate. The mystery has now been solved. The stock was in Chubb Ltd., a diversified publicly traded insurance company. Berkshire Hathaway has added nearly 26 million shares to its impressive portfolio.\nThis mega stock purchase cost Berkshire Hathaway a whopping $6.7 billion, and at the time, Buffett had requested \"confidential treatment\" from the Securities and Exchange Commission (SEC) filings until the entire purchase was finalized. This move from Buffett is not particularly surprising, considering that his company has previously invested in insurance companies like Geico and National Indemnity. Since Berkshire Hathaway's purchase of stock, Chubb is now the ninth-largest holding in Berkshire's publicly traded portfolio and Berkshire is now the third-largest shareholder of Chubb's outstanding shares, which is 6.4%.\nSo, why choose Chubb?\nBerkshire Hathaway's purchase of Chubb can be boiled down to two things: a history with the insurance company and a clever change in investment strategy.\nTrending: The average millionaire has 7 sources of income – Here are 3 passive income opportunities you can add today.\nYahoo Finance shared what Cathy Seifert, a CFRA Research analyst who covers Berkshire Hathaway, had to say about this investment strategy, \"Chubb is an attractive equity investment for Berkshire because it operates in a business Berkshire knows well: property-casualty insurance.\" Yahoo Finance shared that Chubb's net written premiums have grown by 40% over the past three years and in 2023, the company saw a 32% growth in net investment income to $4.9 billion.\nChubb is one of the world's largest publicly traded property and casualty companies. It was acquired by ACE Ltd. in 2016. The insurance company is currently led by Evan Greenberg, who used to be in charge of ACE and American International Group (AIG).\nIn March this year, Chubb made the headlines as CNN revealed that the insurance company had underwritten the nearly $92 million appeal bond for former president Donald Trump for his E. Jean Carroll's defamation lawsuit. It was revealed that under the terms of the bond, Chubb would only secure the appeal of the $83.3 million judgment. A Chubb spokesperson then said, \"Our surety division provides appeal bonds in the normal course of business.\"\nTrending: Boomers and Gen Z agree they need a salary of around $125,000 a year to be happy, but millennials say they need how much?\nForbes reported that this purchase of Chubb was influenced by Todd Combs, the CEO of GEICO and the current investment manager at Berkshire Hathaway since 2010, who has a history with Chubb. Combs revealed in a 2023 \"I am Home\" podcast, \"I owned a lot of Chubb.\" Before Combs joined Berkshire Hathaway, he had managed Castle Point Capital, which had a 6.3% investment in Chubb in its portfolio. In fact, Berkshire Hathaway has previously owned Chubb shares but not at this current large amount. Since Berkshire Hathaway's investment, Chubb's stock has jumped more than 8% in after-hours trading following the reveal of the investment, which illustrates Buffett's impressive investment prowess.\nAnother reason Buffett's stake in Chubb happened is because of a change in investment strategy. Over the past several months, Berkshire Hathaway has focused on investing in financial companies and selling off its stock in companies dealing with consumer products. For example, Berkshire Hathaway sold off 10 million shares in tech giant Apple in February. Shares in the printer company HP were also trimmed by 80 million shares in the fourth quarter of 2023.\nBerkshire Hathaway has focused on financial companies like American Express and Bank of America.\nRead Next:\nWarren Buffett flipped his neighbor's $67,000 life savings into a $50 million fortune — How much is that worth today?\nHow much money will a $200,000 annuity pay out each month? The numbers may shock you.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Warren Buffett's Berkshire Hathaway Disclosed A Major Stake In Chubb — Valuing $6.7 billion originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-18T17:13:16.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Ally Financial",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 29 million shares of Ally Financial (NYSE:ALLY) stock, which is roughly 9.5% of the company. Even though it's a significant stake in Ally's eyes, it only represents about 0.3% of Berkshire's portfolio.\nAlly Financial offers a wide range of banking products and services, and it currently rewards its shareholders with an annual dividend of $1.20 per share. Let's find out how much Berkshire will earn in dividends from its stake.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nDon't Miss:\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" This high-yield real estate fund, offering an 8% yield, makes earning passive income easier than ever. \nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nSo...\nBerkshire shares of Ally: 29,000,000\nAlly annual dividend per share: $1.20\nTotal Annual Dividend = 29,000,000 x 1.20\nResult: $34,800,000\nBerkshire Hathaway will receive about $34.8 million annually in dividends from its investment in Ally Financial, which does not include reinvesting those dividends. If those dividends were reinvested, the annual dividend income would grow accordingly.\nThe income Ally offers aligns with Buffett’s investment philosophy, which emphasizes steady, predictable returns – this also aligns with Buffett's love of banking stocks.\nKeep Reading:\nThe average American couple has saved this much money for retirement — How do you compare?\nThe average millionaire has 7 sources of income. Here are 3 passive income opportunities you can add today.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Ally Financial originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-20T13:00:00.000Z",
        "Title": "Who are the top executives at Berkshire Hathaway?",
        "Author": "  Brian Baker, CFA ",
        "Text": "Most investors are familiar with Berkshire Hathaway, the conglomerate run by Warren Buffett with a diverse portfolio of businesses and securities that include a railroad, utility businesses, vast insurance operations including Geico, and even Dairy Queen. Berkshire’s stock portfolio includes large positions in companies such as Apple, Bank of America, Coca-Cola and Chevron.\nWhile much is known about Buffett and his investment philosophy, other executives at the company are less widely followed. Since the death of Buffett’s longtime partner and Berkshire vice chairman Charlie Munger last November, attention has shifted to who will be in charge once Buffett is no longer running the company.\nHere’s a look at the top corporate leaders at Berkshire Hathaway including the person who’s likely to become the successor to Buffett as CEO.\nBuffett is among the greatest investors ever and built Berkshire from a struggling textile business in the 1960s into the financial powerhouse it is today by redeploying the company’s cash flow to the most attractive opportunities.\nOver time, Buffett has looked for businesses that earn decent returns on capital that are selling for less than they’re worth. He took over Berkshire in 1965 and has been at the helm ever since. As of June 2024, Buffett’s net worth was about $135 billion, according to Bloomberg, making him the 10th richest person in the world.\nGreg Abel came to Berkshire as part of its acquisition of a stake in MidAmerican Energy, now known as Berkshire Hathaway Energy, in 1999. Abel served as CEO of BHE from 2008 to 2018 and has regularly earned the praise of Buffett. He first mentioned Abel in his 2002 letter to shareholders, calling him a “huge asset for Berkshire.”\nIn 2018, Abel was named vice chair of non-insurance operations for Berkshire, leading many observers to wonder if he’d one day take over for Buffett as CEO. At the company’s 2021 annual meeting, Munger accidentally revealed Abel as Buffett’s successor. In 2024, Buffett told shareholders he thought Abel should be in charge of investment decisions once he takes over as CEO.\nAjit Jain joined Berkshire in 1985 and has built the insurance operation into a behemoth. He specializes in underwriting unique risks that have often brought billions of dollars to Berkshire in premiums. Jain was named vice chair of the insurance businesses in 2018 and serves on the Berkshire board of directors as well.\nBuffett has often praised Jain’s abilities and has even suggested that Jain is more important to Berkshire than he is. “If Charlie, I and Ajit are ever in a sinking boat – and you can only save one of us – swim to Ajit,” Buffett wrote in his 2009 letter to shareholders.\nTodd Combs joined Berkshire as an investment manager in 2010 after the retirement of Lou Simpson, who had managed Geico’s investments for decades. Prior to joining Berkshire, Combs managed a hedge fund for five years and had previous experience working at Progressive Insurance and at the State of Florida Banking, Securities and Finance Division. He was named CEO of Geico in 2020 and also serves on the board of JP Morgan Chase.\nCombs relocated to Omaha, where Berkshire is headquartered, and often meets with Buffett to discuss various business matters. Buffett was introduced to Combs by Charlie Munger, whom Combs had reached out to for an impromptu meeting. Munger and Combs hit it off and Munger thought he’d be a good fit for Berkshire.\nThe second investment manager Buffett has hired in recent years is Ted Weschler, who joined Berkshire in 2012 after running a hedge fund from his office above a bookstore in Charlottesville, Virginia for about 11 years. Weschler first met Buffett through an online charity auction where he paid about $2.6 million two years in a row to have lunch with Buffett.\nIn 2021, an investigation by ProPublica into Roth IRAs revealed that Weschler had grown his account from about $70,000 at the end of 1989 to $264.4 million at the end of 2018. Weschler told ProPublica that the gains were made solely through publicly traded securities such as stocks and bonds.\n"
    },
    {
        "Date": "2024-06-26T13:28:57.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In American Express Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 50 million shares of American Express (NYSE:AXP) stock, which is roughly 21.1% of the company. And it's a significant stake for Berkshire Hathaway, representing approximately 9% of its portfolio.\nAmerican Express is a multinational financial services corporation, known mostly for its credit cards, and it currently rewards its shareholders with a quarterly dividend of $0.70 per share, equating to an annual dividend of $2.80 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" This high-yield real estate fund, offering an 8% yield, makes earning passive income easier than ever. \nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of American Express: 151,610,700\nAmerican Express annual dividend per share: $2.80\nTotal Annual Dividend = 151,610,700 x 2.80\nResult: $424,509,960\nBerkshire Hathaway will receive approximately $424.51 million in dividends from American Express stock this year based on its current dividend rate, which equates to approximately $106.13 million quarterly.\nThe income Berkshire earns from American Express aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns.\nIt's also worth noting that American Express has raised its annual dividend payment for three consecutive years, so Berkshire's dividend income will likely grow in the years ahead as American Express continues returning additional capital to shareholders.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. \nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In American Express Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-07T09:41:00.000Z",
        "Title": "What Should Berkshire Hathaway Buy With Its $189 Billion in Cash?",
        "Author": "  Matt Frankel and Tyler Crowe, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) had $189 billion in cash and Treasury securities on its balance sheet at the end of the first quarter, and there's a good chance it will exceed $200 billion by mid-year. In this video, Fool.com contributor Matt Frankel discusses one popular food service brand he thinks would be a smart acquisition for Berkshire, and Tyler Crowe explains why Warren Buffett isn't likely in a hurry to do anything at all.\n*Stock prices used were the morning prices of May 30, 2024. The video was published on May 31, 2024.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $750,197!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nMatt Frankel has positions in Berkshire Hathaway and Starbucks. Tyler Crowe has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway, Lennar, and Starbucks. The Motley Fool has a disclosure policy.\nMatthew Frankel is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link, they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\nWhat Should Berkshire Hathaway Buy With Its $189 Billion in Cash? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-23T13:30:00.000Z",
        "Title": "More Than 43% of Warren Buffett-Led Berkshire Hathaway's $390 Billion Portfolio Is Invested in Only 1 Stock",
        "Author": "  Neil Patel, The Motley Fool ",
        "Text": "Because he has one of the most successful track records, Warren Buffett is a legend in the finance world. The investing moves he makes as head of Berkshire Hathaway are watched by both amateurs and pros.\nMore recently, Apple (NASDAQ: AAPL) has arguably been the best stock the conglomerate has owned. Berkshire initially bought shares in the first quarter of 2016. From the start of that quarter to June 18, 2024, shares of this consumer tech titan have soared 714%. That monster gain has made Apple into Berkshire's largest holding, representing a jaw-dropping 43% of the massive $390 billion portfolio.\nA lot can be learned by looking at Buffett's decision-making process when he first chose to buy the \"Magnificent Seven\" stock. Investors should then view things with a fresh perspective to see if these factors still hold true and could make Apple a smart buy today.\nRunning through case studies to try to figure out why Warren Buffett first decided to buy Apple can reveal insights that the average investor can use in their own process. By looking at Berkshire's purchase of the tech stock back then, I can identify some key attributes that might have swayed the Oracle of Omaha.\nApple was a smaller business nearly a decade ago, but it still possessed one of the world's strongest brands. The company's popular hardware products, most notably the iPhone, promoted customer loyalty. But thanks to Apple's software and services, a powerful ecosystem was created that discouraged customers from leaving for competing platforms.\nThat brand recognition and customer loyalty helped drive tremendous pricing power. This was indicated by Apple's fiscal 2015 gross margin of 40.1%. It seemed like customers were willing to pay up for the expensive products.\nApple's financials were in pristine shape when Buffett first bought the stock. In fiscal 2015, the business raked in $53 billion in net income, good for a stellar profit margin of 22.8%. And Apple was sitting on $206 billion of cash, cash equivalents, and marketable securities, compared to $56 billion of long-term debt (as of Sept. 26, 2015). This was not a financially struggling enterprise.\nWarren Buffett loves buying high-quality businesses. But he will only do so if the price is right. During Q1 2016, shares of Apple traded at an average price-to-earnings (P/E) ratio of just 10.6. No, that's not a typo. This looks like an absolute steal in hindsight. \nClearly, Apple worked out to be a fantastic investment decision for the Oracle of Omaha. And today, it represents a large chunk of Berkshire Hathaway's public equities portfolio. But investors shouldn't automatically buy the stock. The current setup isn't the same as when Buffett first bought shares.\nApple is a more mature company in 2024 than it was in 2016. This means that its growth prospects are a bit more limited. Sales declined 2.8% in fiscal 2023, and they fell again in the second quarter of fiscal 2024.\nFor these lower growth trends, investors are being asked to pay a price-to-earnings ratio of 32.7. That's a ridiculously steep valuation which is 53% higher than Apple stock's trailing 10-year average P/E multiple. And the current valuation is three times more than when Buffett first added Apple to the Berkshire portfolio.\nAccording to the valuation, expectations remain high for this company and its future. However, revenue and earnings gains going forward likely won't come close to resembling the past. This is a great business, no doubt, but it doesn't look like a smart investment today.\nBefore you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $775,568!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 10, 2024\nNeil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nMore Than 43% of Warren Buffett-Led Berkshire Hathaway's $390 Billion Portfolio Is Invested in Only 1 Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-03T15:30:03.000Z",
        "Title": "Why Is Berkshire Hathaway B (BRK.B) Up 3.4% Since Last Earnings Report?",
        "Author": "  Zacks Equity Research ",
        "Text": "A month has gone by since the last earnings report for Berkshire Hathaway B (BRK.B). Shares have added about 3.4% in that time frame, outperforming the S&P 500.\nWill the recent positive trend continue leading up to its next earnings release, or is Berkshire Hathaway B due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recent earnings report in order to get a better handle on the important catalysts.\nBerkshire Q1 Earnings Rise Y/Y, Segment Results SolidBerkshire Hathaway delivered first-quarter 2024 operating earnings of $11.2 billion, which increased 39% year over year. The increase was driven by higher earnings in insurance-underwriting and insurance-investment income, other controlled businesses and non-controlled businesses.\nRevenues rose 5.2% year over year to $89.8 billion, attributable to an increase in revenues in Insurance and Other and Railroad, Utilities and Energy.Costs and expenses increased 0.6% year over year to $76.5 billion, largely driven by a rise in costs and expenses in Railroad, Utilities and Energy.\nBerkshire’s Insurance and Other segment revenues increased 3.2% year over year to $65.4 billion on the back of higher insurance premiums earned, leasing revenues, interest, dividend and other investment income.Insurance underwriting produced operating earnings of $2.6 billion, which surged nearly three-fold year over year.Railroad operating revenues rose 4.1% year over year to $5.6 billion, reflecting lower revenues per car/unit, partially offset by higher volumes of 6.6%. Pre-tax earnings of Railroad decreased 7.9% year over year to $1.5 billion.Operating earnings from the Railroad business declined 7.5% year over year.Total revenues at Manufacturing, Service and Retailing decreased 1.3% year over year to $40.7 billion. Pre-tax earnings increased 1% year over year to $3.9 billion.After-tax earnings from manufacturing, service and retailing businesses rose 1.3% year over year. This reflected growth at several manufacturing businesses, which were substantially offset by lower earnings from service and retailing businesses.\nAs of Mar 31, 2024, consolidated shareholders’ equity was $577.8 billion, up 1.8% from the level as of Dec 31, 2023. Cash and cash equivalents and restricted cash were $36.2 billion, up 32.5% from the 2023-end level.Berkshire exited the first quarter of 2024 with a float of about $168 billion, up from $169 billion as of Dec 31, 2023.Cash flow from operating activities totaled $10.5 billion, up 21.5% from the year-ago period.BRK.B bought back shares worth $2.6 billion in the first quarter.\nHow Have Estimates Been Moving Since Then?\nIt turns out, estimates review have trended downward during the past month.\nThe consensus estimate has shifted -7.61% due to these changes.\nVGM Scores\nAt this time, Berkshire Hathaway B has an average Growth Score of C, however its Momentum Score is doing a bit better with a B. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\nOverall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.\nOutlook\nEstimates have been broadly trending downward for the stock, and the magnitude of this revision indicates a downward shift. Notably, Berkshire Hathaway B has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.\nPerformance of an Industry Player\nBerkshire Hathaway B belongs to the Zacks Insurance - Property and Casualty industry. Another stock from the same industry, First American Financial (FAF), has gained 2.2% over the past month. More than a month has passed since the company reported results for the quarter ended March 2024.\nFirst American Financial reported revenues of $1.42 billion in the last reported quarter, representing a year-over-year change of -1.5%. EPS of $0.45 for the same period compares with $0.49 a year ago.\nFor the current quarter, First American Financial is expected to post earnings of $1.17 per share, indicating a change of -13.3% from the year-ago quarter. The Zacks Consensus Estimate has changed -2% over the last 30 days.\nThe overall direction and magnitude of estimate revisions translate into a Zacks Rank #3 (Hold) for First American Financial. Also, the stock has a VGM Score of D.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nFirst American Financial Corporation (FAF) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-18T20:20:37.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Boosts Occidental Petroleum Stake to Almost 29%",
        "Author": "  Bill McColl ",
        "Text": "\nWarren Buffett's Berkshire Hathaway has boosted its stake in Occidental Petroleum to almost 29%.\nBerkshire bought Occidental Petroleum shares every trading day from June 5 to June 17, adding a total of 7.3 million shares.\nBuffett's firm now has 255.3 million shares of Occidental Petroleum.\n\nShares of Occidental Petroleum (OXY) edged higher Tuesday as Warren Buffett’s Berkshire Hathaway (BRK.A, BRK.B) bought up even more of the stock, boosting its stake in the energy firm to almost 29%.\nBerkshire Hathaway purchased shares every trading day from June 5 to June 17, increasing its ownership by 7.3 million shares, Securities and Exchange Commission (SEC) filings show. The prices paid ranged from $59.58 to $60.43 each.\nWith the latest buy, Berkshire has about 255.3 million shares in Occidental Petroleum, bringing Berkshire's stake to 28.8%. Occidental Petroleum is Berkshire's sixth-largest holding.\nBerkshire also has warrants to buy 83.9 million more Occidental Petroleum shares at $59.62 apiece, and owns 84,897 shares of preferred stock. A full redemption could bring Berkshire's ownership above 40%, though Buffett has previously said he wouldn't take control of the company.\nBuffett reportedly said in a CNBC interview that he began investing in the company after he read the transcript of one of its earnings reports and said “this is exactly what I would be doing.\"\nShares of Occidental Petroleum finished 1.8% higher at $61.26 Tuesday. The stock has gained about 2.6% since the start of the year.\nTradingView\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-06-18T16:18:31.000Z",
        "Title": "Here's How Much Berkshire Hathaway Will Earn In Dividends From Its Stake In Chubb Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) has made a significant investment in Chubb Limited (NYSE:CB), acquiring 25,923,840 shares. Chubb is a leading global insurance company and it currently rewards its shareholders with an annual dividend of $3.64 per share. Let's find out how much Berkshire will earn in dividends from its investment.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nDon't Miss:\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" This high-yield real estate fund, offering an 8% yield, makes earning passive income easier than ever. \nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nSo...\nBerkshire shares of Chubb: 25,923,840\nChubb annual dividend per share: $3.64\nTotal Annual Dividend = 25,923,840 x 3.64\nResult: $94,364,777.60 in dividends annually\nBerkshire Hathaway will receive about $94.4 million annually in dividends from its investment in Chubb, which does not include reinvesting those dividends. If those dividends were reinvested, the annual dividend income would grow accordingly.\nThe income Chubb offers aligns with Buffett’s investment philosophy, which emphasizes steady, predictable returns – which is why he loves insurance companies.\nInvestors must also note that Chubb has raised its annual dividend payment for 31 consecutive years, making it a Dividend Aristocrat, so Buffett and Berkshire can count on a growing stream of dividends in the years ahead.\nKeep Reading:\nThe average American couple has saved this much money for retirement — How do you compare?\nThe average millionaire has 7 sources of income. Here are 3 passive income opportunities you can add today.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Berkshire Hathaway Will Earn In Dividends From Its Stake In Chubb Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-25T13:52:33.000Z",
        "Title": "Berkshire Hathaway accelerates sales of China's BYD",
        "Author": "Reuters ",
        "Text": "BEIJING/NEW YORK (Reuters) - Warren Buffett's Berkshire Hathaway has accelerated its selling of shares in BYD, China's largest seller of electric vehicles.\nBerkshire reduced its stake in BYD's issued H-shares to 5.99% on June 19, according to a Tuesday filing with the Hong Kong stock exchange. The stake had been 7.02% as recently as June 11.\nHong Kong requires larger shareholders to disclose sales when their resulting stakes fall below whole percentage numbers. Berkshire may cease disclosing BYD sales after its ownership stake falls below 5%.\nBuffett's company began investing in Shenzhen-based BYD in 2008, when it paid $230 million for about 225 million shares, then equal to a 10% stake.\nIt began disclosing sales in August 2022, after BYD's share price had risen more than 20-fold, and two months after it set a record high. The price has since fallen about 28%.\nCharlie Munger, Berkshire's late vice chairman, spearheaded the BYD investment, and Buffett has given him full credit. Berkshire invests mainly in the United States.\nFounded by Chinese chemist Wang Chuanfu in 1995 as a maker of rechargeable batteries, BYD surpassed fellow billionaire Elon Musk's Tesla last year as the world's largest electric vehicle maker. Tesla regained the top spot in the first quarter.\nBerkshire ended March with $189 billion of U.S. Treasury bills, cash and equivalents after selling $20 billion of stock, mainly Apple, in the first quarter.\nThe cash stake included $182.3 billion outside Berkshire's railroad, utilities and energy businesses. At Berkshire's annual meeting on May 4. Buffett called it a \"fair assumption\" that this amount could grow to $200 billion this quarter.\n(Reporting by Jonathan Stempel in New York, Editing by Nick Zieminski)\n"
    },
    {
        "Date": "2024-06-25T14:22:00.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Kroger Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 50 million shares of Kroger (NYSE:KR) stock, which is roughly 6.9% of the company. And while it's a large percentage of Kroger, it only represents approximately 0.6% of Berkshire's portfolio.\nKroger is one of the largest retailers in the United States, primarily operating supermarkets, and it currently rewards its shareholders with a quarterly dividend of $0.29 per share, equating to an annual dividend of $1.16 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk has reportedly bought 6,000 acres of land just outside of this city. Here’s how to invest in its growth before he floods it with new tech workers.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of Kroger: 50,000,000\nKroger annual dividend per share: $1.16\nTotal Annual Dividend = 50,000,000 x 1.16\nResult: $58,000,000\nBerkshire Hathaway will receive approximately $58 million in dividends from Kroger stock this year based on its current dividend rate, which equates to approximately $14.5 million quarterly.\nThe income Berkshire earns from Kroger aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Kroger has raised its annual dividend payment for 17 consecutive years, so Berkshire's dividend income will likely continue to grow in the years ahead.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Kroger Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-24T13:50:10.000Z",
        "Title": "Here's Why Berkshire Hathaway B (BRK.B) is a Strong Momentum Stock",
        "Author": "  Zacks Equity Research ",
        "Text": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\nMany investors also have a go-to methodology that helps guide their buy and sell decisions. One way to find winning stocks based on your preferred way of investing is to use the Zacks Style Scores, which are indicators that rate stocks based on three widely-followed investing types: value, growth, and momentum.\nIs This 1 Momentum Stock a Screaming Buy Right Now?\nDifferent than value or growth investors, momentum-oriented investors live by the saying \"the trend is your friend.\" This investing style is all about taking advantage of upward or downward trends in a stock's price or earnings outlook. Employing factors like one-week price change and the monthly percentage change in earnings estimates, the Momentum Style Score can indicate favorable times to build a position in high-momentum stocks.\nBerkshire Hathaway B (BRK.B)\nFounded in 1889, Berkshire Hathaway is an Omaha, NE-based holding company, which owns more than 90 subsidiaries in insurance, rail roads, utilities, manufacturing services, retail and home building.\nBRK.B boasts a Momentum Style Score of A and VGM Score of B, and holds a Zacks Rank #3 (Hold) rating. Shares of Berkshire Hathaway B has seen some interesting price action recently; the stock is up 1% over the past one week and up 0.5% over the past four weeks. And in the last one-year period, BRK.B has gained 22.2%. As for the stock's trading volume, 3,569,959.25 shares on average were traded over the last 20 days.\nMomentum investors don't just pay attention to price changes; positive earnings play a crucial role, too. One analyst revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.21 to $18.71 per share. BRK.B boasts an average earnings surprise of 37.2%.\nInvestors should take the time to consider BRK.B for their portfolios due to its solid Zacks Ranks, notable earnings metrics, and impressive Momentum and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-14T20:50:00.000Z",
        "Title": "Top Stock Reports for Berkshire Hathaway, Eli Lilly & PepsiCo",
        "Author": "  Mark Vickery ",
        "Text": "Friday, June 14, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), Eli Lilly and Co. (LLY) and PepsiCo, Inc. (PEP), as well as two micro-cap stocks Hovnanian Enterprises, Inc. (HOV) and IDT Corporation (IDT). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Berkshire Hathaway’s shares were in line with the Zacks Insurance - Property and Casualty industry over the year-to-date period (+13.8% vs. +13.8%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Eli Lilly have outperformed the Zacks Large Cap Pharmaceuticals industry over the year-to-date period (+52.0% vs. +21.8%). The company boasts a solid portfolio of core drugs for diabetes, autoimmune diseases and cancer. Its revenue growth is being driven by higher demand for drugs like Mounjaro, Verzenio, Jardiance, Taltz and others.Eli Lilly’s new tirzepatide medicines, diabetes drug Mounjaro and obesity medicine, Zepbound, are seeing exceptionally strong demand trends. Lilly has also launched some other new products like Omvoh and Jaypirca. Mounjaro, Zepbound and other new products are expected to drive Lilly’s top line in 2024.Lilly is also making rapid pipeline progress in areas like obesity, diabetes and Alzheimer’s. However, generic competition for some drugs, rising pricing pressure and challenges in meeting strong demand for incretin products like Zepbound and Mounjaro are some top-line headwinds.(You can read the full research report on Eli Lilly here >>>)PepsiCo’s shares have underperformed the Zacks Beverages - Soft drinks industry over the year-to-date period (-2.4% vs. +2.2%). The company witnessed soft sales trends in the QFNA segment due to recent product recalls. Adverse currency rates also remain headwinds.Nevertheless, PepsiCo has been benefiting from strength and resilience in core categories, diversified portfolio, modernized supply chain, improved digital capabilities, flexible go-to-market distribution systems and robust consumer demand trends.Additionally, PEP’s international business continues to hallmark its overall performance, delivering significant volume and organic revenue growth in the first quarter. These factors along with robust pricing aided PepsiCo’s earnings and organic revenues first-quarter 2024. The company’s productivity and cost-management initiatives bode well.(You can read the full research report on PepsiCo here >>>)Shares of Hovnanian have outperformed the Zacks Building Products - Home Builders industry over the past year (+54.5% vs. +34.2%). This microcap company with market capitalization of $920.57 million has substantially improved its financial health, reducing debt from $2.5 billion to under $1 billion as of the second quarter of fiscal 2024.Its aggressive growth in controlled lots, which rose 29% year over year to 36,841 at the end of the second quarter of fiscal 2024, and a planned community count increase of 5-10% by year-end will support revenue growth. The company targets niche markets like active adults and innovates in-home designs, ensuring solid sales potential.However, Hovnanian faces legal risks from litigation and regulatory challenges, especially in environmental issues. The competitive homebuilding market threatens market share and profitability, exacerbated by the dependency on volatile housing market conditions. A declining contract backlog could affect the company’s profitability and growth.(You can read the full research report on Hovnanian here >>>)IDT’s shares have outperformed the Zacks Diversified Communication Services industry over the past year (+38.6% vs. -9.4%). This microcap company with market capitalization of $929.95 million is innovating its B2B2X financial services and leveraging digital payments, enhancing operational efficiency with a notable rise in NRS EBITDA margin from 1% to 20%.DT's NRS segment reported $82 million in recurring revenues with a 30% year-over-year increase, driven by a suite of merchant services. The POS network grew 28% to 28,700 terminals, tapping into a TAM of 200,000 retailers. BOSS Money's remittance service saw a 42% revenue uptick, boosting the fintech space.Challenges include regulatory risks in fintech, reliance on volatile segments like Traditional Communications for cash flow, and intense competition in POS and remittance markets. Macroeconomic factors and one-time costs may impact profitability. Despite growth, concerns about expense management and the unpredictability of new investments could affect investor sentiment.(You can read the full research report on IDT here >>>)Other noteworthy reports we are featuring today include Broadcom Inc. (AVGO), McDonald's Corp. (MCD) and Amphenol Corp. (APH).Mark VickerySenior EditorNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nLilly (LLY) New Products Hold Key to Sales Growth in 2024\nPepsiCo's (PEP) Business Investments to Bolster Performance\nFeatured Reports\nStrong Demand for Networking Products Aids Broadcom (AVGO)Per the Zacks analyst, Broadcom is riding on robust demand for networking solutions. Strong adoption of AI accelerators among hyperscalers is driving top-line growth.\nMcDonald's (MCD) Banks on Strategic Initiatives, High Costs AilPer the Zacks analyst, McDonald's is likely to benefit from the loyalty program, menu innovation and Accelerating the Arches strategy. However, commodity and wage inflation pose concerns.\nGE HealthCare (GEHC) To Gain from Rising Product DemandPer the Zacks analyst, GE HealthCare's (GEHC) topline is likely to driven by rising demand for its products as it cater to growing markets. However, choppy macro environment to weigh on the stock.\nHigh Margin Assets & Cost Management Aid Devon Energy (DVN)Per the Zacks analyst Devon's strong production from its high margins assets and efficient cost management will drive performance over the long run.\nRental Unit Demand Aid Essex Property (ESS) Amid High SupplyPer the Zacks Analyst, Essex Property is likely to benefit from the healthy demand for residential units amid high home ownership costs, though new deliveries and high interest rates are woes.\nGenpact (G) Gains From AI Product Portfolio Amid Talent CostPer the Zacks analyst, Genpact has growth potential in Artificial Intelligence with a strong product portfolio and benefits from acquisitions. A competitive talent market remains a concern.\nOperational Efficiency Aids Silgan (SLGN) Amid Low Volumes Per the Zacks analyst, Silgan is gaining from disciplined capital allocation model and strong operational performance. However, lower volumes will continue to hurt its top-line performance.\nNew Upgrades\nEnd-Market Strength & Diversification Aids Amphenol (APH)Per the Zacks analyst, Amphenol benefits from commercial air, military, industrial and automotive end-market demand. Diversified business model also lowers volatility of individual geographies.\nRobust Construction Activity & Acquisitions Aid EMCOR (EME)Per the Zacks analyst, EMCOR is benefiting from increased project flows from high-tech manufacturing and network and communications market sectors. Also, focus on acquisitions bode well.\nLoan Demand, Fee Income, High Rates Aid BankUnited (BKU)Per the Zacks analyst, decent loan demand, high rates and focus on fee income will keep on aiding BankUnited's revenues. Solid balance sheet and liquidity positions will support capital distributions.\nNew Downgrades\nMacro Headwinds and Cautious Customer Spending to Dent FLEXPer the Zacks analyst, Flex's performance is likely to be impacted by macro headwinds across multiple end markets coupled with cautious customer spending behaviour and rising global tax rates.\nMedifast (MED) Troubled by Customer Acquisition ChallengesPer the Zacks analyst, Medifast is battling customer acquisition challenges due to the rising popularity of weight loss medications. Consequently, the company expects soft revenues in second quarter.\nSunoco's (SUN) Debt Woes, Market Instability Threaten GrowthPer the Zacks analyst, Sunoco's (SUN) high debt-to-capital ratio, surpassing industry peers for the last five years, and consumer shifts to alternative fuels over climate concerns may impact profits.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nAmphenol Corporation (APH) : Free Stock Analysis Report\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nPepsiCo, Inc. (PEP) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nHovnanian Enterprises Inc (HOV) : Free Stock Analysis Report\nIDT Corporation (IDT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-05T14:39:32.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Will Earn in Dividends from Its New Stake in Chubb",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) has recently made a significant investment in Chubb Limited (NYSE:CB), acquiring 25,923,840 shares. Chubb, a leading global insurance company, pays an annual dividend of $3.64 per share. Given this substantial stake, Berkshire is poised to receive a considerable amount in dividends.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nDon't Miss:\nA new fund backed by Jeff Bezos offers a 7-9% target yield with monthly dividends. Here’s how you can invest today.\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" These high-yield real estate notes that pay 7.5% – 9% make earning passive income easier than ever.\nBerkshire shares of Chubb: 25,923,840\nChubb annual dividend per share: $3.64\nTotal Annual Dividend = 25,923,840 x 3.64\nResult: $94,364,777.60 in dividends annually\nBerkshire Hathaway will receive approximately $94.36 million annually in dividends from its investment in Chubb, which does not include reinvesting those dividends. If those dividends were reinvested, the annual dividend income would grow accordingly.\nThis substantial dividend income aligns with Buffett’s investment philosophy, emphasizing steady, predictable returns. Chubb’s reliable dividend payouts provide a stable income stream, reinforcing the financial robustness of Berkshire Hathaway’s diversified portfolio. Not to mention the fact that Chubb has raised its annual dividend payment for a whopping 31 consecutive years.\nRead Next:\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. Investing in its booming real estate market has never been more accessible.\nCommercial real estate has historically outperformed the stock market, but few investors have the capital or resources needed to invest in this asset class. This platform allows individuals to invest in commercial real estate with as little as $5,000.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Will Earn in Dividends from Its New Stake in Chubb originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-11T18:23:58.000Z",
        "Title": "Buffett Buys on a Budget: The 3 Cheapest Stocks Held by Berkshire Hathaway",
        "Author": "  Rich Duprey ",
        "Text": "“Price is what you pay; value is what you get.” In 2008, Warren Buffett told Berkshire Hathaway (NYSE:BRK-A, BRK-B) shareholders that buying good businesses when they’re cheap was the quintessential way to amass wealth. “Whether we’re talking about socks or stocks,” he said, “I like buying quality merchandise when it is marked down.”\nHe knows a thing or two about that. Since taking over as CEO of Berkshire in 1965, the Oracle of Omaha has amassed an incredible 4.38 million percent return for investors for a compounded annual growth rate of 19.8%. In contrast, the S&P 500 has returned “just” 31,233%, or 10.2% annually.\nInvestors following in his footsteps might want to heed those sentiments when looking for cheap Buffett stocks to buy. Scouring Berkshire Hathaway’s holdings can turn up some discounted stocks on sale. Below are three companies that offer both great value and a good price.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nSource: APN Photography / Shutterstock.com\nDespite doubling off the lows hit last October, dialysis treatment center DaVita (NYSE:DVA) remains an excellent stock to buy. It is one of the two largest dialysis centers in the U.S., generating 89% of its revenue and all its operating profits from dialysis. The company serves around 200,800 patients a year, giving it a 36% market share, just behind market leader Fresenius Medical Care (NYSE:FMS) at 37%.\nDaVita continues to build on the momentum of its cost-containment program, which began last year. First-quarter revenue rose 6.5% year-over-year while operating expenses rose just 1%. That led to a 79% increase in net income of $306 million, or $2.65 per share, compared to $1.25 per share last year.\nThe worst possible thing now for DaVita could be the weight-loss treatments Wegovy and Zepbound. The wonder drugs are causing phenomenal weight loss in users, which could ultimately reduce the incidence of kidney disease and the need for dialysis. It’s a win for overweight people and diabetics but not so much for those treating them. That would still be a risk in the future, though.\nAt less than 14 times next year’s earnings, less than twice its sales, and going for 13 times the free cash flow (FCF) it generates, DaVita is a cheap Buffett stock that will deliver a lot of value for years.\nSource: T. Schneider / Shutterstock.com\nBuffett’s favorite oil stock Occidental Petroleum (NYSE:OXY) is expanding. After the oil and gas industry underwent a wave of consolidation, Occidental announced it would buy shale producer CrownRock for $12 billion. It makes the oil giant an even bigger player in the oil-rich Permian basin than it already was.\nIt is a fever that has gripped the players. Last year, Exxon Mobil (NYSE:XOM) announced it was buying Permian giant Pioneer Natural Resources, which triggered a series of oil companies to launch their own acquisitions. Occidental bought CrownRock, Diamondback Energy (NYSE:FANG) bought privately held Endeavor Energy Partners and ConocoPhillips (NYSE:COP) just announced it was buying Marathon Oil (NYSE:MRO).\nOccidental, though, is gaining access to low break-even acreage in the region. The undeveloped assets are ready to be developed below $60 a barrel for West Texas Intermediate crude, which currently is $79 per barrel.\nOccidental Petroleum trades at just 13 times earnings estimates and 11 times FCF, making it a great value stock to buy.\nSource: Shutterstock\nKroger is the last cheap Buffett stock to buy (NYSE:KR). The largest supermarket pure play, with over 2,700, is in the midst of its acquisition attempt. The grocery store chain is attempting to buy rival Albertsons (NYSE:ACI) but, like the oil giants, is running into interference from the FTC.\nThe regulatory agency’s blanket opposition to any big merger deal could threaten Kroger’s near-term growth opportunities despite the supermarket giant offering significant concessions to make the deal happen. The FTC does not understand the very real competitive threats grocery stores face. There is no lack of discount grocers consumers can choose from, including Walmart (NYSE:WMT), Costco (NASDAQ:COST), Aldi and Lidl. However, Kroger’s stock will only be a temporary setback for the premier supermarket chain if the merger fails.\nEven after rising 24% from recent lows, Kroger stock still trades at a good price. It goes for 11 times earnings, a tiny fraction of sales, and 13 times FCF. If shares fell due to the FTC blocking its acquisition, that would only make them even better.\nOn the date of publication, Rich Duprey held a LONG position in XOM stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\nThe post Buffett Buys on a Budget: The 3 Cheapest Stocks Held by Berkshire Hathaway appeared first on InvestorPlace.\n"
    },
    {
        "Date": "2024-06-25T13:30:11.000Z",
        "Title": "Brokers Suggest Investing in Berkshire Hathaway B (BRK.B): Read This Before Placing a Bet",
        "Author": "  Zacks Equity Research ",
        "Text": "When deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nLet's take a look at what these Wall Street heavyweights have to say about Berkshire Hathaway B (BRK.B) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nBerkshire Hathaway B currently has an average brokerage recommendation (ABR) of 2.00, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by four brokerage firms. An ABR of 2.00 indicates Buy.\nOf the four recommendations that derive the current ABR, two are Strong Buy, representing 50% of all recommendations.\nBrokerage Recommendation Trends for BRK.B\nCheck price target & stock forecast for Berkshire Hathaway B here>>>While the ABR calls for buying Berkshire Hathaway B, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near -term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\nZacks Rank Should Not Be Confused With ABR\nAlthough both Zacks Rank and ABR are displayed in a range of 1-5, they are different measures altogether.\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nIt has been and continues to be the case that analysts employed by brokerage firms are overly optimistic with their recommendations. Because of their employers' vested interests, these analysts issue more favorable ratings than their research would support, misguiding investors far more often than helping them.\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nThere is also a key difference between the ABR and Zacks Rank when it comes to freshness. When you look at the ABR, it may not be up-to-date. Nonetheless, since brokerage analysts constantly revise their earnings estimates to reflect changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in predicting future stock prices.\nShould You Invest in BRK.B?\nIn terms of earnings estimate revisions for Berkshire Hathaway B, the Zacks Consensus Estimate for the current year has remained unchanged over the past month at $18.71.\nAnalysts' steady views regarding the company's earnings prospects, as indicated by an unchanged consensus estimate, could be a legitimate reason for the stock to perform in line with the broader market in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Berkshire Hathaway B. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nIt may therefore be prudent to be a little cautious with the Buy-equivalent ABR for Berkshire Hathaway B.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-10T21:45:20.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Drops Despite Market Gains: Important Facts to Note",
        "Author": "  Zacks Equity Research ",
        "Text": "In the latest market close, Berkshire Hathaway B (BRK.B) reached $410.81, with a -0.7% movement compared to the previous day. This change lagged the S&P 500's daily gain of 0.26%. On the other hand, the Dow registered a gain of 0.18%, and the technology-centric Nasdaq increased by 0.35%.\nThe the stock of company has risen by 0.41% in the past month, lagging the Finance sector's gain of 0.75% and the S&P 500's gain of 3.25%.\nAnalysts and investors alike will be keeping a close eye on the performance of Berkshire Hathaway B in its upcoming earnings disclosure. On that day, Berkshire Hathaway B is projected to report earnings of $5.10 per share, which would represent year-over-year growth of 10.39%. Alongside, our most recent consensus estimate is anticipating revenue of $97.31 billion, indicating a 5.19% upward movement from the same quarter last year.\nFor the full year, the Zacks Consensus Estimates project earnings of $18.71 per share and a revenue of $368.44 billion, demonstrating changes of +8.91% and +1.09%, respectively, from the preceding year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Berkshire Hathaway B. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 1.24% upward. Berkshire Hathaway B currently has a Zacks Rank of #3 (Hold).\nWith respect to valuation, Berkshire Hathaway B is currently being traded at a Forward P/E ratio of 22.12. Its industry sports an average Forward P/E of 12.59, so one might conclude that Berkshire Hathaway B is trading at a premium comparatively.\nMeanwhile, BRK.B's PEG ratio is currently 3.16. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. Insurance - Property and Casualty stocks are, on average, holding a PEG ratio of 1.54 based on yesterday's closing prices.\nThe Insurance - Property and Casualty industry is part of the Finance sector. Currently, this industry holds a Zacks Industry Rank of 34, positioning it in the top 14% of all 250+ industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-12T13:00:17.000Z",
        "Title": "Is Trending Stock Berkshire Hathaway Inc. (BRK.B) a Buy Now?",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nShares of this company have returned -0.4% over the past month versus the Zacks S&P 500 composite's +3.1% change. The Zacks Insurance - Property and Casualty industry, to which Berkshire Hathaway B belongs, has lost 1.2% over this period. Now the key question is: Where could the stock be headed in the near term?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nBerkshire Hathaway B is expected to post earnings of $5.10 per share for the current quarter, representing a year-over-year change of +10.4%. Over the last 30 days, the Zacks Consensus Estimate has changed -7.6%.\nThe consensus earnings estimate of $18.71 for the current fiscal year indicates a year-over-year change of +8.9%. This estimate has changed +1.2% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $19.87 indicates a change of +6.2% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -3.8%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Berkshire Hathaway B is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nIn the case of Berkshire Hathaway B, the consensus sales estimate of $97.31 billion for the current quarter points to a year-over-year change of +5.2%. The $368.44 billion and $374.39 billion estimates for the current and next fiscal years indicate changes of +1.1% and +1.6%, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-01T14:00:16.000Z",
        "Title": "Those who invested in Berkshire Hathaway (NYSE:BRK.A) five years ago are up 90%",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "If you want to compound wealth in the stock market, you can do so by buying an index fund. But you can do a lot better than that by buying good quality businesses for attractive prices. For example, the Berkshire Hathaway Inc. (NYSE:BRK.A) share price is up 90% in the last five years, slightly above the market return. Zooming in, the stock is up a respectable 18% in the last year.\nWith that in mind, it's worth seeing if the company's underlying fundamentals have been the driver of long term performance, or if there are some discrepancies.\n Check out our latest analysis for Berkshire Hathaway \nWhile the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nOver half a decade, Berkshire Hathaway managed to grow its earnings per share at 26% a year. This EPS growth is higher than the 14% average annual increase in the share price. Therefore, it seems the market has become relatively pessimistic about the company. This cautious sentiment is reflected in its (fairly low) P/E ratio of 11.98.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nIt's probably worth noting that the CEO is paid less than the median at similar sized companies. It's always worth keeping an eye on CEO pay, but a more important question is whether the company will grow earnings throughout the years. Dive deeper into the earnings by checking this interactive graph of Berkshire Hathaway's earnings, revenue and cash flow.\nBerkshire Hathaway shareholders gained a total return of 18% during the year. Unfortunately this falls short of the market return. On the bright side, that's still a gain, and it's actually better than the average return of 14% over half a decade It is possible that returns will improve along with the business fundamentals. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Take risks, for example - Berkshire Hathaway has   1 warning sign   we think you should be aware of.\nFor those who like to find winning investments this free list of undervalued companies with recent insider purchasing, could be just the ticket.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n"
    },
    {
        "Date": "2024-06-03T21:58:50.000Z",
        "Title": "NYSE glitch sends Berkshire Hathaway shares down nearly 100%",
        "Author": "  Kate Gibson ",
        "Text": "The New York Stock Exchange on Monday said it had resolved a technical problem that has Class A shares of Warren Buffett's Berkshire Hathaway seemingly down almost 100%.\nThe issue prompted trading to be halted in Berkshire's A-class shares, along with about a dozen other companies, including Barrick Gold and Nuscale Power, both of which also showed faulty and steep declines. Trading continued in Berkshire's B-class shares.\nThe trouble arose shortly after the opening bell, impacting the likes of Chipotle Mexican Grill, Abbott Laboratories and other stocks. A list of impacted stocks can be seen here.\n\"A technical issue involving industrywide price bands published by the Consolidated Tape Association's Securities Information Processor triggered 'limit-up/limit down' trading halts on up to 40 symbols listed on NYSE Group exchanges. Shortly before noon, the issue was resolved and trading in the impacted stocks resumed,\" a spokesperson for the exchange said in an email. \"The NYSE is reviewing potentially impacted trades.\"\nReality, as Trump supporters see it\nTrump fake elector in Wisconsin describes how he says he was tricked | 60 Minutes\nTrump's guilty verdict: A stress test for democracy\n"
    },
    {
        "Date": "2024-06-03T17:28:43.000Z",
        "Title": "'Technical issue' causes Berkshire Hathaway, other stocks to pause trading on NYSE",
        "Author": "  Clyde Hughes ",
        "Text": "June 3 (UPI) -- A \"technical issue\" forced trade halts for multiple firms on the New York Stock Exchange Monday.\nStocks for Warren Buffett's Berkshire Hathaway were among the stocks paused as the NYSE said the issue with its price bands \"triggered halts in several stocks.\" Price bands, which are published by the Consolidated Tape Association's Security Information Processor, are triggered when stock's Limited Up/Limit Down prices are reached..\nFor example, the glitch showed Berkshire Hathaway Class A stock trading at $185.10, indicating it had lost 99.97%, when it was at $627,400 at closing on Friday.\nNYSE said the issue was resolved at about 11:45 a.m. EDT.\nOfficials said may have been sparked by the release of new software at the NYSE.\nThe Consolidated Tape Association said it will go back to the previous software program at its primary data center at the start of Tuesday's session, according to CNBC.\nJoe Saluzzi, a co-founder of Themis Trading, told CNN while the glitch affected numerous stocks, it appeared it did not affect the broader market. All three of the major exchanges were slightly down at 1 p.m., EDT.\n"
    },
    {
        "Date": "2024-06-21T13:54:04.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends Annually From Its Stake In Apple Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 789,368,450 shares of Apple (NYSE:AAPL) stock, which is roughly 5.1% of the company. And it's a significant stake for Berkshire, representing over 40% of its portfolio.\nApple is one of the world's leading technology companies and it currently rewards its shareholders with an annual dividend of $1 per share, not to mention its consistent share repurchase activity. Let's find out how much Berkshire will earn in dividends from its stake in Apple.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. \nSo...\nBerkshire shares of Apple: 789,368,450\nApple annual dividend per share: $1.00\nTotal Annual Dividend = 789,368,450 x 1.00\nResult: $789,368,450\nBerkshire Hathaway will receive about $789.4 million in dividends annually from its investment in Apple, which does not include reinvesting those dividends. If those dividends were reinvested, the annual dividend income would grow along with its total share count in its portfolio.\nThe income Apple offers aligns with Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Apple has raised its annual dividend payment for 13 consecutive years, so Berkshire's annual income will likely grow year after year.\nKeep Reading:\nThe average millionaire has 7 sources of income. Here are 3 passive income opportunities you can add today.\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends Annually From Its Stake In Apple Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-17T12:31:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Berkshire Hathaway, Eli Lilly, PepsiCo, Hovnanian and IDT",
        "Author": "  Zacks Equity Research ",
        "Text": "For Immediate Release\nChicago, IL – June 17, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc. (BRK.B), Eli Lilly Co. LLY and PepsiCo, Inc. PEP, Hovnanian Enterprises, Inc. HOV and IDT Corporation IDT.\nHere are highlights from Friday’s Analyst Blog:\nTop Stock Reports for Berkshire Hathaway, Eli Lilly and PepsiCo\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc., Eli Lilly and Co. and PepsiCo, Inc., as well as two micro-cap stocks Hovnanian Enterprises, Inc. and IDT Corporation. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today's research reports here >>>Berkshire Hathaway's shares were in line with the Zacks Insurance - Property and Casualty industry over the year-to-date period (+13.8% vs. +13.8%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)Shares of Eli Lilly have outperformed the Zacks Large Cap Pharmaceuticals industry over the year-to-date period (+52.0% vs. +21.8%). The company boasts a solid portfolio of core drugs for diabetes, autoimmune diseases and cancer. Its revenue growth is being driven by higher demand for drugs like Mounjaro, Verzenio, Jardiance, Taltz and others.Eli Lilly's new tirzepatide medicines, diabetes drug Mounjaro and obesity medicine, Zepbound, are seeing exceptionally strong demand trends. Lilly has also launched some other new products like Omvoh and Jaypirca. Mounjaro, Zepbound and other new products are expected to drive Lilly's top line in 2024.Lilly is also making rapid pipeline progress in areas like obesity, diabetes and Alzheimer's. However, generic competition for some drugs, rising pricing pressure and challenges in meeting strong demand for incretin products like Zepbound and Mounjaro are some top-line headwinds.(You can read the full research report on Eli Lilly here >>>)PepsiCo's shares have underperformed the Zacks Beverages - Soft drinks industry over the year-to-date period (-2.4% vs. +2.2%). The company witnessed soft sales trends in the QFNA segment due to recent product recalls. Adverse currency rates also remain headwinds.Nevertheless, PepsiCo has been benefiting from strength and resilience in core categories, diversified portfolio, modernized supply chain, improved digital capabilities, flexible go-to-market distribution systems and robust consumer demand trends.Additionally, PEP's international business continues to hallmark its overall performance, delivering significant volume and organic revenue growth in the first quarter. These factors along with robust pricing aided PepsiCo's earnings and organic revenues first-quarter 2024. The company's productivity and cost-management initiatives bode well.(You can read the full research report on PepsiCo here >>>)Shares of Hovnanian have outperformed the Zacks Building Products - Home Builders industry over the past year (+54.5% vs. +34.2%). This microcap company with market capitalization of $920.57 million has substantially improved its financial health, reducing debt from $2.5 billion to under $1 billion as of the second quarter of fiscal 2024.Its aggressive growth in controlled lots, which rose 29% year over year to 36,841 at the end of the second quarter of fiscal 2024, and a planned community count increase of 5-10% by year-end will support revenue growth. The company targets niche markets like active adults and innovates in-home designs, ensuring solid sales potential.However, Hovnanian faces legal risks from litigation and regulatory challenges, especially in environmental issues. The competitive homebuilding market threatens market share and profitability, exacerbated by the dependency on volatile housing market conditions. A declining contract backlog could affect the company's profitability and growth.(You can read the full research report on Hovnanian here >>>)IDT's shares have outperformed the Zacks Diversified Communication Services industry over the past year (+38.6% vs. -9.4%). This microcap company with market capitalization of $929.95 million is innovating its B2B2X financial services and leveraging digital payments, enhancing operational efficiency with a notable rise in NRS EBITDA margin from 1% to 20%.DT's NRS segment reported $82 million in recurring revenues with a 30% year-over-year increase, driven by a suite of merchant services. The POS network grew 28% to 28,700 terminals, tapping into a TAM of 200,000 retailers. BOSS Money's remittance service saw a 42% revenue uptick, boosting the fintech space.Challenges include regulatory risks in fintech, reliance on volatile segments like Traditional Communications for cash flow, and intense competition in POS and remittance markets. Macroeconomic factors and one-time costs may impact profitability. Despite growth, concerns about expense management and the unpredictability of new investments could affect investor sentiment.(You can read the full research report on IDT here >>>)\nWhy Haven't You Looked at Zacks' Top Stocks? \nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com                        \nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nPepsiCo, Inc. (PEP) : Free Stock Analysis Report\nHovnanian Enterprises Inc (HOV) : Free Stock Analysis Report\nIDT Corporation (IDT) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-06-27T16:25:58.000Z",
        "Title": "Why Is Berkshire Hathaway Inc. (BRK.A) The Best Ice Cream Stock to Invest in 2024?",
        "Author": "  Faheem Tahir ",
        "Text": "We recently compiled a list of the 11 Best Ice Cream Stocks to Invest In 2024. In this article, we are going to take a look at where Berkshire Hathaway Inc. (NYSE:BRK.A) stands against the other ice cream stocks.\nRegarded as the most favorite dessert globally, ice cream has its popularity game quite high in the U.S. as well, where it leaves an impact of a massive $11.4 billion every year, while, at the same time, giving out $1.9 billion in direct wages, according to IDFA! Also, the U.S. saw 1.3 billion gallons of ice cream getting produced in the country in 2023, showcasing the dessert’s staggering popularity in the country. For all the ice cream lovers, we have also curated a list which you can view to see all the best ice cream brands in the U.S. so that you can fulfill all your ice cream cravings in the best way!\nIn addition to this, average per capita consumption in the country amounts to over 4 gallons every year, and with a huge population of 341 million, that’s quite a lot of consumption! In terms of consumption, New Zealand, the U.S., and Australia are the 3 countries that top the charts, with per capita annual consumption rates of 28.4 liters, 20.8 liters, and 18.0 liters, respectively!\nAs such, the global ice cream industry is racing quickly toward the sky, as, after sitting at the $76.1 billion mark in 2023, it’s on its way to hitting $132.3 billion in 2032. That boasts a CAGR of 6.7%, which is quite staggering, according to Fortune Business Insights. Ice cream-making giants like Ben & Jerry's, Wall’s, Magnum, to name a few, dominate the global ice cream industry with a market share of 20%.\nAlso check out 15 largest Ice Cream Companies in the World.\nMoving on to recent shifting trends of the industry, one interesting trend that has emerged related to flavors, wherein, plant-based and vegan ice creams are growing in popularity. As reported by Straits Research, the global vegan ice cream market size is expected to expand from its market size figure of $623.63 million in 2022 to $984.16 million by 2031, boasting a CAGR of 5.2%. Furthermore, ice creams are planned to be given a new touch by the makers by bringing in the element of spice in ice creams! Crazy, right? In Germany, it is reported by Tetrapak that 34% of ice cream consumers are keen on trying out ice cream flavors with spice in them.\nWith these innovations emerging, the global ice cream industry is expected to generate over $100 billion in the coming decade, and with the given demand stats we discussed above, it’s quite certain how the ice cream market is one to look at in 2024 and the coming years. Hence, here we are going to discuss 11 Best Ice Cream Stocks to Invest In 2024 so that one can capitalize on the booming times to come in the ice cream industry.\nTo curate our list of 11 Best Ice Cream Stocks to Invest In 2024, we gathered a list of all companies with a significant presence in the ice cream industry. We then further narrowed down on the basis of their upside potential and ranked the finest remaining companies by their number of hedge fund holders as of Q1, 2024, using Insider Monkey's database that tracks the activity of 920 hedge funds. For stocks with equal number of hedge fund holders, we used their upside as the tiebreaker.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA team of insurance professionals in a boardroom overlooking a city skyline.\nNumber of Hedge Fund Investors’ holdings: 119\nThe number 1 stock on our list of 11 Best Ice Cream Stocks to Invest In 2024 is Berkshire Hathaway Inc. (NYSE:BRK.A), which is a multinational conglomerate company based in the USA. It owns the big ice cream brand, Dairy Queen.\nAnalysts are eying a price target of $465.1, as compared to its current price of $404.75, as of writing this article – that’s an upside potential of approximately 15%!\nRecently, Berkshire Hathaway took a position in LNG market by buying Dominion Energy's share of the Maryland-based Cove Point LNG export plant in 2023, and with LNG market expecting a boom in coming 5 years – the market capacity is expected to grow 5 times from 2024 to 2028 - Berkshire Hathaway Inc.’s (NYSE:BRK.A) stock is definitely one to keep.\nAs of Q1, 2024, 119 hedge funds in our database at Insider Monkey hold positions in the stock, with a massive value of $16 billion!\nBill & Melinda Gates Foundation Trust and Gardner Russo & Gardner hold the biggest stakes in the stock, carrying values of $7.3 billion and $1.4 billion, respectively! To keep the recent performance of the stock in the picture, one must note that the stock performed better than the S&P 500 in the 1st quarter of 2024, as it recorded a gain of 17.9%, while the S&P 500 return was 10.6%.\nOverall BRK.A ranks 1st on our list of the best ice cream stocks to buy. You can visit 11 Best Ice Cream Stocks to Invest In 2024 to see the other ice cream stocks that are on hedge funds’ radar. While we acknowledge the potential of BRK.A as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BRK.A but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-06-05T08:05:16.000Z",
        "Title": "Occidental and Berkshire Hathaway unit sets up JV to extract lithium",
        "Author": "  GlobalData ",
        "Text": "Occidental Petroleum and BHE Renewables have announced a joint venture (JV) to harness TerraLithium's Direct Lithium Extraction (DLE) technology for sustainable lithium production.\nThe collaboration aims to utilise this patented technology of TerraLithium, an Occidental unit, to extract high-purity lithium compounds from geothermal brine.\nBHE Renewables, which operates ten geothermal power plants in California's Imperial Valley, processes 50,000gal of lithium-rich brine per minute. This brine is used to produce 345MW of clean energy.\nThe JV's project at BHE Renewables' Imperial Valley geothermal facility will demonstrate the feasibility of TerraLithium's DLE technology in an environmentally safe manner.\nUpon successful demonstration, BHE Renewables, which is part of Berkshire Hathaway Energy, intends to construct and operate commercial lithium production facilities within the Imperial Valley.\nBHE Renewables president and CEO Alicia Knapp said: “This JV with TerraLithium represents a significant advancement in BHE Renewables’ commitment to pursuing commercial lithium production that is environmentally safe, commercially viable and leads to good outcomes for the Imperial Valley community.\n“We are excited to be working with Occidental on this incredible opportunity to make the Imperial Valley a global leader in lithium production.”\nAdditionally, the JV looks to licence TerraLithium's DLE technology and develop commercial lithium production sites beyond the Imperial Valley.\nLithium is essential for manufacturing batteries used in electric vehicles, consumer electronics, and energy grid storage.\nIt also has industrial applications in producing glass, ceramics, and pharmaceuticals.\nThe International Renewable Energy Agency forecasts a tenfold growth in battery lithium demand from 2020 to 2030, aligning with the anticipated rise in battery demand.\nOccidental US Onshore Resources and Carbon Management, Operations president Richard Jackson said: “By leveraging Occidental’s expertise in managing and processing brine in our oil and gas and chemicals businesses, combined with BHE Renewables’ deep knowledge in geothermal operations, we are uniquely positioned to advance a more sustainable form of lithium production.\n“We look forward to working with BHE Renewables to demonstrate how DLE technology can produce a critical mineral that society needs to further net-zero goals.”\n\"Occidental and Berkshire Hathaway unit sets up JV to extract lithium\" was originally created and published by Mining Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-06-28T16:14:57.000Z",
        "Title": "Warren Buffett: Top investing lessons and advice from Berkshire’s legendary CEO",
        "Author": "  Brian Baker, CFA ",
        "Text": "Warren Buffett is arguably the greatest investor of all time and has compounded his money at such a high rate that he’s now the 10th-richest person in the world with a net worth of $135 billion, according to Bloomberg.\nBuffett is unique among the world’s wealthy in that he amassed his fortune by investing and reinvesting his capital into a number of different businesses before ultimately taking control of Berkshire Hathaway, which serves as his primary investment vehicle today.\nThanks to his enormous success, integrity and willingness to speak publicly about his investment philosophy and other matters, Buffett’s fame has grown significantly over the years. Berkshire’s annual shareholder meeting was once held in a small cafeteria with just a dozen or so people in attendance, but today it attracts tens of thousands and is broadcast online.\nHere’s what else you should know about Warren Buffett, his investment approach and a breakdown of his largest holdings right now.\nBuffett bought his first stock at age 11 after he said he’d read every book on investing in the Omaha library, some of them twice.\nBuffett studied at the University of Pennsylvania, University of Nebraska and Columbia Business School. It was at Columbia where he met his mentor Benjamin Graham, who many consider the “father of value investing.”\nBuffett ran an investment partnership from 1957-1969, generating annual returns of 23.8 percent after fees, according to Fortune magazine.\nBuffett took control of Berkshire Hathaway on May 10, 1965, and the stock closed at $18 per share. It now trades at about $616,000 per Class A share.\nBerkshire Hathaway’s insurance float has grown from $19 million in 1967 to nearly $169 billion in 2023, according to Berkshire’s 2023 annual report.\nBuffett purchased a $1.3 billion stake in Coca-Cola in the late 1980s because of its strong brand and global growth prospects. The stake is worth about $24.5 billion as of March 2024.\nBuffett is famous for his unhealthy diet, often consuming several Cherry Cokes a day and preferring steak or hamburgers with potatoes to any sort of vegetables.\nIn 2006, Buffett committed to giving away more than 99 percent of his wealth to charitable foundations, much of it to the Bill & Melinda Gates Foundation.\nSince Buffett took control of Berkshire Hathaway in 1965, the stock has compounded at an annual rate of 19.8 percent through 2023, compared to 10.2 percent for the S&P 500, according to Buffett’s 2023 letter to shareholders.\nBuffett has used his shareholder letters, annual meetings and media appearances to share his investment philosophy and common-sense approach to business. Here are some of his top pieces of advice:\nDon’t lose money: Buffett has often used this simple and rather obvious piece of advice to highlight the importance of risk in investing. By avoiding situations where you can lose, you’re naturally left with investments that are likely to generate gains. Thinking about what can go wrong before you think about possible gains can help you avoid major setbacks in investing.\nBe fearful when others are greedy and greedy when others are fearful: This advice speaks to the importance of understanding investor behavior. There will be times when people get so excited about stocks or other investments that they bid their prices to unsustainable heights, making it very difficult to earn decent returns from that point. But the reverse is also true. Sometimes people can get so pessimistic about the future that they start giving away stocks or businesses at extremely attractive prices. Managing your emotions through these two extremes is part of being a good investor.\nWait for the right pitch: The ability to wait is one of your biggest advantages as an investor. If your broker or friends are urging you to invest in something you don’t understand or think is priced too high, you can always wait for something else. The market is constantly changing and new opportunities are created each day. Sooner or later, a business you understand will be served up at a price you like and that’s when you swing big.\nIndex funds are best for most people: Despite making his fortune as an active investor, Buffett acknowledges that most people will get better results by investing in a broadly diversified low-cost index fund. He recommends investors using this approach should choose a fund that tracks the S&P 500, allowing them to profit off the best businesses in America and benefit from the progress of capitalism.\nProductive assets are the only investments to make: Buffett has spoken out against speculative assets in recent years, instead preferring to highlight the value of productive assets such as stocks, real estate, bonds or farmland. Speculative assets such as gold or cryptocurrencies don’t produce anything for their owners, so their price is entirely dependent upon what someone else is willing to pay. If you buy 100 ounces of gold today, you’ll still have 100 ounces 20 years from now, whereas productive assets can produce more over time.\nStock\nShares owned\nValue\nApple (AAPL)\n789,368,450\n$135.4 billion\nBank of America (BAC)\n1,032,852,006\n$39.2 billion\nAmerican Express (AXP)\n151,610,700\n$34.5 billion\nCoca-Cola (KO)\n400,000,000\n$24.5 billion\nChevron (CVX)\n122,980,207\n$19.4 billion\nOccidental Petroleum (OXY)\n248,018,128\n$16.1 billion\nKraft Heinz (KHC)\n325,634,818\n$12.0 billion\nMoody’s (MCO)\n24,669,778\n$9.7 billion\nIn his 2019 letter to shareholders, Buffett laid out in simple terms the criteria he looks for when purchasing an entire business or a non-controlling stake via the stock market:\n“We constantly seek to buy new businesses that meet three criteria. First, they must earn good returns on the net tangible capital required in their operation. Second, they must be run by able and honest managers. Finally, they must be available at a sensible price.”\nBuffett’s first criteria involves the quality of the underlying business he’s looking to purchase or invest in. He wants businesses with strong economics, which means they earn good returns on capital and generate cash flow for their owners.\nHe also wants to find businesses that he understands. While Buffett is capable of understanding most businesses, he’s not able to accurately assess where each business will be five or 10 years into the future, which is important in investing because so much of an asset’s value comes from the future value of its cash flows. So, in addition to the quality of a business, he’ll also look at the durability of a business and its competitive advantage. If he can’t get his head around that, he’ll move on to the next potential investment.\nEvaluating who is running a business is another key part of Buffett’s investment strategy. He’s often said that he can’t provide managerial expertise if it isn’t already in place, and he knows that a CEO has a major impact on how an organization is managed. He has used his annual shareholder letters to praise managers who he thinks are doing exceptional jobs, sometimes when he doesn’t even own a stake in their business. In the past, he has identified Amazon’s Jeff Bezos and JPMorgan Chase CEO Jamie Dimon as great CEOs.\n“It’s difficult to overpay the truly extraordinary CEO of a giant enterprise. But this species is rare,” Buffett wrote in his 2005 letter.\nThe final criteria Buffett uses in evaluating a potential investment may be the most important: price. No business or manager is so good that they can provide a great investment no matter the price it was purchased at.\nBuffett has long subscribed to the theory of “value investing,” though he and his partner Charlie Munger would say the term is redundant because all intelligent investing is value investing: getting more than you’re paying for.\nInitially, Buffett purchased investments that had many issues but their prices were so low that they made up for the challenges the businesses faced. This method was known as the “cigar butt” approach, because it resembled finding an old cigar butt on the ground that had one or two puffs left in it for free.\nAs Berkshire has grown, it’s become more difficult for Buffett to find mispriced bargains, so he has gravitated toward paying fair prices for excellent businesses. With this approach, more of your investment return comes from the underlying business and less from the low price you initially paid.\nBuffett’s net worth has grown substantially over the course of his life, especially in the past 20 years as the effects of compounding took hold. As of June 2024, Buffett was worth about $135 billion, according to Bloomberg.\nAt a young age, Buffett became fascinated with money and getting rich, which led to his interest in investing. While still in his 20s, Buffett set up an investment partnership, which today would be considered a hedge fund, with money from friends and family. He worked out of a room in his home, poring over company filings and trade periodicals in his search for mispriced investments he could buy at a bargain.\nOne of these investments was Sanborn Map, a company that created extremely detailed maps of cities in the U.S. and sold them mostly to the insurance industry. Sanborn had built up an investment portfolio that by itself was worth $65 per share, but the stock only traded for $45 in 1958. Buffett pounced, putting more than one-third of the partnership’s capital into Sanborn and earning a major profit for himself and his limited partners.\nOver the 13 years Buffett managed the partnership, his investors earned annual returns of 23.8 percent after fees, according to Fortune magazine. This means that an investment of $10,000 in 1957 would have been worth more than $160,000 at the end of 1969.\nWhen Buffett closed the partnership at the end of 1969, his net worth stood at $26.5 million, according to Buffett biographer Alice Schroeder. He wrote to the partners to explain what the partnership owned and gave them the option of receiving their share in cash or securities. He told them that he planned to keep his shares in the Massachusetts-based textile manufacturer Berkshire Hathaway, which Buffett had purchased for the partnership in the early 1960s and took control of in May 1965. Berkshire would become Buffett’s investment vehicle for the next 50-plus years.\nWhen Buffett took control of Berkshire Hathaway, textile manufacturing was a business in decline, but it did experience occasional cyclical highs that generated profits. Rather than reinvesting those profits into the textile business or paying them out as dividends to shareholders, Buffett redirected the cash into new areas.\nIn 1967, he purchased — for Berkshire Hathaway — National Indemnity, an Omaha-based insurance company that specialized in unusual risks. Buffett was drawn to the insurance business because it generated float, money that could be invested until claims were paid out. If an insurance company could generate a profit or even just break even in its underwriting business, the float was free. Over the years, Berkshire’s insurance float has grown from $19 million in 1967 to nearly $169 billion in 2023, according to Berkshire’s 2023 annual report.\nBuffett had total control over Berkshire’s capital allocation and he consistently tried to direct funds to the most profitable areas. He made purchases of businesses and securities that generated more cash for him to reinvest wherever he saw fit.\nIn 1972, Buffett agreed to acquire See’s Candy, a California candy company that would eventually be folded into Berkshire. Buffett paid $25 million for See’s and, through 2014, had generated $1.9 billion in pre-tax profits for Berkshire shareholders with only $40 million in additional investments. Buffett has often spoken of the importance of the See’s acquisition to Berkshire’s success because it showed them the power of great brand names and generated lots of cash that allowed them to buy other businesses.\nOther notable Berkshire investments include:\nAmerican Express: purchased a stake for about $1.3 billion that was worth more than $34.5 billion in March 2024.\nCoca-Cola: purchased a stake for about $1.3 billion that was worth $24.5 billion in March 2024.\nBank of America: purchased a stake for $14.6 billion that was worth $39.2 billion as of March 2024.\nApple: purchased a $31 billion stake that was worth more than $161 billion at the end of 2021. Buffett has since sold some shares, but still holds a $135.4 billion stake as of March 2024.\nGEICO: Berkshire initially purchased GEICO as an investment, but bought the remaining shares it didn’t own in early 1996. GEICO had many qualities Buffett looked for in an investment: a low-cost provider of a necessary service that was run by a great manager while producing lots of cash for its owner.\nBNSF: Berkshire agreed to acquire the entire company in 2009 for about $44 billion, the largest acquisition in Berkshire’s history at the time. The freight railroad operator generated net earnings of about $5.1 billion in 2023.\nPrecision Castparts: Berkshire agreed to acquire Precision Castparts in 2015 for more than $37 billion. In 2020, Berkshire took an $11 billion writedown related to the deal and Buffett said he had overpaid for the manufacturer of aerospace parts.\nEditorial Disclaimer: All investors are advised to conduct their own independent research into investment strategies before making an investment decision. In addition, investors are advised that past investment product performance is no guarantee of future price appreciation.\n"
    },
    {
        "Date": "2024-06-03T17:19:13.000Z",
        "Title": "Berkshire Hathaway, Chipotle, More NYSE Stocks Hit With Trading Halts Triggered By Technical Issues (UPDATED)",
        "Author": "  Piero Cingari ",
        "Text": "Editor’s note: This story has been updated with additional details.\nMultiple stocks on the New York Stock Exchange experienced sudden trading halts after 9:40 a.m. ET Monday due to technical issues.\nThe unexpected pauses in trading were triggered by a technical issue categorized under the “Limit Up/Limit Down” code, which is typically used to curb excessive volatility in a single stock.\nThe NYSE said it is investigating the reported technical issue. “Additional information will follow as soon as possible,” NYSE-owner Intercontinental Exchange Inc. (NYSE:ICE) stated.\nAmong the largest companies halted on Monday were Berkshire Hathaway Inc. (NYSE:BRK) at 9:50:52 a.m. ET and Chipotle Mexican Grill, Inc. (NYSE:CMG) at 9:44:58 a.m. ET.\nChipotle shares experienced a sudden and dramatic decline of 66%, plummeting from $3,097 to $1,047. The stock resumed trading at 10:21 a.m.\nAt 9:49 a.m., ET shares of Berkshire Hathaway faced an even more severe downturn, nearly being wiped out with a staggering 99.7% collapse from $622,375 to $185.10. As of this update, trading has not yet resumed for the company owned by Warren Buffett.\nMonday’s technical malfunctions on the NYSE occur just one week after U.S. stock exchanges transitioned to a one-day settlement period.\nOther stocks affected by the sudden technical glitch on the New York Stock Exchange in Monday trading include:\nAbbott Laboratories (NYSE:ABT)\nBarrick Gold Corp. (NYSE:GOLD)\nFranco-Nevada Corporation (NYSE:FNV)\nEssex Property Trust, Inc (NYSE:ESS)\nNuScale Power Corporation (NYSE:SMR)\nDestiny Tech100 Inc. (NYSE:DXYZ)\nAult Disruptive Technologies Corporation (NYSE:ADRT)\nNouveau Monde Graphite Inc. (NYSE:NMG)\nBowhead Specialty Holdings Inc. (NYSE:BOW)\nBanco Santander-Chile (NYSE:BSAC)\nLogistic Properties of the Americas (NYSE:LPA)\nXperi Inc (NYSE:XPER)\nICL Group Ltd. (NYSE:ICL)\nTelefonica, S.A. (NYSE:TEF)\nTrinity Industries, Inc. (NYSE:TRN)\nThe technical fallout also impacted trading on the following NYSE-Arca listed exchange traded funds:\nDirexion Daily Aerospace & Defense Bull 3X Shares (NYSE:DFEN)\nMAX S&P 500 4x Leveraged ETN (NYSE:UPRO)\nJPMorgan Core Plus Bond ETF (NYSE:JCPB)\nGlobal X MSCI Argentina ETF (NYSE:ARGT)\nNationwide Nasdaq-100 Risk-Managed Income ETF (NYSE:NUSI)\nSPDR S&P Semiconductor ETF (NYSE:XSD)\nRead now: Koss Corp, Tupperware, BlackBerry Shares Are Moving Monday: What’s Going On?\nPhoto via Shutterstock.\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Berkshire Hathaway, Chipotle, More NYSE Stocks Hit With Trading Halts Triggered By Technical Issues (UPDATED) originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-07-01T12:17:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Expands to the Nordics, Names Regional and Product Line Leadership",
        "Author": "Business Wire ",
        "Text": "BOSTON & STOCKHOLM, July 01, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced that it has expanded its operations to the Nordic countries, opening an office in Stockholm, and naming Anna Green as Head of Nordics. BHSI has also appointed Karin Bryner as Head of Executive & Professional Lines and Anton Holmgren as Head of General Property, for the Nordics.\n\"Launching BHSI in the Nordics is an exciting continuation of BHSI’s steady global expansion. We will continue to expand our local team and capabilities, and look forward to bringing the certainty of BHSI’s financial strength, underwriting acumen, and CLAIMS IS OUR PRODUCT philosophy to customers and distribution partners throughout Sweden, Denmark, Norway, and Finland,\" said Andreas Krause, Head of DACH, BHSI.\nBeginning immediately, BHSI’s Nordic office is underwriting Executive & Professional Lines, General Property, Energy, and Construction.\n\"We look forward to building a strong team in the Nordics and bringing BHSI’s commitment to excellent technical underwriting and highly responsive service to the market. We have already had great response from brokers and customers,\" said Anna Green, Head of Nordics, BHSI.\nAnna Green takes the reins as Head of Nordics with industry experience spanning the Nordics, as well as Europe, the UK, and the Asia Pacific region. Anna started her insurance career more than 20 years ago and was most recently CEO of the Sweden Branch of another global insurer. Anna has deep expertise in Specialty and Environmental underwriting. She is based in Stockholm and can be reached at anna.green@bhspecialty.com.\nKarin Bryner comes to her role as Head of Executive & Professional Lines with more than 20 years of experience in financial lines underwriting, including more than a decade focused on Nordic risks. She was most recently Underwriting Manager, Financial Lines in Sweden, at another global insurer. She is based in Stockholm and can be reached at Karin.Bryner@bhspecialty.com.\nAnton Holmgren brings more than a decade of property underwriting experience to his role as Head of General Property. He has held increasingly senior underwriting roles over his career, including Nordic Head of Underwriting, Property, Engineering Lines & Marine, at another global insurer. He will be based in Stockholm and can be reached at Anton.holmgren@bhspecialty.com.\nBHSI’s new office in Sweden is located at:\nBrahegatan 10114 37 StockholmSweden\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL) is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240630408644/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    },
    {
        "Date": "2024-06-06T10:28:00.000Z",
        "Title": "Occidental Petroleum and Berkshire Hathaway are Teaming Up to Help Solve a Huge Problem",
        "Author": "  Matt DiLallo, The Motley Fool ",
        "Text": "Occidental Petroleum (NYSE: OXY) isn't your average oil company. While it currently makes most of its money producing fossil fuels, it has grand ambitions to help lead the transition to lower-carbon energy. Through its Oxy Low Carbon Ventures subsidiary and other endeavors, it has invested heavily in several emerging lower-carbon energy technologies. \nThe oil company's upside to the clean energy transition is one of the many factors that caught the eye of Warren Buffett. His company, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B), which currently owns 28% of the oil company's outstanding shares, is no stranger to investing in clean energy. Berkshire is now partnering with Occidental to commercialize lithium, a key ingredient for electric vehicle batteries. Here's a look at their new partnership and why energy companies are turning to this metal to help power their future growth. \nOccidental Petroleum is forming a new joint venture (JV) with BHE Renewables, the renewable energy subsidiary of Berkshire Hathaway Energy. They formed the JV to demonstrate and deploy TerraLithium's Direct Lithium Extraction (DLE) and associated technologies to extract and produce lithium from geothermal brine. TerraLithium is a wholly owned subsidiary of Occidental that patented DLE technologies. \nBHE Renewables operates 10 geothermal power plants in California that process 50,000 gallons of lithium-rich brine per minute to produce 345 megawatts of emissions-free electricity. The companies will seek to process this brine to extract the lithium. If they successfully demonstrate the commercial viability of this process, BHE Renewables will build, own, and operate a commercial lithium production facility in California. The two companies will leverage their expertise, including Occidental's experience in managing and processing brine in its oil and gas and chemicals businesses and BHE Renewble's geothermal expertise, to commercialize a more sustainable form of lithium production. \nThe world will need a lot more lithium in the future. It's a crucial component for batteries used in electric vehicles (EVs), consumer electronics, and energy storage. According to the International Renewable Energy Agency, demand for the metal will grow tenfold by 2030, driven by the accelerating efforts to decarbonize the global economy through electrification. \nOccidental and Berkshire Hathaway Energy are among the many companies seeking to capitalize on the accelerating demand for lithium. Oil giant ExxonMobil (NYSE: XOM) plans to become a leading lithium supplier for the EV market by 2030. The company is taking a slightly different approach to Occidental and Berkshire.\nLast year, Exxon acquired the drilling right to over 120,000 acres in the Smackover Formation in southern Arkansas, which holds significant lithium deposits. The lithium-rich saltwater is in reservoirs about 10,000 feet below the ground. Exxon plans to use conventional oil and gas drilling methods to produce lithium-rich saltwater. It will then use DLE technology to separate the lithium from the saltwater and convert it into battery-grade material. Exxon is targeting its first production in Arkansas by 2027. It's also evaluating other potential lithium production sites around the world. The oil giant aims to produce enough lithium by 2030 to help supply the needs of over 1 million EVs per year. \nRival oil giant Chevron (NYSE: CVX) is also exploring opportunities to produce lithium. The company believes lithium fits within its strategy and capabilities. Like Exxon, it has a lot of experience using conventional oil and gas drilling methods and processing brine in its upstream and chemical operations. Chevron could seek to follow Exxon's strategy and organically build a lithium business. Another option is to acquire a company with lithium resources and expertise. Chevron has made several acquisitions in the lower carbon space in recent years to expand its capabilities, including biofuels producer Renewable Energy Group and the world's biggest hydrogen storage plant in Utah. \nOil companies can see the writing on the proverbial wall. That's leading them to seek ways to participate in the global transition to cleaner energy. While they're taking an \"all of the above\" approach by investing broadly in lower carbon energy, lithium is emerging as a key focus area. They could help solve a huge problem, given the amount of lithium the world needs to meet future demand. It could also provide power so that these energy companies can continue growing even as demand for fossil fuels starts to plateau and decline in the decades ahead. That makes their lithium investments something investors should monitor since it could be crucial to their long-term sustainability. \nBefore you buy stock in Occidental Petroleum, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Occidental Petroleum wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $713,416!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nMatt DiLallo has positions in Berkshire Hathaway and Chevron. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nOccidental Petroleum and Berkshire Hathaway are Teaming Up to Help Solve a Huge Problem was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-28T22:17:24.000Z",
        "Title": "Warren Buffett donates record $5.3 billion Berkshire shares to charity",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) -Warren Buffett donated another $5.3 billion of Berkshire Hathaway stock to the Bill & Melinda Gates Foundation and four family charities, his biggest annual donation since he began making them in 2006.\nBuffett's donation boosted his overall giving to the charities to about $57 billion, including to the family charities in the last two Novembers.\nThe latest donation, announced on Friday, included about 13 million Berkshire Class B shares.\nBuffett donated 9.93 million shares to the Gates Foundation, and has donated more than $43 billion of Berkshire shares there overall.\nHe also donated 993,035 shares to the Susan Thompson Buffett Foundation, named for his late first wife, and 695,122 shares to each of three charities led by his children Howard, Susan and Peter: the Howard G. Buffett Foundation, the Sherwood Foundation and the NoVo Foundation.\nBuffett, 93, plans to give away more than 99% of the fortune he built at Omaha, Nebraska-based Berkshire, which he has run since 1965, with his children serving as executors of his will.\nBerkshire is an approximately $880 billion conglomerate that owns dozens of businesses including the BNSF railroad and Geico car insurance, and stocks such as Apple.\nBuffett still owns 14.5% of Berkshire's outstanding shares, a Friday regulatory filing shows, despite having given away more than half of his stock since 2006.\nHis $128.4 billion fortune makes him the world's 10th-richest person, according to Forbes magazine.\nIn a statement, Buffett said he was worth about $44 billion when the donations began, but that the benefits of compounding, \"simple and generally sound capital deployment\" at Berkshire, and the \"American tailwind\" produced his current wealth.\nBuffett, Bill Gates and Melinda French Gates also pioneered the Giving Pledge, in which 245 people like OpenAI's Sam Altman, Michael Bloomberg, Carl Icahn, Elon Musk and Mark Zuckerberg committed at least half of their wealth to philanthropy.\nThe Susan Thompson Buffett Foundation works in reproductive health. The Howard G. Buffett Foundation works to alleviate hunger, mitigate conflicts including in Ukraine, and improve public safety. The Sherwood Foundation supports Nebraska nonprofits, and the NoVo Foundation has initiatives focused on girls and women.\nFriday's filing suggests based on Buffett's holdings that Berkshire has repurchased little or none of its own stock since April 19.\n(Reporting by Jonathan Stempel in New York and Niket Nishant in Bengaluru; Editing by Shounak Dasgupta, Chizu Nomiyama, Nick Zieminski, Richard Chang and Diane Craft)\n"
    },
    {
        "Date": "2024-06-18T10:57:41.000Z",
        "Title": "Berkshire increases Occidental Petroleum stake to nearly 29%",
        "Author": "  GlobalData ",
        "Text": "Berkshire Hathaway, led by billionaire Warren Buffett, has raised its ownership in Occidental Petroleum to just under 29%, reported Reuters, citing a regulatory filing.\nThe move follows the acquisition of an additional 2.95 million shares, as revealed by a regulatory filing.\nThe filing with the US Securities and Exchange Commission indicated that Berkshire Hathaway invested around $176m for the additional shares, purchased in three transactions since 13 June 2024.\nFollowing the latest share acquisition, Berkshire Hathaway's holdings have risen to approximately 255.3 million shares, amounting to a stake valued at approximately $15.37bn as of 17 June 2024.\nWarren Buffett's conglomerate has been actively increasing its position in the oil company, with purchases this month reaching 5.5 million shares.\nEarlier, Buffett stated that he does not intend to take over the Houston-based company.\nIn August 2022, Berkshire obtained regulatory approval to purchase up to 50% of Occidental.\nIn addition to the common stock, Buffett's company holds warrants to buy another 83.5 million shares of Occidental at $59.62 each.\nIn February 2024, Reuters reported that Occidental was exploring the sale of WES, a pipeline operator focused on natural gas in the US, which could be valued at more than $20bn, including debt.\nThe divestment forms part of Occidental’s strategy to reduce its significant debt, which was reported to be $18.5bn at the end of 2023.\nLast month, Occidental was reportedly considering the sale of its assets in the Permian Basin’s Barilla Draw region, which could garner more than $1bn.\nThe assets in question span around 27,500 net acres and produce an estimated 24,400 barrels of oil equivalent per day.\n\"Berkshire increases Occidental Petroleum stake to nearly 29%\" was originally created and published by Offshore Technology, a GlobalData owned brand.\n\n \nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n"
    },
    {
        "Date": "2024-06-18T15:14:00.000Z",
        "Title": "Leonard Green & Partners and Berkshire Partners Complete Sale of SRS Distribution for $18.25 Billion",
        "Author": "Business Wire ",
        "Text": "LOS ANGELES & BOSTON, June 18, 2024--(BUSINESS WIRE)--Leonard Green & Partners and Berkshire Partners today announced the closing of the sale of SRS Distribution Inc. (\"SRS\"), a leading distributor of residential and commercial building products in the United States, to The Home Depot for $18.25 billion. The acquisition was previously announced on March 28, 2024.\n\"We are extremely proud of our work with SRS and are honored to have been part of this chapter in the organization’s incredible expansion,\" said Jonathan Seiffer, Senior Partner, Leonard Green & Partners. \"We appreciate the relentless dedication of CEO Dan Tinker and the SRS team, and we look forward to the continued success of SRS as it joins The Home Depot family.\"\n\"During Berkshire’s 11 years as an investor in SRS, the company honed its unique culture to attract, develop, and retain top-tier talent within the industry,\" said Josh Lutzker, Managing Director, Berkshire Partners. \"Our partnership with CEO Dan Tinker and the entire SRS leadership team was very rewarding, as we worked together to scale the business into one of the leading distributors of building products in the United States.\"\nBerkshire Partners invested in SRS in 2013 and sold a majority stake in the business to Leonard Green & Partners in 2018. Both firms played a key role in supporting the growth of SRS, including entering multiple new trade verticals and the expansion of SRS branches across the country.\nSince the company’s inception, SRS has prioritized broad-based equity incentives and ownership to create meaningful financial opportunities for its employees. These initiatives had the full support of Leonard Green & Partners and Berkshire Partners, who are both members of Ownership Works, a nonprofit organization that partners with companies and investors to provide all employees with the opportunity to build wealth through their career.\nAbout LGP\nLGP is a leading private equity investment firm founded in 1989 and based in Los Angeles with over $75 billion of assets under management. The firm partners with experienced management teams and often with founders to invest in market-leading companies. Since inception, LGP has completed over 150 investments in the form of traditional buyouts, going-private transactions, recapitalizations, growth equity, and selective public equity and debt positions. The firm primarily focuses on companies providing services, including consumer, healthcare, and business services, as well as distribution and industrials. For more information, please visit www.leonardgreen.com.\nAbout Berkshire Partners\nBerkshire Partners is a 100% employee-owned, multi-sector specialist investor in private and public equity. The firm’s private equity team invests in well-positioned, growing companies across services & industrials, technology & communications, consumer, and healthcare. Since inception, Berkshire Partners has made more than 150 private equity investments and has a strong history of collaborating with management teams to grow the companies in which it invests. The firm's public equity group, Stockbridge, founded in 2007, manages a concentrated portfolio seeking attractive long-term investments. For additional information, visit www.berkshirepartners.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240618517493/en/\nContacts\nBerkshire Partners617-316-6260berkshirepartners.com\n"
    },
    {
        "Date": "2024-06-18T20:20:37.000Z",
        "Title": "Warren Buffett's Berkshire Hathaway Boosts Occidental Petroleum Stake to Almost 29%",
        "Author": "  Bill McColl ",
        "Text": "\nWarren Buffett's Berkshire Hathaway has boosted its stake in Occidental Petroleum to almost 29%.\nBerkshire bought Occidental Petroleum shares every trading day from June 5 to June 17, adding a total of 7.3 million shares.\nBuffett's firm now has 255.3 million shares of Occidental Petroleum.\n\nShares of Occidental Petroleum (OXY) edged higher Tuesday as Warren Buffett’s Berkshire Hathaway (BRK.A, BRK.B) bought up even more of the stock, boosting its stake in the energy firm to almost 29%.\nBerkshire Hathaway purchased shares every trading day from June 5 to June 17, increasing its ownership by 7.3 million shares, Securities and Exchange Commission (SEC) filings show. The prices paid ranged from $59.58 to $60.43 each.\nWith the latest buy, Berkshire has about 255.3 million shares in Occidental Petroleum, bringing Berkshire's stake to 28.8%. Occidental Petroleum is Berkshire's sixth-largest holding.\nBerkshire also has warrants to buy 83.9 million more Occidental Petroleum shares at $59.62 apiece, and owns 84,897 shares of preferred stock. A full redemption could bring Berkshire's ownership above 40%, though Buffett has previously said he wouldn't take control of the company.\nBuffett reportedly said in a CNBC interview that he began investing in the company after he read the transcript of one of its earnings reports and said “this is exactly what I would be doing.\"\nShares of Occidental Petroleum finished 1.8% higher at $61.26 Tuesday. The stock has gained about 2.6% since the start of the year.\nTradingView\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-06-04T12:15:00.000Z",
        "Title": "Can Berkshire Hathaway Stock Keep Outpacing the S&P 500?",
        "Author": "  George Budwell, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) CEO Warren Buffett is widely considered a legend on Wall Street, and for good reason. The conglomerate's portfolio has substantially outperformed the benchmark S&P 500 since Buffett became CEO in 1965.\nThe graph below illustrates this point:\nMoreover, Buffett's investing methodology runs counter to modern portfolio theory and the efficient markets hypothesis.\nModern portfolio theory advocates for diversification as a risk-management strategy. According to this theory, spreading investments across various assets reduces risk, thereby increasing the probability of generating positive annual returns.\nHowever, Buffett's approach is anything but diversified. Berkshire Hathaway's portfolio is concentrated, with approximately 50 stocks in its holdings at the time of this writing.\nMoreover, a select few equities such as Apple (NASDAQ: AAPL), Bank of America (NYSE: BAC), American Express (NYSE: AXP), Chevron (NYSE: CVX), Coca-Cola (NYSE: KO), and Occidental Petroleum (NYSE: OXY) account for a staggering 76.6% of the conglomerate's stock investments.\nBy contrast, most of Buffett's money manager contemporaries have typically crafted portfolios consisting of hundreds -- and sometimes thousands -- of equities, in line with the main tenet of modern portfolio theory.\nBuffett and his team have also overcome the potentially disadvantageous effects stemming from the legal requirement to disclose their quarterly buys and sells. The efficient market hypothesis suggests that such disclosures should nullify Buffett's edge by allowing other investors to mimic his portfolio.\nSurprisingly, this constraint hasn't significantly impacted the company's ability to deliver excess returns relative to the broader market.\nIn 2024, for instance, Berkshire Hathaway's shares have outperformed the sizzling S&P 500, and historically, the company has delivered returns in excess of the broader market by around 8 percentage points per year.\nWhen considering the likelihood of Berkshire Hathaway's stock outperforming the S&P 500, it's essential to analyze the company's principal stock holdings and key economic metrics, and then compare these with the benchmark index.\nThe six largest stock holdings in Berkshire's portfolio have an average forward price-to-earnings (P/E) ratio of 18.3 and anticipated earnings growth of 12.4% by 2025 (see table below).\nStock\nForward P/E Ratio\nProjected 2025 Earnings Growth\nApple\n29.9\n9.7%\nBank of America\n12.3\n9.6%\nAmerican Express\n18.6\n14.9%\nCoca-Cola\n22.3\n6.9%\nChevron\n12.5\n10.3%\nOccidental Petroleum\n14.5\n23.1%\n \n \n \nAverage\n18.3\n12.4%\nData source: Yahoo! Finance.\nIn contrast, the S&P 500 index is trading at a higher forward P/E ratio of 21.1, with an expected average earnings growth rate of 14.2% for the same period, according to FactSet analysts.\nAlthough Berkshire Hathaway's core stock holdings are relatively more affordable, they are projected to have a marginally lower earnings growth rate.\nTurning to Berkshire Hathaway stock itself, the company's shares are trading at a forward P/E ratio of 18.8 and are predicted to have earnings growth of 2.4% for the following year.\nThis significantly lower earnings growth rate suggests that Berkshire Hathaway's stock may not be well positioned to outperform the S&P 500 in the short term.\nStill, a deeper analysis is ultimately required to answer the original question, because Berkshire Hathaway isn't a typical stock.\nBuffett and his team have amassed a diverse portfolio of assets, including stocks, bonds, businesses, and a substantial cash reserve. This multifaceted approach sets it apart from most other companies.\nWhat does this all mean in practical terms? Due to its diverse asset portfolio, Wall Street regards Berkshire Hathaway as an exceptional hedge against broad market downturns.\nUnlike the S&P 500, which lacks built-in downside protection, Berkshire Hathaway's strategic composition provides a safety net during turbulent times.\nNow, let's explore why this distinction matters. The S&P 500's recent bull market surge owes much to the enthusiasm surrounding artificial intelligence (AI). Notably, Nvidia (NASDAQ: NVDA) -- the chipmaker at the forefront of the AI revolution -- holds the second-largest weight within the S&P 500. Consistently surpassing Wall Street's earnings expectations, Nvidia has become a linchpin for the index's performance lately.\nHowever, here's the crux: If Nvidia encounters any obstacles, ripple effects could reverberate throughout the entire U.S. stock market. In contrast, Berkshire Hathaway maintains limited exposure to this AI-centric theme. Its substantial focus lies in sectors such as finance, energy, and consumer goods, shielding it to a degree from the hype surrounding AI.\nAlthough Apple is Berkshire Hathaway's largest holding by a country mile, the tech giant doesn't rely on AI to fuel sales. Instead, Apple leverages its loyal customer base to drive sales of its iconic iPhone. Berkshire Hathaway, in turn, isn't overly reliant on AI to drive its share-price performance, counter to the broader market.\nBerkshire Hathaway's ability to outperform the S&P 500 in the short term hinges on Nvidia's trajectory. Should Nvidia continue to exceed Wall Street's estimates by a wide margin, Buffett's conglomerate is unlikely to best the S&P 500 over the next 18 months.\nHowever, a more profound concern looms: The S&P 500 appears markedly overvalued based on its cyclically adjusted price-to-earnings ratio. Furthermore, its bull run appears overly reliant on a single stock.\nPerhaps most concerning is that Nvidia's shares are trading at over 42 times forward earnings. This premium valuation may be warranted, but it also suggests that a fair amount of the chipmaker's near-term upside is already accounted for, curtailing its power to drive the S&P 500 much higher.\nIf investors balk at paying this hefty premium for Nvidia, Berkshire Hathaway should deliver superior results relative to the benchmark index over the next 18 months.\nIn other words, Nvidia stock may lose momentum as investors search for more attractive growth vehicles. This dynamic that favors companies like Berkshire Hathaway -- namely, ones that aren't entirely dependent on AI to create shareholder value.\nBerkshire Hathaway, despite its unfavorable econometrics relative to the S&P 500, could thus deliver strong returns for shareholders over the remainder of 2024 and the whole of 2025 if this scenario plays out.\nThat's a testament to Buffett's slow-and-steady approach to value creation, which has consistently beaten the broader markets over the past seven decades and counting.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $671,728!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nBank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. George Budwell has positions in Apple. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, and Nvidia. The Motley Fool recommends Occidental Petroleum. The Motley Fool has a disclosure policy.\nCan Berkshire Hathaway Stock Keep Outpacing the S&P 500? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-24T14:11:30.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 400 million shares of The Coca-Cola Company (NYSE:KO) stock, which is roughly 9.3% of the company. And it's a significant stake for Berkshire, representing approximately 6.5% of its portfolio.\nCoca-Cola is one of the world's leading beverage companies and it currently rewards its shareholders with a quarterly dividend of $0.485 per share, equating to an annual dividend of $1.94 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk has reportedly bought 6,000 acres of land just outside of this city. Here’s how to invest in its growth before he floods it with new tech workers.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of Coca-Cola: 400,000,000\nCoca-Cola annual dividend per share: $1.94\nTotal Annual Dividend = 400,000,000 x 1.94\nResult: $776,000,000\nBerkshire Hathaway will receive $776 million in dividends from Coca-Cola this year based on its current dividend rate. This equates to $194 million quarterly, or about $2.13 million daily.\nThe income Berkshire earns from Coca-Cola aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Coca-Cola has raised its annual dividend payment for 62 consecutive years, so Berkshire's annual income will likely grow in the years ahead.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nCOCA-COLA (KO): Free Stock Analysis Report\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Investment in Coca-Cola Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-07T09:41:00.000Z",
        "Title": "What Should Berkshire Hathaway Buy With Its $189 Billion in Cash?",
        "Author": "  Matt Frankel and Tyler Crowe, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) had $189 billion in cash and Treasury securities on its balance sheet at the end of the first quarter, and there's a good chance it will exceed $200 billion by mid-year. In this video, Fool.com contributor Matt Frankel discusses one popular food service brand he thinks would be a smart acquisition for Berkshire, and Tyler Crowe explains why Warren Buffett isn't likely in a hurry to do anything at all.\n*Stock prices used were the morning prices of May 30, 2024. The video was published on May 31, 2024.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $750,197!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 3, 2024\nMatt Frankel has positions in Berkshire Hathaway and Starbucks. Tyler Crowe has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends Berkshire Hathaway, Lennar, and Starbucks. The Motley Fool has a disclosure policy.\nMatthew Frankel is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link, they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\nWhat Should Berkshire Hathaway Buy With Its $189 Billion in Cash? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-29T22:26:00.000Z",
        "Title": "Where Will Berkshire Hathaway Be in 10 Years?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock has been a terrific investment for patient shareholders. Since 1965, shares have risen in value by nearly 4,000,000%.\nBut what does the future look like for this iconic company? The answer might surprise you.\nWarren Buffett's claim to fame is that he has been able to consistently beat the market for far longer than nearly anyone else. That's an incredibly difficult feat to pull off. Over the past 20 years, around 95% of funds failed to beat their index. Buffett, meanwhile, has trounced the index. Since inception, shares of Berkshire Hathaway have averaged annual returns of around 20%, roughly double the rate of the S&P 500 over the same time period.\nThere's only one problem: Berkshire's returns have slowed heavily in recent years. Over the past decade, for instance, Berkshire stock underperformed the market by around 2%. This is a rare occurrence, but it makes sense given the company's circumstances. In the 1980s, for instance, Berkshire stock regularly rose more than 30% in value in a single year. In 1985, it nearly doubled in value. Over the last decade, however, it failed to achieve annual returns of 30% or more even once. The issue isn't poor investing, but that the game has grown significantly more difficult.\nIn 1999, Buffett joked that he could post 50% annual returns if he managed only $1 million. \"It's a huge structural advantage not to have a lot of money,\" he explained. \"I think I could make you 50% a year on $1 million. No, I know I could. I guarantee that.\"\nToday, Berkshire's cash pile alone is worth around $189 billion. Its total market cap is around $900 billion. For the stock to rise 10%, the company would need to add another $90 billion in value. To put that into perspective, around 400 of the companies in the S&P 500 have market caps under $90 billion. To add another 10% to its stock price, Berkshire essentially needs to create enough value that would, on its own, be one of the top 100 most valuable companies in America. Then it needs to replicate this feat again the following year to an even larger degree.\nWhatever happens to Berkshire over the next decade, one thing is clear: Its returns likely won't match anything it has achieved in previous decades. The company is simply too big to keep doubling in size at the rate it's used to. \"There remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others,\" Buffett wrote in a recent shareholder letter. \"All in all, we have no possibility of eye-popping performance.\"\nThe second thing to expect is for Berkshire to increasingly be run by people other than Buffett, who will turn 94 this summer. Already, Buffett has handed over large sections of the portfolio to trusted lieutenants, including Todd Combs and Ted Weschler. It has been reported that one of these men initiated Berkshire's $189 billion bet on Apple, one of the largest and most successful Berkshire investments in recent history.\nFor his part, Buffett isn't worried about the transition. He's had succession plans in place for some time, and his recent letter shows confidence that these patient personnel investments will pay off. \"By both luck and pluck, a few huge winners have emerged from a great many dozens of decisions,\" Buffett wrote. \"And we now have a small cadre of longtime managers who never muse about going elsewhere and who regard 65 as just another birthday.\"\nWhere will Berkshire be ten years from now? Trusted lieutenants including Combs and Weschler have already been with the company for years. Guided by their experience and acumen, expect Berkshire's current portfolio of public and private business to do well. But it will be harder than ever for the company to beat the market by any significant margin. This is still a wonderful business to bet on, but the decade ahead will likely be characterized by slow and steady moves that focus more on patient asset allocation than superstar bets.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $757,001!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of June 24, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWhere Will Berkshire Hathaway Be in 10 Years? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-06-21T13:54:04.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends Annually From Its Stake In Apple Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 789,368,450 shares of Apple (NYSE:AAPL) stock, which is roughly 5.1% of the company. And it's a significant stake for Berkshire, representing over 40% of its portfolio.\nApple is one of the world's leading technology companies and it currently rewards its shareholders with an annual dividend of $1 per share, not to mention its consistent share repurchase activity. Let's find out how much Berkshire will earn in dividends from its stake in Apple.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. \nSo...\nBerkshire shares of Apple: 789,368,450\nApple annual dividend per share: $1.00\nTotal Annual Dividend = 789,368,450 x 1.00\nResult: $789,368,450\nBerkshire Hathaway will receive about $789.4 million in dividends annually from its investment in Apple, which does not include reinvesting those dividends. If those dividends were reinvested, the annual dividend income would grow along with its total share count in its portfolio.\nThe income Apple offers aligns with Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Apple has raised its annual dividend payment for 13 consecutive years, so Berkshire's annual income will likely grow year after year.\nKeep Reading:\nThe average millionaire has 7 sources of income. Here are 3 passive income opportunities you can add today.\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends Annually From Its Stake In Apple Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    },
    {
        "Date": "2024-06-20T13:00:00.000Z",
        "Title": "Who are the top executives at Berkshire Hathaway?",
        "Author": "  Brian Baker, CFA ",
        "Text": "Most investors are familiar with Berkshire Hathaway, the conglomerate run by Warren Buffett with a diverse portfolio of businesses and securities that include a railroad, utility businesses, vast insurance operations including Geico, and even Dairy Queen. Berkshire’s stock portfolio includes large positions in companies such as Apple, Bank of America, Coca-Cola and Chevron.\nWhile much is known about Buffett and his investment philosophy, other executives at the company are less widely followed. Since the death of Buffett’s longtime partner and Berkshire vice chairman Charlie Munger last November, attention has shifted to who will be in charge once Buffett is no longer running the company.\nHere’s a look at the top corporate leaders at Berkshire Hathaway including the person who’s likely to become the successor to Buffett as CEO.\nBuffett is among the greatest investors ever and built Berkshire from a struggling textile business in the 1960s into the financial powerhouse it is today by redeploying the company’s cash flow to the most attractive opportunities.\nOver time, Buffett has looked for businesses that earn decent returns on capital that are selling for less than they’re worth. He took over Berkshire in 1965 and has been at the helm ever since. As of June 2024, Buffett’s net worth was about $135 billion, according to Bloomberg, making him the 10th richest person in the world.\nGreg Abel came to Berkshire as part of its acquisition of a stake in MidAmerican Energy, now known as Berkshire Hathaway Energy, in 1999. Abel served as CEO of BHE from 2008 to 2018 and has regularly earned the praise of Buffett. He first mentioned Abel in his 2002 letter to shareholders, calling him a “huge asset for Berkshire.”\nIn 2018, Abel was named vice chair of non-insurance operations for Berkshire, leading many observers to wonder if he’d one day take over for Buffett as CEO. At the company’s 2021 annual meeting, Munger accidentally revealed Abel as Buffett’s successor. In 2024, Buffett told shareholders he thought Abel should be in charge of investment decisions once he takes over as CEO.\nAjit Jain joined Berkshire in 1985 and has built the insurance operation into a behemoth. He specializes in underwriting unique risks that have often brought billions of dollars to Berkshire in premiums. Jain was named vice chair of the insurance businesses in 2018 and serves on the Berkshire board of directors as well.\nBuffett has often praised Jain’s abilities and has even suggested that Jain is more important to Berkshire than he is. “If Charlie, I and Ajit are ever in a sinking boat – and you can only save one of us – swim to Ajit,” Buffett wrote in his 2009 letter to shareholders.\nTodd Combs joined Berkshire as an investment manager in 2010 after the retirement of Lou Simpson, who had managed Geico’s investments for decades. Prior to joining Berkshire, Combs managed a hedge fund for five years and had previous experience working at Progressive Insurance and at the State of Florida Banking, Securities and Finance Division. He was named CEO of Geico in 2020 and also serves on the board of JP Morgan Chase.\nCombs relocated to Omaha, where Berkshire is headquartered, and often meets with Buffett to discuss various business matters. Buffett was introduced to Combs by Charlie Munger, whom Combs had reached out to for an impromptu meeting. Munger and Combs hit it off and Munger thought he’d be a good fit for Berkshire.\nThe second investment manager Buffett has hired in recent years is Ted Weschler, who joined Berkshire in 2012 after running a hedge fund from his office above a bookstore in Charlottesville, Virginia for about 11 years. Weschler first met Buffett through an online charity auction where he paid about $2.6 million two years in a row to have lunch with Buffett.\nIn 2021, an investigation by ProPublica into Roth IRAs revealed that Weschler had grown his account from about $70,000 at the end of 1989 to $264.4 million at the end of 2018. Weschler told ProPublica that the gains were made solely through publicly traded securities such as stocks and bonds.\n"
    },
    {
        "Date": "2024-06-03T21:58:50.000Z",
        "Title": "NYSE glitch sends Berkshire Hathaway shares down nearly 100%",
        "Author": "  Kate Gibson ",
        "Text": "The New York Stock Exchange on Monday said it had resolved a technical problem that has Class A shares of Warren Buffett's Berkshire Hathaway seemingly down almost 100%.\nThe issue prompted trading to be halted in Berkshire's A-class shares, along with about a dozen other companies, including Barrick Gold and Nuscale Power, both of which also showed faulty and steep declines. Trading continued in Berkshire's B-class shares.\nThe trouble arose shortly after the opening bell, impacting the likes of Chipotle Mexican Grill, Abbott Laboratories and other stocks. A list of impacted stocks can be seen here.\n\"A technical issue involving industrywide price bands published by the Consolidated Tape Association's Securities Information Processor triggered 'limit-up/limit down' trading halts on up to 40 symbols listed on NYSE Group exchanges. Shortly before noon, the issue was resolved and trading in the impacted stocks resumed,\" a spokesperson for the exchange said in an email. \"The NYSE is reviewing potentially impacted trades.\"\nReality, as Trump supporters see it\nTrump fake elector in Wisconsin describes how he says he was tricked | 60 Minutes\nTrump's guilty verdict: A stress test for democracy\n"
    },
    {
        "Date": "2024-06-25T14:22:00.000Z",
        "Title": "Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Kroger Stock",
        "Author": "  Joey Solitro ",
        "Text": "Warren Buffett's Berkshire Hathaway (NYSE:BRK) owns 50 million shares of Kroger (NYSE:KR) stock, which is roughly 6.9% of the company. And while it's a large percentage of Kroger, it only represents approximately 0.6% of Berkshire's portfolio.\nKroger is one of the largest retailers in the United States, primarily operating supermarkets, and it currently rewards its shareholders with a quarterly dividend of $0.29 per share, equating to an annual dividend of $1.16 per share. Let’s find out how much Berkshire will earn in dividends from its stake.\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\nElon Musk has reportedly bought 6,000 acres of land just outside of this city. Here’s how to invest in its growth before he floods it with new tech workers.\nTo determine the total annual dividend income from this investment, we multiply the number of shares by the annual dividend per share:\nTotal Annual Dividend = Number of Shares x Annual Dividend per Share\nSo...\nTrending: This real estate fund backed by Uber CEO Dara Khosrowshahi gives you instant access to a portfolio of rental properties, and you only need $100 to get started.\nBerkshire shares of Kroger: 50,000,000\nKroger annual dividend per share: $1.16\nTotal Annual Dividend = 50,000,000 x 1.16\nResult: $58,000,000\nBerkshire Hathaway will receive approximately $58 million in dividends from Kroger stock this year based on its current dividend rate, which equates to approximately $14.5 million quarterly.\nThe income Berkshire earns from Kroger aligns with Warren Buffett’s investment philosophy, which emphasizes steady, predictable returns – and it's also worth noting that Kroger has raised its annual dividend payment for 17 consecutive years, so Berkshire's dividend income will likely continue to grow in the years ahead.\nKeep Reading:\nThis Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100.\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US.\nImage Credit: Shutterstock\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\nGet the latest stock analysis from Benzinga?\nThis article Here's How Much Warren Buffett's Berkshire Hathaway Earns In Dividends From Its Stake In Kroger Stock originally appeared on Benzinga.com\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n"
    }
]