[
    {
        "Date": "2024-07-23T23:33:00.000Z",
        "Title": "Warren Buffett's Berkshire sheds Bank of America stock",
        "Author": "  Dan Weil ",
        "Text": "Legendary investor Warren Buffett, chief executive of Berkshire Hathaway  (BRK.B) , has succeeded in a wide variety of industries, including financial services.\nPremiums from his insurance holdings finance much of his other investments. Buffett began accumulating shares of insurer GEICO in 1951. It’s now wholly-owned by Berkshire, representing a foundational part of Buffett’s holdings.\nBerkshire helped ensure the U.S. financial system’s stability with purchases of Goldman Sachs equity in the financial crisis of 2008 and of Bank of America stock during a turbulent period in 2011. Berkshire also made hefty profits for itself with the deals.\nBuffett has also had great success with his investment in credit card titan American Express  (AXP) . Berkshire owned $37.5 million of its shares, as of March 31.\nKevin Dietsch/Getty Images\nBerkshire’s biggest positions in financial stocks (all as of March 31, except as noted) are:\nBank of America  (BAC) , with Berkshire’s stake worth $42.5 billion as of July 19\nAmEx, worth $37.5 million\nSecurities ratings agency Moody’s  (MCO) , worth $11.2 billion\nInsurance company Chubb  (CB) , worth $6.8 billion\nBanking titan Citigroup  (C) , worth $3.6 billion\nAs for banks, Berkshire held JPMorgan Chase, Wells Fargo, U.S. Bancorp and Bank of New York Mellon in the past.\nRelated: Analysts revamp Berkshire stock outlook after Warren Buffett meeting\nBuffett offered an interesting assessment of the banking industry in 1996, as cited by Business Insider. \"It's a business that can be a very good business, when run right,” said the Oracle of Omaha (Berkshire is based there).\n“There's no magic to it. You just have to stay away from doing something foolish. It's a little like investing. You don't have to do anything very smart. You just have to avoid doing things that are ungodly dumb.\"\nLast week, Berkshire sold about 34 million shares of Bank of America for $1.5 billion. Given that Berkshire still has a huge position — it’s the bank’s biggest shareholder by far — the sale could just represent profit-taking.\nBofA has jumped 27% so far this year to a quote of $42.60. That’s three times Berkshire’s average purchase price of $14 for all of its BofA shares, according to Barron’s. So there’s plenty of profits to take.\nBut Buffett also could be taking the first step on the road to completely exit BofA. Or Berkshire, which now has a 12.8% stake in BofA, may just want to drive its stake below 10%, Barron’s writer Andrew Bary noted.\nThat way it wouldn’t have to report trades of the stock to the Securities and Exchange Commission within two business days.\nMeanwhile, Bank of America released its second-quarter earnings last week, and most analysts gave the news a positive reception.\n“The biggest highlight was the company's encouraging net interest income (NII) outlook for the remaining half of the year,” Morningstar analyst Suryansh Sharma wrote in a commentary.” NII is the difference between a bank’s interest revenue and its interest expenses.\nFund manager buys and sells:\nGoldman Sachs offers 3 high-conviction stock picks\nCathie Wood unloads shares of rebounding tech titan\nVeteran fund manager sees world of pain coming for stocks\nManagement expects NII to rise to around $14.5 billion by the fourth quarter from $13.9 billion in the current quarter, he said.\n“Profitability in the second half should also be boosted by expense control and relatively strong fee income in the asset-management, investment banking, and trading businesses.”\nSharma plans to increase his $38 fair value estimate for BofA’s stock price by a mid-single digit percentage soon. He assigns the bank a wide moat, meaning he thinks it has competitive advantages that will last at least 20 years.\nRelated: Veteran fund manager sees world of pain coming for stocks\nThe author owns shares of Berkshire Hathaway, Bank of America and Goldman Sachs.\n"
    },
    {
        "Date": "2024-07-15T20:42:19.000Z",
        "Title": "Buffett's Berkshire Hathaway sets, closes at record high",
        "Author": "  Jonathan Stempel ",
        "Text": "By Jonathan Stempel\n(Reuters) -Berkshire Hathaway's share price set a record high on Monday, reflecting investors' confidence in Warren Buffett's company, which is often regarded as a microcosm of the broader American economy.\nThe price of Berkshire's Class A shares closed up 2.1% at $652,997.17. They earlier reached $653,861, surpassing the previous high of $647,039 set on Feb. 26. Berkshire's more widely held Class B shares are worth about 1/1,500th as much.\nMonday's gain boosted the market value of Omaha, Nebraska-based Berkshire to approximately $937 billion, based on reported shares outstanding. The stock trades at about 23 times the full-year operating profit that analysts project.\nSome stock price services show Berkshire's record-high Class A share price was $741,971 on June 3. That appears to reflect a glitch that also caused the price of the Class B shares to briefly fall more than 99% that day.\nBerkshire owns dozens of insurance, energy, manufacturing, retail and service businesses including Geico car insurance, the BNSF railroad, Berkshire Hathaway Energy and Dairy Queen ice cream.\nIt also owns a huge stock portfolio led by Apple, whose share price has risen 37% since the end of March.\nDespite having donated more than half his Berkshire stock since 2006, the 93-year-old Buffett still owns about 14.5% of the company, worth about $135.8 billion.\nHis overall fortune is about $137 billion, making him the world's eighth-richest person, Forbes magazine said on Monday.\nBerkshire shares have risen 20% this year, compared with an 18% gain in the Standard & Poor's 500.\nOver the last decade, Berkshire shares have performed close to the index, but with less volatility, after accounting for dividends. Berkshire does not pay a dividend.\n(Reporting by Jonathan Stempel in New York; Editing by Chizu Nomiyama, Jan Harvey and Matthew Lewis)\n"
    },
    {
        "Date": "2024-07-30T14:00:14.000Z",
        "Title": "Berkshire Hathaway Inc. (NYSE:BRK.A) is favoured by institutional owners who hold 55% of the company",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Institutions' substantial holdings in Berkshire Hathaway implies that they have significant influence over the company's share price\nA total of 25 investors have a majority stake in the company with 49% ownership\n 15% of Berkshire Hathaway is held by insiders\nA look at the shareholders of Berkshire Hathaway Inc. (NYSE:BRK.A) can tell us which group is most powerful. We can see that institutions own the lion's share in the company with 55% ownership. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nGiven the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait.\nLet's take a closer look to see what the different types of shareholders can tell us about Berkshire Hathaway.\n View our latest analysis for Berkshire Hathaway \nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\nAs you can see, institutional investors have a fair amount of stake in Berkshire Hathaway. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Berkshire Hathaway's earnings history below. Of course, the future is what really matters.\nInstitutional investors own over 50% of the company, so together than can probably strongly influence board decisions. Berkshire Hathaway is not owned by hedge funds. Looking at our data, we can see that the largest shareholder is the CEO Warren Buffett with 14% of shares outstanding. With 6.9% and 5.1% of the shares outstanding respectively, The Vanguard Group, Inc. and BlackRock, Inc. are the second and third largest shareholders.\nA deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority.\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. There is a little analyst coverage of the stock, but not much. So there is room for it to gain more coverage.\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\nMost consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group.\nIt seems insiders own a significant proportion of Berkshire Hathaway Inc.. Insiders own US$140b worth of shares in the US$944b company. That's quite meaningful. Most would be pleased to see the board is investing alongside them. You may wish to access this free chart showing recent trading by insiders.\nWith a 30% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Berkshire Hathaway. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\nWhile it is well worth considering the different groups that own a company, there are other factors that are even more important. Case in point: We've spotted   1 warning sign for Berkshire Hathaway  you should be aware of.\nUltimately the future is most important. You can access this free report on analyst forecasts for the company.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n"
    },
    {
        "Date": "2024-07-27T08:18:00.000Z",
        "Title": "3 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "Warren Buffett and Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) are two of the most famous names on Wall Street today. They go hand in hand as well, because Buffett is the CEO of Berkshire. If you are looking to invest now, this massive and unique conglomerate could be a very attractive option. Here are three reasons why.\nWhile diversification isn't exactly sexy, it is a key aspect of successful long-term investing. You can go about diversification in different ways. For example, you can buy a lot of different stocks from a variety of industries, which is a good idea. Or you can look for investments that have diversification built into their model. Berkshire Hathaway falls into that second category.\nIts largest operations are in the transportation, utility, pipelines, and insurance industries. But the company also owns businesses in the retail, chemical, real estate, and manufacturing sectors, too, among others. In fact, the list of owned businesses is so long that it is hard to keep track of everything going on under the Berkshire umbrella. On top of that, it owns a portfolio of individual stocks, in which it owns just a portion of a given company. That portfolio includes household names like Coca-Cola, Chevron, and American Express.\nAll told, Buffett has a somewhat eclectic investment style. He tends to buy good companies when they are attractively priced and then he just holds them, letting management do their jobs. If there's a problem, he'll step in to help, but otherwise he is pretty hands-off. Handing off your investments to an expert with a diversified portfolio is the first big reason to consider Berkshire Hathaway.\nGiven the diversification of Berkshire Hathaway's portfolio and its huge $940 billion market cap, it takes a lot to move the needle on the top and bottom lines. Buffett actually made sure to point that out in the company's 2023 annual shareholder letter:\nThere remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others. Some we can value; some we can't. And, if we can, they have to be attractively priced. Outside the U.S., there are essentially no candidates that are meaningful options for capital deployment at Berkshire. All in all, we have no possibility of eye-popping performance.\nGiven the long-term success Berkshire Hathaway has achieved in beating the market, this may at first seem like a huge letdown. It probably shouldn't be viewed that way, because it means that, given the size of the company, it is a proxy for the broader market in some ways. And with the stock market near all-time highs, that's not a bad thing. But read Buffett's statement more closely, and you'll see he is really only saying that Berkshire Hathaway's disciplined investment style isn't turning up any good buy candidates right now.\nIf your choice is an index fund or Berkshire Hathaway, the outcome could be a wash in the near term, which is another point in Berkshire Hathaway's favor in a market that's trading near all-time highs. But looking out over the long term, things could be very different.\nOver the long term, one of the biggest strengths Berkshire Hathaway has exhibited is its ability to be opportunistic. Buffett and his team only pounce when they believe they've found a good deal on a well-run company. While Buffett makes mistakes from time to time, he has been right far more often than he has been wrong. Right now, he's not seeing anything worth buying, but bear markets inevitably follow bull markets, so the time will eventually come for buying stocks again.\nWhen that happens, Berkshire Hathaway will have plenty of firepower. At the end of the first quarter, the balance sheet had over $28 billion in cash and $153 billion of short-term marketable securities (government notes). That is all money that could be put toward long-term portfolio investments if -- the key word is if -- an attractive opportunity arose. If history is any guide, this is the catalyst that will unlock long-term outperformance. You just have to be patient and settle for market-like returns over the near term.\nSo, in the near term, buying Berkshire Hathaway will get you a large, diversified business that's likely to track the market. But it has a catalyst -- that huge cash hoard -- that could spur long-term outperformance. That's a good reason to buy Berkshire Hathaway today if you are looking to put some cash of your own to work but aren't quite sure what to do with it. In fact, if your choice is between Berkshire Hathaway and a broad-based index fund, it seems like it could be an easy call to go with Berkshire.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $688,005!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 22, 2024\nAmerican Express is an advertising partner of The Ascent, a Motley Fool company. Reuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool has a disclosure policy.\n3 Reasons to Buy Berkshire Hathaway Stock Like There's No Tomorrow was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-13T18:01:10.000Z",
        "Title": "Warren Buffett is turning 94 next month. Should Berkshire investors start to worry?",
        "Author": " Allan Sloan    · Contributing columnist",
        "Text": "Happy Birthday, Warren!\nThe legendary Warren Buffett turns 94 next month — Aug. 30 to be exact. And as is frequently the case when he turns a year older, investors wonder what a post-Buffett Berkshire Hathaway will look like. That’s especially true this year, with Buffett’s longtime partner Charlie Munger having passed away last year and CEO-designate Greg Abel waiting in the wings.\nI’m a Berkshire investor myself, and I don’t plan to go anywhere when Buffett is no longer part of the show. If you are a Berkshire shareholder, you might want to keep your powder dry as well.\nWhy? For one thing, Greg Abel seems unlikely to mess up the formula. And — ironically — because Berkshire’s days as a marvelous investment seem to be over, its astounding long-term record under Buffett notwithstanding. In many ways, Berkshire has become more like an index fund than a conventional corporation.\nSo it’s not as if something magical will depart when Buffett does.\nAccording to Berkshire’s most recent annual report, the stock returned 4,384,748% to its investors from the time Buffett took control in 1965 through the end of last year. That’s 140 times the 31,223% return for the S&P 500 (^GSPC), the standard market benchmark.\nBut that was then, and this is now.\nAs I’ll show you, recent Berkshire investors — including my wife and me — haven’t done remotely as well relative to the rest of the market as Buffett and his early followers have done.\nA little background is in order.\nFor most of my career, I didn't own Berkshire because I was an employee of publications that frequently wrote about Buffett. So I never bought any shares during Berkshire’s salad days, much as I wanted to.\nBut on Jan. 7, 2016, the first week that I became self-employed, my wife and I made a modest purchase of Berkshire stock in our joint brokerage account and have held it ever since.\nAnd guess what? The huge long-term advantage that Berkshire shows compared with the S&P 500 has totally disappeared since our purchase. In fact, we’d have been a bit better off buying an S&P 500 index fund than buying Berkshire.\nFrom our purchase date through last Monday, Berkshire was up a respectable 214%. That was also its total return because it didn’t pay any dividends during that period. However, during that same period, Admiral-class shares of Vanguard’s S&P 500 index fund returned 232%, including reinvested dividends, according to calculations that Jeff DeMaso, editor of the Independent Vanguard Adviser, did for me.\nIn other words, my wife and I got into Berkshire when its stock market glory days had passed.\nAnd that — strange as it may seem — is a major reason that I’m not concerned with what Greg Abel will do at Berkshire when Buffett passes from the scene. Last December, shortly after the death of Charlie Munger, Buffett’s longtime partner in running Berkshire (and my longtime friend), I wrote that I saw no compelling reason for my wife and me to sell our Berkshire stock.\nI still feel that way because there’s no reason to think that Abel will change the company drastically if he ends up running it when Buffett ceases to be involved. After all, Abel, who’s 62, has spent almost 25 years working for Berkshire, and Buffett named him his heir apparent three years ago. Abel seems to be a Buffetteer through and through.\nIn addition, you can make the case that Berkshire, which owns lots of different, unrelated US businesses, including big chunks of stock in Apple, Coca-Cola, and American Express and numerous other US and Japanese companies and batches of other assets, is sort of an index fund itself. (What's a more vanilla investment than that?)\nThen there’s the tax question — which may or may not apply to you. My wife and I bought our Berkshire in a taxable account because I knew it was highly unlikely that the company would pay any dividends while Buffett was involved with it. So selling now would mean forking over more than 30% of our 200%-plus Berkshire profit to the IRS and our state government.\nA final reason that I feel no compulsion to sell Berkshire just because of a likely management change is that companies' founders or longtime chief executives are often succeeded by competent replacements.\nFor example, Tim Cook has done a fine job since taking control of Apple (AAPL) from legendary co-founder Steve Jobs in 2011. And Walmart (WMT) didn’t blow up — and actually thrived over time — when the legendary Sam Walton died in 1992 and was succeeded by David Glass.\nSo, my inclination is to stick with Berkshire and see what happens if I outlast Buffett. And who knows? Should the stock drop sharply when Buffett passes from the scene, I may be tempted to buy some more of it.\nMaya Benjamin contributed research to this story.\nAllan Sloan, a contributor to Yahoo Finance, is a seven-time winner of the Loeb Award, business journalism’s highest honor.\n"
    },
    {
        "Date": "2024-07-22T16:25:37.000Z",
        "Title": "Buffett's Berkshire Hathaway trims Bank of America stake",
        "Author": "Investing.com ",
        "Text": "Investing.com - Berkshire Hathaway Inc Class A (NYSE:BRKa), the multinational conglomerate helmed by famed investor Warren Buffett, has divested a substantial portion of its Bank of America (NYSE:BAC) stock. The divestiture, executed over several transactions, totaled approximately $1.48 billion.\nOver a three-day period last week, Berkshire Hathaway offloaded 33.9 million shares of Bank of America. Although this reduced the company's holdings by about $1.5 billion, Berkshire Hathaway still holds nearly 1 billion shares of the bank in its portfolio, equating to an almost 13% stake.\nThe news of the sale led to a drop in Bank of America's shares during intraday trading on Monday, while Berkshire Hathaway's shares remained relatively stable. As per a regulatory filing on Friday, the company sold the shares at per-share prices ranging from $43.13 to $44.07.\n⚠️Track your favourite companies with InvestingPro! Our Summer Sale is now on, use coupon code INVPRODEAL and save over 50%!⚠️\nDespite the sell-off, Berkshire Hathaway continues to own approximately 999 million shares of Bank of America, valued at more than $42 billion. This makes Bank of America the second-largest investment in Berkshire Hathaway's portfolio, following Apple (NASDAQ:AAPL).\nBank of America's shares experienced a two-year high last week but have been on a downward trend since then, falling by about 1% as of noon ET Monday.\nDespite the recent decline, the bank's shares are still up over 25% year-to-date.\nRelated Articles\nBuffett's Berkshire Hathaway trims Bank of America stake\nUBS: GLP-1 obesity market to reach $90bn by 2029\nOil market forecasts surplus in 2025, predicts Morgan Stanley\n"
    },
    {
        "Date": "2024-07-15T09:55:00.000Z",
        "Title": "Is Berkshire Hathaway a Millionaire Maker?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "If you look at the history of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock, it has trounced the market over the long term. There are many people who have ridden CEO Warren Buffett's success to millionaire status. But what about the future? Is Berkshire Hathaway still a millionaire-maker stock? That's a hard question to answer.\nBerkshire Hathaway is an insurance company. It's a transportation company. It's a utility. It's a midstream company. It's a manufacturer. It's a retailer. It is a lot of things all under one roof, and that list is actually not complete because there are still more businesses hidden under the covers. At the end of the day, Berkshire Hathaway is a conglomerate. But it's not like most other conglomerates, either.\nWarren Buffett is famous as an investor. And that's how he looks at Berkshire Hathaway. So the company is almost like a mutual fund. He buys companies he thinks are good, well run, and priced attractively. That includes investing in the shares of a company as well as buying companies in their entirety. But Buffett doesn't actually run any company in which he invests; he hires good managers to do that. Buffett just keeps tabs on what's going on, only stepping in when there is a legitimate need.\nThis approach has worked out incredibly well for investors. Since just the turn of the century, Berkshire Hathaway's stock price has increased roughly 990%. The S&P 500 index's total return, which assumes dividend reinvestment, was only 490% or so. Looking only at price performance, the S&P rose just 280% or so. Note that Berkshire Hathaway does not pay dividends, so its total return is equal to its stock performance.\nBut investing is about looking to the future. So what can investors expect from Berkshire Hathaway stock from this point, after it has rewarded investors with such a huge level of outperformance? Warren Buffett is pretty clear:\nThere remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others. Some we can value; some we can't. And, if we can, they have to be attractively priced. Outside the U.S., there are essentially no candidates that are meaningful options for capital deployment at Berkshire. All in all, we have no possibility of eye-popping performance.\nThat's not a great prognosis, with Buffett basically suggesting that Berkshire Hathaway will end up providing S&P 500-like returns. For starters, that's not such a bad thing. But don't forget how Buffett invests. His comment about not being able to find needle-moving investments is being made in 2024 when the stock market is near all-time highs.\nWhat if the stock market sells off? Historically speaking, bear markets always follow bull markets and bring with them investment opportunities. Buffett is a patient investor, only investing when he believes he's found a stock worth buying. In fact, Buffett's approach shines in bad markets, as he generally has the capital saved up to put money to work when others are fearful. At the end of the first quarter, for example, Berkshire Hathaway had over $180 billion in cash and short-term investments sitting on its balance sheet just waiting to be used.\nAlthough Berkshire Hathaway is a gigantic company and future growth may not live up to past performance, don't count this company out. It has a very unique business approach that allows it to take advantage of market weakness. When the market is hot, as it is today, Buffett's approach is out of step and the company he runs will lumber along.\nBut when the next bear market comes along, Berkshire Hathaway is highly likely to take the actions necessary to lead to above average long-term performance. This company may not be the millionaire maker it once was, but that doesn't mean it has lost the ability to make investors rich.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway a Millionaire Maker? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-26T07:38:00.000Z",
        "Title": "Berkshire (BRK.B) Rises 24% YTD: What Should Investors Do Now?",
        "Author": "  Tanuka De ",
        "Text": "Shares of Berkshire Hathaway Inc. (BRK.B) have gained 23.8% year to date, outperforming the industry’s 22.6% growth, the Finance sector’s rise of 18.2% and the S&P 500 composite’s rise of 19.3%.  Berkshire Hathaway is a conglomerate with more than 90 subsidiaries engaged in diverse business activities. Per Warren Buffett, its “strength comes from its Niagara of diverse earnings delivered after interest costs, taxes and substantial charges for depreciation and amortization.” Its property and casualty insurance business, one of the largest property and casualty insurance companies, generates the maximum return on equity.\nImage Source: Zacks Investment Research\nBerkshire shares are trading well above the 50-day moving average, indicating a bullish trend. Shares are trading near the high end of its 52-week range. \nImage Source: Zacks Investment Research\nAmong its diverse business activities, the most important is its insurance operations, which contribute around one-fourth of Berkshire’s top line. The insurance business is poised for long-term growth, banking on increased exposure, prudent underwriting standards and better pricing. Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. Notably, Berkshire generated underwriting profit in 18 of the last 20 years. However, when catastrophes occur, like other insurers, Berkshire’s underwriting profitability is affected, resulting in a deterioration of its combined ratio. In a favorable interest rate environment, it derives higher interest income from short-term investments.Berkshire Hathaway’s economically sensitive non-insurance businesses — Utilities and Energy, and Manufacturing, Service and Retail — are performing well. The Utilities and Energy business has grown with increased revenue contributions from Burlington Northern SantaFe Corp. However, unfavorable changes in the business mix and lower fuel surcharge revenues are areas of concern. Nonetheless, lower fuel costs are expected to limit any downside.  Demand for utilities is expected to be strong in the future and drive earnings growth. Increasing demand for goods and services, given an improved economic backdrop, should benefit its Manufacturing, Service and Retail operations. Collectively, these have driven revenues higher and facilitated margin expansion over the past many years.With a huge cash hoard, we believe Berkshire Hathaway will successfully continue its acquisition spree, acquiring entities that have consistent earning power and generate impressive returns on equity. While big acquisitions open up more business opportunities for the company, bolt-on acquisitions enhance the earnings of the existing business.  Warren Buffett has always eyed acquisitions or made investments in properties that are undervalued or have potential for growth. Investments in Coca-Cola KO and American Express AXP show the investment acumen of Warren Buffet and Charlie Munger. Berkshire Hathaway also has stakes in behemoths like Apple, Bank of America, Chevron and Occidental Petroleum.Also, Berkshire Hathaway's liquidity helps it repurchase shares regularly. It bought back shares worth $2.6 billion in the first quarter of 2024.\nThe stock is overvalued compared to its industry. It is currently trading at a price-to-book multiple of 1.65, higher than the industry average of 1.56.  However, we believe that given Berkshire Hathaway's dominant market presence, diverse business activities, and, above all, the name Warren Buffet, a premium valuation is quite justified for this Zacks Rank #3 (Hold) stock.\nImage Source: Zacks Investment Research\nReturn on equity in the trailing 12 months was 7.3%, underperforming the industry average of 7.8%. Return on equity, a profitability measure, reflects how effectively a company is utilizing its shareholders. It's noteworthy that though BRK.B’s ROE is lagging behind the industry average, the company successfully improved the same even during the pandemic. \nImage Source: Zacks Investment Research\nThe same holds true for return on invested capital (ROIC), which has increased every year since 2020. This reflects BRK.B’s efficiency in utilizing funds to generate income. However, ROIC in the trailing 12 months was 5.7%, lower than the industry average of 5.9%.\nImage Source: Zacks Investment Research\nOne of the two analysts covering the stock has raised estimates for 2024 and 2025 over the past 30 days, while one has lowered the same for 2025. Thus, the Zacks Consensus Estimate for 2024 implies a 0.4% year-over-year increase, while the same for 2025 suggests a 0.6% decrease.\nImage Source: Zacks Investment Research\nIn a letter to shareholders, Warren Buffett stated that Berkshire Hathaway has the largest GAAP net worth recorded by any American business and it occupies about 6% of the total GAAP net worth of S&P 500 companies.Holding shares of Berkshire Hathaway renders dynamism to a shareholder's portfolio. It gives a feel of investing in mutual funds apart from rewarding investors with higher returns at the same time. But above all, the company has Warren Buffett at its helm, who has been creating tremendous value for shareholders over nearly six decades with his unique skills. Thus, investors who already hold Berkshire shares should continue to retain the stock in their portfolio.However, given its premium valuation, new investors can wait for a better entry point. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nAmerican Express Company (AXP) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-23T13:00:17.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK.B) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this company have returned +5.3%, compared to the Zacks S&P 500 composite's +2% change. During this period, the Zacks Insurance - Property and Casualty industry, which Berkshire Hathaway B falls in, has gained 4.8%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Berkshire Hathaway B is expected to post earnings of $5.10 per share, indicating a change of +10.4% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nThe consensus earnings estimate of $18.78 for the current fiscal year indicates a year-over-year change of +9.3%. This estimate has changed +0.4% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $19.38 indicates a change of +3.2% from what Berkshire Hathaway B is expected to report a year ago. Over the past month, the estimate has changed -1.2%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Berkshire Hathaway B.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Berkshire Hathaway B, the consensus sales estimate for the current quarter of $97.31 billion indicates a year-over-year change of +5.2%. For the current and next fiscal years, $368.44 billion and $374.39 billion estimates indicate +1.1% and +1.6% changes, respectively.\nLast Reported Results and Surprise History\nBerkshire Hathaway B reported revenues of $89.87 billion in the last reported quarter, representing a year-over-year change of +5.2%. EPS of $5.19 for the same period compares with $3.69 a year ago.\nCompared to the Zacks Consensus Estimate of $81.03 billion, the reported revenues represent a surprise of +10.91%. The EPS surprise was +52.2%.\nOver the last four quarters, Berkshire Hathaway B surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBerkshire Hathaway B is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Berkshire Hathaway B. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-22T20:17:05.000Z",
        "Title": "Buffett's Berkshire Hathaway cuts stake in Bank of America",
        "Author": "  Bill McColl ",
        "Text": "Kevin Dietsch / Getty Images\nWarren Buffett's Berkshire Hathaway reduced its stake in Bank of America by 33.9 million shares over a three-day period last week.\nThe selloff reduced the company's holdings by about $1.5 billion, although it continues to have nearly 1 billion shares of the bank in its portfolio.\nBerkshire continues to own almost a 13% stake in Bank of America.\nBank of America (BAC) shares fell in intraday trading Monday after Warren Buffett’s Berkshire Hathaway (BRK-B) cut its stake in the bank by $1.5 billion.\nIn a regulatory filing on Friday, the company reported it had sold 33.9 million shares over a three-day period last week. The per-share sale prices ranged from $43.13 to $44.07.\nEven with the reduction, Berkshire continues to own approximately 999 million shares of BofA, worth more than $42 billion. It holds an almost 13% stake in the firm, which is the second-biggest Berkshire investment in its portfolio after Apple (AAPL).\nShares of Bank of America hit a more than two-year high last week, but have fallen ever since, including about 1% as of noon ET Monday. Still, they remain up more than 25% year-to-date. Also last week, Berkshire Hathaway shares rose to a record before losing ground. They're little changed today.\nTradingView\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-22T04:08:31.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK-B): Hedge Funds Think That This Stock Will Skyrocket",
        "Author": "  Ramish Cheema ",
        "Text": "We recently compiled a list of the 10 Stocks That Will Skyrocket. In this article, we are going to take a look at where Berkshire Hathaway Inc. (NYSE:BRK-B) stands against the other stocks.\nThe primary lure of investing, as you're likely to know, is to make money. Every day thousands of investors pour into the market to pick out what they believe will be winners to make them rich. And, the market delivers as well. This has been quite clear in 2024, with the hype surrounding artificial intelligence having delivered previously unthinkable returns. Wall Street's favorite AI stock, the chipmaker that's responsible for providing the industry with GPUs to run AI workloads, has gained a whopping 636% since ChatGPT was released in November 2022. This stock ranks 4th in our list of  Analyst Says These 10 AI Stocks Have More Upside Potential, so if you haven't guessed by now, then do take a look.\nLooking at these spectacular returns, one would be hard pressed to conclude that if you want to make money on the stock market, then growth is the way to go. But as is the case with most things in life, details are lurking under the hood that go against this simple supposition. On this front, professors from the University of Illinois looked at the returns of large cap and small cap value and growth stocks starting from 1969 and ending in 2001. Taking a geometric mean of these returns, they revealed that large cap growth ('glamour') stocks delivered mean returns of 4.5%, 7.9%, and 3.8% between 1969-2001, 1979-2001, and 1990-2001, respectively. On the other hand, large cap value stocks delivered returns of 16.4%, 20.4%, and 18% over the three respective time periods. What's more, is that the returns offered by the value stocks during 1969 and 2001 also surpassed the returns of the S&P 500 index which sat at 11.4%!\nBut what about small caps? After all, small caps are all the hype on Wall Street these days as investors position themselves for an interest rate cut. July 11th saw the S&P's flagship index bleed 91 basis points, with the technology heavy NASDAQ shedding 1.98%. The NASDAQ's drop was led by its 100 most valuable non financial companies which shed 2.15% during the same day. On the other hand, the rising fortunes of small cap stocks accelerated on the 11th. The leading small cap stock index gained 2% during the day and nearly matched this during the first half an hour of trading on the 12th by gaining 1.6% as it opened significantly higher after the after and pre market trading sessions.\nLooking at these gains, you might be wondering which small cap stocks might be worth their while. Well, we looked at analyst sentiment as part of our coverage of 8 Best Small-Cap Stocks Ready to Explode According to Analysts and hedge fund sentiment as part of 15 Small-Cap Stocks with High Potential so you should check them out if you're interested in small cap stocks.\nComing back to the professors' research, during 1969-2001, 1979-2001, and 1990-2001, small cap growth stocks, were down by 2.8%, 1.8%, and 6.2%, respectively. On the other hand, small cap value stocks delivered geometric mean returns of 18.3%, 22.8%, and 17.7%, respectively. Seems like over the long term, investing in value stocks appears to be just as, if not more, worthwhile while large cap growth stocks appear to fare better than their small cap. peers.\nWhile you might be thinking that these stats do not apply to the current market, it's also true that they are relevant to an extent especially since 1990 to 2001 was characterized by soaring valuations fuelled by internet stocks. Right now, AI is all that anyone can talk about, even as investors are moving out of big ticket technology names into the under appreciated small caps. Back then, the shares of a California based internet connectivity equipment provider soared by a whopping 53,207% between January 1991 and April 2000. So, this would have seen $1,000 invested during the start soar to $533,000 at the peak, which, fair to say, is life changing money for most of us. Yet, those same shares are down by 36% since then and had tumbled by as much as 79% by February 2009. If you're interested in knowing what this stock is, it ranked 8th on our list of the 10 Best Communication and Media Stocks To Buy According to Hedge Funds.\nAt the same time, not all growth stocks end up lower. Some of the biggest examples that weathered the storm after the dotcom bubble popped are the largest companies today. They belong to the eCommerce, consumer and enterprise software, and the broader technology industries. Today's mega cap stocks have gained anywhere between 6,455% to 203,377% and 437,010% since they were listed for trading. Safe to say, these 'fads' of the time weren't fads and the market knew what it was doing.\nTheir returns are also what drive growth investors in droves to the stock market. While eCommerce and consumer technology were trends of the past, there are dozens of trends that newsletter publishers have embraced with open arms these days as they promise the next stock capable of delivering 10x or even 100x in returns. Since you're likely to be aware of AI at this point, we'll skip it out and list some other ideas. One of the biggest, and perhaps underreported ideas that newsletters have been pitching is quantum computing. Quantum computing expands the amount of data that a traditional computer can compute, and while its stocks haven't delivered strong returns yet, publishers believe that the future is bright. You can look at some quantum computing stocks and a broader industry overview by reading 12 Best Quantum Computing Stocks To Invest In.\nOne trend that has delivered returns is weight loss. Since March 2023, these stocks have delivered as much as 173% in returns, and with newer products such as pills under development, some folks believe that there's more room left for growth. Another highly pitched trend is energy, specifically nuclear energy, uranium miners, and energy infrastructure stocks. All these will benefit from the growth in electricity consumption from AI data centers, according to newsletter publishers.\nOur Methodology\nTo make our list of the stocks that might skyrocket, we scanned investment newsletters from Stock Gumshoe and narrowed down 20 stocks from newsletters dated back as far as June 13th. These were ranked by the number of hedge funds that had bought the shares in Q1 2024 and the top ten stocks were chosen. Stock Gumshoe's thesis and the date of each newsletter are also mentioned.\nWe also mentioned the number of hedge funds that had bought these stocks during the same filing period. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA team of insurance professionals in a boardroom overlooking a city skyline.\nNumber of Hedge Fund Investors  in Q1 2024: 119\nDate of Newsletter: July 2nd\nComing back to Whitney Tilson, this stock is so good he'd be willing to bet not only his future but also his children's future on it by putting 50% of their inheritance in it. This stock can \"generate more returns than annuities, life insurance, gold, or a house,\" so looks like it's relevant to just cut to the chase and see what the hype is all about.\nThe hype, it appears, is about Warren Buffett's investment holding company Berkshire Hathaway Inc. (NYSE:BRK-B). It has a fortress of a balance sheet with $38 billion in cash and it is also the most recognizable investment brand name in America. Tilson's buy point for Berkshire Hathaway Inc. (NYSE:BRK-B) is $407, and Gumshoe also speculates that Tilson is also being a bit disingenuous in promoting the stock since it's traded above the intrinsic value for quite some time. While Buffett will be a centurion in a couple of years, Berkshire Hathaway Inc. (NYSE:BRK-B) has some of the best investment professionals on its team. It might not be the stock for the growth junkies though, as Warren Buffett's secret investment sauce is built on gradual value accretion through compounding.\nOverall BRK-B ranks 3rd on our list of the stocks that will skyrocket. You can visit 10 Stocks That Will Skyrocket to see the other stocks that are on hedge funds’ radar. While we acknowledge the potential of BRK-B as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than BRK-B but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-07-01T14:00:16.000Z",
        "Title": "Those who invested in Berkshire Hathaway (NYSE:BRK.A) five years ago are up 90%",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "If you want to compound wealth in the stock market, you can do so by buying an index fund. But you can do a lot better than that by buying good quality businesses for attractive prices. For example, the Berkshire Hathaway Inc. (NYSE:BRK.A) share price is up 90% in the last five years, slightly above the market return. Zooming in, the stock is up a respectable 18% in the last year.\nWith that in mind, it's worth seeing if the company's underlying fundamentals have been the driver of long term performance, or if there are some discrepancies.\n Check out our latest analysis for Berkshire Hathaway \nWhile the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nOver half a decade, Berkshire Hathaway managed to grow its earnings per share at 26% a year. This EPS growth is higher than the 14% average annual increase in the share price. Therefore, it seems the market has become relatively pessimistic about the company. This cautious sentiment is reflected in its (fairly low) P/E ratio of 11.98.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nIt's probably worth noting that the CEO is paid less than the median at similar sized companies. It's always worth keeping an eye on CEO pay, but a more important question is whether the company will grow earnings throughout the years. Dive deeper into the earnings by checking this interactive graph of Berkshire Hathaway's earnings, revenue and cash flow.\nBerkshire Hathaway shareholders gained a total return of 18% during the year. Unfortunately this falls short of the market return. On the bright side, that's still a gain, and it's actually better than the average return of 14% over half a decade It is possible that returns will improve along with the business fundamentals. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Take risks, for example - Berkshire Hathaway has   1 warning sign   we think you should be aware of.\nFor those who like to find winning investments this free list of undervalued companies with recent insider purchasing, could be just the ticket.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n"
    },
    {
        "Date": "2024-07-17T21:45:18.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Increases Despite Market Slip: Here's What You Need to Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) ended the recent trading session at $445.61, demonstrating a +1.53% swing from the preceding day's closing price. The stock exceeded the S&P 500, which registered a loss of 1.39% for the day. Elsewhere, the Dow saw an upswing of 0.6%, while the tech-heavy Nasdaq depreciated by 2.77%.\nHeading into today, shares of the company had gained 7.59% over the past month, outpacing the Finance sector's loss of 0.08% and the S&P 500's gain of 4.43% in that time.\nAnalysts and investors alike will be keeping a close eye on the performance of Berkshire Hathaway B in its upcoming earnings disclosure. The company's earnings per share (EPS) are projected to be $5.10, reflecting a 10.39% increase from the same quarter last year. Our most recent consensus estimate is calling for quarterly revenue of $97.31 billion, up 5.19% from the year-ago period.\nFor the full year, the Zacks Consensus Estimates project earnings of $18.78 per share and a revenue of $368.44 billion, demonstrating changes of +9.31% and +1.09%, respectively, from the preceding year.\nAny recent changes to analyst estimates for Berkshire Hathaway B should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.4% higher. As of now, Berkshire Hathaway B holds a Zacks Rank of #3 (Hold).\nWith respect to valuation, Berkshire Hathaway B is currently being traded at a Forward P/E ratio of 23.37. This expresses a premium compared to the average Forward P/E of 13.13 of its industry.\nOne should further note that BRK.B currently holds a PEG ratio of 3.34. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. BRK.B's industry had an average PEG ratio of 1.62 as of yesterday's close.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This industry currently has a Zacks Industry Rank of 65, which puts it in the top 26% of all 250+ industries.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-18T12:30:03.000Z",
        "Title": "Here's How Much You'd Have If You Invested $1000 in Berkshire Hathaway B a Decade Ago",
        "Author": "  Zacks Equity Research ",
        "Text": "How much a stock's price changes over time is important for most investors, since price performance can both impact your investment portfolio and help you compare investment results across sectors and industries.\nFOMO, or the fear of missing out, also plays a role in investing, particularly with tech giants and popular consumer-facing stocks.\nWhat if you'd invested in Berkshire Hathaway B (BRK.B) ten years ago? It may not have been easy to hold on to BRK.B for all that time, but if you did, how much would your investment be worth today?\nBerkshire Hathaway B's Business In-Depth\nWith that in mind, let's take a look at Berkshire Hathaway B's main business drivers.\nFounded in 1889, Berkshire Hathaway is an Omaha, NE-based holding company, which owns more than 90 subsidiaries in insurance, rail roads, utilities, manufacturing services, retail and home building.The most important of these are insurance businesses conducted on both a primary basis and insurance basis, a freight rail transportation business and a group of utility and energy generation and distribution businesses.\nIt has four major operating sectors - The Insurance group includes (26% of 2023 revenue) : GEICO, Government Employees Insurance Company writes private passenger automobile insurance; General Re conducts reinsurance business, offering property and casualty, life and health coverage to clients worldwide; Berkshire Hathaway Reinsurance Group underwrites excess-of-loss reinsurance and quota-share coverage for insurers and reinsurers globally; Berkshire Hathaway Primary Group comprises a wide variety of independently-managed insurance businesses that principally write liability coverage for commercial accounts.\nThe Railroad business includes MidAmerican and BNSF operations (6.3%), which provides railway services through Burlington Northern Santa Fe Corp.\nThe Utilities and Energy businesses (22%) that includes Berkshire Hathaway Energy and Pilot Travel Centers.\nThe Manufacturing, Service & Retailing Operations includes (45.7%): Manufacturing – Acme Building Brands, Benjamin Moore, H.H. Brown Shoe Group, CTB, Fechheimer Brothers, Forest River, Fruit of the Loom, Garan, ISCAR, Johns Manville, Justin Brands, Larson-Juhl, MiTek, Russell, Scott Fetzer, Vanity Fair, Richline Group and Albecca. The Service sub-segment includes – Buffalo News, Business Wire, FlightSafety, International Dairy Queen, Pampered Chef, and NetJets.\nRetailing sub-segment includes – Ben Fridge Jeweler, Borsheim’s, Helzberg Diamond Shops, Jordan’s Furniture, Nebraska Furniture Mart, See’s Candies, Star Furniture, R.C. Willey and TTI Inc. Others include – Marmon Group, McLane Company and Shaw Industries.\nBottom Line\nWhile anyone can invest, building a lucrative investment portfolio takes research, patience, and a little bit of risk. If you had invested in Berkshire Hathaway B ten years ago, you're probably feeling pretty good about your investment today.\nA $1000 investment made in July 2014 would be worth $3,522.05, or a 252.21% gain, as of July 18, 2024, according to our calculations. Investors should note that this return excludes dividends but includes price increases.\nThe S&P 500 rose 185.39% and the price of gold increased 80.16% over the same time frame in comparison.\nAnalysts are forecasting more upside for BRK.B too.\nBerkshire is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility. Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus. Shares of Berkshire have outperformed the industry year to date. However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.\nThe stock is up 9.23% over the past four weeks, and no earnings estimate has gone lower in the past two months, compared to 1 higher, for fiscal 2024. The consensus estimate has moved up as well.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-16T02:07:53.000Z",
        "Title": "Watch These Berkshire Hathaway Price Levels After Stock Closes at Record High",
        "Author": "  Timothy Smith ",
        "Text": "\nShares in Berkshire Hathaway closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings.\nThe stock broke out from a symmetrical triangle, a chart pattern that suggests a continuation of the current uptrend.\nThe measuring principle projects a near-term price target in the shares of $465, while a bars pattern projects a longer-term target of around $500.\nDuring retracements, Berkshire shares may find support around $415 from the symmetrical triangle's top trendline, and near a multi-month uptrend line at $390.\n\nShares in Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings, including Apple (AAPL), American Express, (AXP), Chevron (CVX), and Occidental Petroleum (OXY). Investors typically view the performance of the company’s stock, which trades at about 23 times analysts' full-year operating profit projections, as a proxy for the health of the U.S. economy due to its diversification across a broad range of industries.\nBerkshire Hathaway shares added 2.4% to finish Monday's session at $434.42.\nAmid the stock’s move to record highs, we’ll take a closer look at the technicals on the Berkshire Hathaway weekly chart and identify important levels to watch out for.\nSince bottoming out midway between the 50- and 200-week moving averages (MAs) in early October last year. Berkshire shares have trended consistently higher. More recently, the price broke out from textbook symmetrical triangle, a chart pattern that indicates a continuation of the current uptrend.\nImportantly, the initial breakout from the pattern occurred on the highest weekly trading volume since late February, suggesting buying conviction behind the move. Moreover, the relative strength index (RSI) sits just below overbought levels to confirm strong price momentum in the stock.\nBelow, we’ll use two different technical analysis techniques to predict near-term and longer-term price targets. These levels help us determine a general area on the chart where Berkshire shares may climb to and encounter resistance if the price continues to trend higher.\nTo forecast a potential short-term price target, we can use the measuring principle. We do this by calculating the distance between the symmetrical triangle’s two trendlines near their widest point and apply that amount to the breakout area. For example, we add $50 to $415, which projects a target at $465\nInvestors can speculate a longer-term price target by using a chart overlay of prior price action. This works by taking the bars pattern from the uptrend that preceded the symmetrical triangle and applying it to the most recent swing low. In this case, we take the bullish bars pattern between October 2023 and February this year and align it with the April low, which indicates a possible upside target of around $500.\nInvestors looking for a key pullback level should keep an eye on the $415 area, where Berkshire shares would likely find buying interest near the symmetrical triangle’s top trendline. A more significant retracement could see the stock revisit a multi-month uptrend trendline around $390, with this location also sitting in close proximity to the 50-week MA.\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info.\nAs of the date this article was written, the author does not own any of the above securities.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-22T14:00:01.000Z",
        "Title": "Why Berkshire Hathaway Is Likely to Continue to Sell Its Apple Stake",
        "Author": "  Grahamites ",
        "Text": "In a previous discussion, I wrote about potential reasons why Apple Inc. (NASDAQ:AAPL) is missing from the permanent holding list for Warren Buffett (Trades, Portfolio)'s Berkshire Hathaway(NYSE:BRK.A)(NYSE:BRK.B). Shortly after publication, the insurance conglomerate reported that it cut its stake in the tech giant by about 13% during the first quarter.\nWarning! GuruFocus has detected 4 Warning Signs with CCL.\nThis 13% cut is the second quarter in a row that Buffett has trimmed Berkshire's massive Apple position. The company also sold about 1% of its Apple position during the fourth quarter of 2023. Berkshire's first-quarter sale marked its largest cut in Berkshire's Apple stake since the initial purchase in 2016. I believe Buffett is very likely to continue to sell down the Apple stake over the next several quarters and years for a few reasons.\nWhen asked about the Apple sale during the annual meeting, Buffett said the following:\n\"Almost everybody I know pays a lot more attention to not paying taxes than I think they should. We don't mind paying taxes at Berkshire, and we are paying a 21% federal rate on the gains we're taking in Apple and that rate was 35% not too long ago, and it's been 52% in the past when I've been operatingIt doesn't bother me in the least to write that check and I would really hope that with all that America has done for all of you, it shouldn't bother you that we do it and if I'm doing it at 21%, and we're doing it at a lot higher percentage later on, I don't think you'll actually mind that we sold a little Apple this year.\nEssentially Buffett said that he is selling Apple now because the capital gains tax rate is at a very low level and he thinks the capital gain tax rate may rise in the future due to the growing budget deficit. Here the guru is again subtlety insinuating that the company is not a permanent holding for Berkshire Hathaway because if it doesn't consider selling Apple at all, then the tax rate does not matter.\nApple's current valuation, driven by years of strong performance, has reached a peak level. The following chart shows Apple's price-to-owner earnings, price-sales and price-book ratios all reached peak levels.\nNot only is Apple's valuation at peak level, its margin expansion, which is driven by both improving operational efficiency and higher contribution from higher-margin service revenue, may also have reached its peak, leaving little room for future margin expansion.\nApple's potential peak margin, combined with the possible slowdown in the growth rate of the smartphone business and the heightened competition from Huawei, suggest revenue and earnings may struggle to sustain the impressive growth rate achieved in recent years. In fact, we have already noticed a slowdown in recent quarters. It has yet to be seen whether the hype surrounding Apple Intelligence, the company's version of artificial intelligence, will materially boost the sales of the next generation of iPhones.\nCEO Tim Cook started Apple's share buyback program in 2013. Since then, the company has repurchased $651 billion worth of its common stock, reducing its share count by 11 billion shares, or roughly 41% of its outstanding shares. From 2013 to 2019, Apple's stock was very cheap, making the stock repurchases extremely value-additive.\nThe stock got cheap again for a short period of time during 2020 and 2022. However, as I pointed out above, at the present market price, Apple's valuation has reached peak level. At this level, stock buybacks are very unlikely to be the best way to allocate capital. Nonetheless, share repurchases remain Apple's largest capital allocation option. Therefore, its return from capital allocation is almost guaranteed to decline from what it has been over the past decade.\nBuffett has repeatedly cited Cook's leadership as a major reason for his investment decision. Cook has proven that he possesses the rare skillset of both operational excellence and outstanding capital allocation capability.\nCook is turning 64 in November. By Berkshire's standard, he is far from retirement age. However, the CEO himself has publicly said he will not stick around for many years. Concerns over Cook's retirement first emerged in 2021 when he said he \"will probably be leaving Apple in the next 10 years, A recent report from Bloomberg wrote that people close to him believe Cook will be Apple's CEO for at least another three years.\nAs I wrote in my previous discussion, Apple is not an idiot-proof business. Cook's potential retirement may not be imminent, but Buffett must be thinking about it.\nGiven the uncertainties surrounding capital gains tax rates, concerns about Apple's peak valuation and peak margin, diminishing returns from capital allocation and the potential retirement of Cook, it is extremely likely that Berkshire Hathaway will continue to trim its massive position in Apple. We will find out over the next few quarters.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-07-24T21:45:19.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Stock Moves -0.28%: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) closed at $432.80 in the latest trading session, marking a -0.28% move from the prior day. This change was narrower than the S&P 500's 2.32% loss on the day. On the other hand, the Dow registered a loss of 1.25%, and the technology-centric Nasdaq decreased by 3.64%.\nThe company's shares have seen an increase of 5.61% over the last month, surpassing the Finance sector's loss of 1.37% and the S&P 500's gain of 1.79%.\nThe upcoming earnings release of Berkshire Hathaway B will be of great interest to investors. The company is predicted to post an EPS of $5.10, indicating a 10.39% growth compared to the equivalent quarter last year. Our most recent consensus estimate is calling for quarterly revenue of $97.31 billion, up 5.19% from the year-ago period.\nBRK.B's full-year Zacks Consensus Estimates are calling for earnings of $18.78 per share and revenue of $368.44 billion. These results would represent year-over-year changes of +9.31% and +1.09%, respectively.\nIt's also important for investors to be aware of any recent modifications to analyst estimates for Berkshire Hathaway B. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.4% higher. As of now, Berkshire Hathaway B holds a Zacks Rank of #3 (Hold).\nInvestors should also note Berkshire Hathaway B's current valuation metrics, including its Forward P/E ratio of 23.11. This signifies a premium in comparison to the average Forward P/E of 12.65 for its industry.\nAlso, we should mention that BRK.B has a PEG ratio of 3.3. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. The Insurance - Property and Casualty industry currently had an average PEG ratio of 1.6 as of yesterday's close.\nThe Insurance - Property and Casualty industry is part of the Finance sector. This group has a Zacks Industry Rank of 97, putting it in the top 39% of all 250+ industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow BRK.B in the coming trading sessions, be sure to utilize Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-09T17:44:53.000Z",
        "Title": "How Much Berkshire Hathaway Stock Does the Gates Foundation Own?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Judging by the disclosed holdings in the Gates Foundation (formerly called the Bill and Melinda Gates Foundation Trust), one would think that billionaire Bill Gates is a big fan of Warren Buffett. According to its latest 13F filing, the foundation run by Gates owns a huge amount of Buffett's holding company, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B).\nRight now, the largest stock position in the $46 billion trust's publicly disclosed portfolio is Microsoft. Gates co-founded Microsoft back in 1975 and in 2010 he committed to donating his entire stake in Microsoft to charity by the time he died. As a result, much of the foundation's holdings in Microsoft came from Gates' donations over the years. Today, the trust's stake in Microsoft is valued at around $15.4 billion.\nBerkshire Hathaway, meanwhile, is the third-largest position in the trust's portfolio at around $7.3 billion. Most of those Berkshire shares were donated to the foundation by Buffett.\nAfter Gates committed to donating the majority of his wealth to charity more than a decade ago, Buffett immediately joined him in making a similar pledge. A trust was launched in 2000 and was initially run by Gates, his now ex-wife Melinda French Gates, and Buffett. Together, the trio convinced dozens of other billionaires to also donate the majority of their wealth to various charitable causes. Buffett served as a member of the foundation's board until June 2021. Melinda Gates resigned from the board effective June 2024. Since 2021, Buffett started donating portions of his Berkshire stock to other charitable trusts instead, including trusts run by his three children.\nWhile Berkshire Hathaway stock trades at all-time highs, the foundation's stake has shrunk in recent quarters (the sale is partly related to stipulations for how the donated stock must be used by the trust). Last quarter, for example, it trimmed its stake by 2.6 million shares -- a reduction of around 13%. However, don't expect it to disappear from the portfolio completely anytime soon. There are still plenty of funds left to utilize for charitable causes.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $785,556!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nHow Much Berkshire Hathaway Stock Does the Gates Foundation Own? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-23T10:40:31.000Z",
        "Title": "Warren Buffett’s Berkshire Hathaway cuts its stake in EV giant BYD to under 5%, dropping below Hong Kong’s disclosure threshold",
        "Author": "  Lionel Lim ",
        "Text": "When Chinese EV giant BYD broke into the global consciousness, media reports focused on one thing in particular: its backing from Warren Buffett. Berkshire Hathaway invested about $230 million in BYD in 2008, with Buffett’s longtime partner Charlie Munger calling BYD’s founder a “combination of Thomas Edison and Jack Welch.”\nBut the days of calling BYD a “Buffett-backed” company may soon be coming to a close.\nOn July 16, Berkshire Hathaway trimmed its stake in BYD to 4.94%, down from 5.06%, according to a Monday filing on the Hong Kong stock exchange. That drops the U.S. company below the threshold where shareholders have to disclose share sales.\nBYD shares fell over 3% in Hong Kong trading on Tuesday, following the disclosure. Shares in the Chinese EV manufacturer are down almost 9% in the past 12 months.\nBuffett’s 2008 investment in BYD represented a 10% stake in the company overall, and 28% of its H-shares, or the shares traded in Hong Kong. BYD shares rose about 20-fold between Buffett's 2008 investment and August 2022, the month which Berkshire first started trimming its BYD stake. Before Monday’s disclosure, the last time the company disclosed its BYD stake was on June 19 when it reduced its stake to 5.99%.\nBYD is now the largest EV producer in mainland China, the world’s largest EV market. It’s also embarking on an aggressive global expansion and is trying to establish a foothold in markets like Europe and Southeast Asia.\nThe EV maker briefly overtook Tesla as the world’s largest seller of battery electric vehicles in the final quarter of last year, and market research firm Counterpoint Research forecasts that it may be set to overtake its U.S. competitor again this year.\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-07-26T14:00:32.000Z",
        "Title": "Berkshire Hathaway B (BRK.B) Earnings Expected to Grow: Should You Buy?",
        "Author": "  Zacks Equity Research ",
        "Text": "Wall Street expects a year-over-year increase in earnings on higher revenues when Berkshire Hathaway B (BRK.B) reports results for the quarter ended June 2024. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.\nThe earnings report might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\nWhile management's discussion of business conditions on the earnings call will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.\nZacks Consensus Estimate\nThis company is expected to post quarterly earnings of $4.83 per share in its upcoming report, which represents a year-over-year change of +4.6%.\nRevenues are expected to be $97.31 billion, up 5.2% from the year-ago quarter.\nEstimate Revisions Trend\nThe consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\nInvestors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.\nEarnings Whisper\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction).\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\nHow Have the Numbers Shaped Up for Berkshire Hathaway B?\nFor Berkshire Hathaway B, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -5.70%.\nOn the other hand, the stock currently carries a Zacks Rank of #3.\nSo, this combination makes it difficult to conclusively predict that Berkshire Hathaway B will beat the consensus EPS estimate.\nDoes Earnings Surprise History Hold Any Clue?\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\nFor the last reported quarter, it was expected that Berkshire Hathaway B would post earnings of $3.41 per share when it actually produced earnings of $5.19, delivering a surprise of +52.20%.\nOver the last four quarters, the company has beaten consensus EPS estimates three times.\nBottom Line\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\nBerkshire Hathaway B doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\nAn Industry Player's Expected Results\nAnother stock from the Zacks Insurance - Property and Casualty industry, Allstate (ALL), is soon expected to post earnings of $0.33 per share for the quarter ended June 2024. This estimate indicates a year-over-year change of +107.5%. Revenues for the quarter are expected to be $15.55 billion, up 10.1% from the year-ago quarter.\nOver the last 30 days, the consensus EPS estimate for Allstate has remained unchanged. Nevertheless, the company now has an Earnings ESP of 36.50%, reflecting a higher Most Accurate Estimate.\nThis Earnings ESP, combined with its Zacks Rank #3 (Hold), suggests that Allstate will most likely beat the consensus EPS estimate. Over the last four quarters, the company surpassed consensus EPS estimates three times.\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nThe Allstate Corporation (ALL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-11T13:30:10.000Z",
        "Title": "Is Berkshire Hathaway B (BRK.B) a Buy as Wall Street Analysts Look Optimistic?",
        "Author": "  Zacks Equity Research ",
        "Text": "When deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nLet's take a look at what these Wall Street heavyweights have to say about Berkshire Hathaway B (BRK.B) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\nBerkshire Hathaway B currently has an average brokerage recommendation (ABR) of 2.00, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by four brokerage firms. An ABR of 2.00 indicates Buy.\nOf the four recommendations that derive the current ABR, two are Strong Buy, representing 50% of all recommendations.\nBrokerage Recommendation Trends for BRK.B\nCheck price target & stock forecast for Berkshire Hathaway B here>>>The ABR suggests buying Berkshire Hathaway B, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\nABR Should Not Be Confused With Zacks Rank\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\nShould You Invest in BRK.B?\nLooking at the earnings estimate revisions for Berkshire Hathaway B, the Zacks Consensus Estimate for the current year has remained unchanged over the past month at $18.71.\nAnalysts' steady views regarding the company's earnings prospects, as indicated by an unchanged consensus estimate, could be a legitimate reason for the stock to perform in line with the broader market in the near term.\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Berkshire Hathaway B. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nIt may therefore be prudent to be a little cautious with the Buy-equivalent ABR for Berkshire Hathaway B.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-30T09:43:46.000Z",
        "Title": "Berkshire Hathaway Inc. (BRK-B): Is Former President Barack Obama Bullish on This Stock?",
        "Author": "  Sheryar Siddiq ",
        "Text": "We recently compiled a list of the Obama Stock Portfolio: 10 Year Returns. In this article, we are going to take a look at where Berkshire Hathaway Inc. (NYSE:BRK-B) stands against the other stocks in former U.S. president Barack Obama's portfolio.\nFormer United States President Barack Obama took office during one of the worst recessions in U.S. history, yet the stock market reached new highs during his tenure. Stepping into office in 2009, the year after stocks plummeted nearly 40% amid the financial crisis of 2007-2008, Obama made a remarkably well-timed market prediction. On March 3, 2009, just days before the S&P 500 hit an intraday low of 666 and a closing low of 676.53, the then-president stated, \"What you're now seeing is profit-and-earnings ratios are starting to get to the point where buying stocks is a potentially good deal if you've got a long-term perspective on it.\" By the time he left office on January 20, 2017, the S&P 500 had soared to 2,263.69, reflecting a gain of about 225% since his predictive remark.\nThe \"Obama Years\" coincided with rapid technological advancements that significantly impacted the stock market. Apple Inc.'s iPhone, introduced less than two years before he took office, exemplified this era of innovation. In addition, during Obama's presidency, billionaire Reed Hastings transformed Netflix Inc. from a DVD rental-by-mail company into a video-streaming giant, revolutionizing entertainment consumption. On the other hand, renewable energy, particularly solar energy, struggled during the president's tenure. Despite the administration's solar subsidies, investors were largely disappointed as those subsidies eventually faded. First Solar Inc., one of the largest U.S. solar equipment producers, saw its stock plummet by as much as 74% due to falling solar panel prices, making it the worst-performing S&P 500 stock of the Obama era.\nFrom speaking at events worldwide to writing memoirs and signing a major production deal with Netflix, the Obamas have led a busy and highly lucrative life post-White House. Michelle Obama's first memoir, \"Becoming,\" published in November 2018, became that year's No. 1 best-selling book. Her second book, \"The Light We Carry: Overcoming in Uncertain Times,\" also achieved bestseller status. Similarly, Barack Obama's latest memoir, \"A Promised Land,\" sold nearly 890,000 copies within 24 hours of its November 2020 release. These ventures, along with the six-figure pension that all former presidents receive, have significantly boosted the Obamas' net worth, which is at least $70 million according to the International Business Times. The New York Post, however, estimates their fortune to be much higher, at $135 million.\nOf course, Barack Obama’s income isn’t limited to speaking fees and pensions. Like many other wealthy individuals, he has invested significantly in the stock market. So what does his portfolio look like? When he took office in 2009, Obama, like all presidents, was required to make financial disclosures by law. At that time, Obama held $200,000-$450,000 in the Vanguard 500 Index Fund Investor Shares that tracks the S&P 500 index, according to a report by CBS News.\nOur Methodology\nThese investments were selected from the top holdings of the Vanguard 500 Index Fund Investor Shares, one of Barack Obama's primary investments during his presidency, according to official disclosures. We have provided each stock's trailing 10-year returns to assess their performance over the decade. Data from approximately 919 elite hedge funds tracked by Insider Monkey in the fourth quarter of 2024 was also analyzed to determine the number of hedge funds holding stakes in each firm.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple, our research has shown that we can outperform the market by imitating the top stock picks of best hedge funds. Our quarterly newsletter’s strategy picks 14 small and large-caps every quarter and it has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nNote: The stocks are sorted in ascending order of their trailing 10-year returns.\nA team of insurance professionals in a boardroom overlooking a city skyline.\nNumber of Hedge Fund Holders: 119\nTrailing 10-Year Returns: 12.60%\nBerkshire Hathaway Inc. (NYSE:BRK-B), headquartered in Omaha, Nebraska, operates as a diversified multinational conglomerate holding company primarily within the insurance sector. It utilizes capital generated from insurance operations to invest in a broad spectrum of subsidiaries, equity holdings, and securities across various industries.\nArgus Research recently upgraded Berkshire Hathaway Inc. (NYSE:BRK-B) to a Buy from Hold, citing a favorable view of the company's conglomerate structure and its impressive track record over the past 60 years.\nAdditionally, Berkshire Hathaway Inc. (NYSE:BRK-B)'s first-quarter financial report on May 4 showed a 5% revenue increase to $89.9 billion compared to the same period last year. Net operating earnings saw a substantial 39% rise to $11.2 billion, and earnings per diluted Class B share increased from $3.69 to $4.80 year-over-year. This strong performance is reflected in the company's stock value, which has climbed 19.87% over the past year. Over a five-year span, Berkshire Hathaway shares have surged 97.67%, exceeding the S&P 500's 88.14% return.\nIn the first quarter of the current year, Insider Monkey's analysis of 919 hedge funds revealed that 119 had invested in Berkshire Hathaway Inc. (NYSE:BRK-B). Among these investors, the largest shareholder was Michael Larson’s Bill & Melinda Gates Foundation Trust, which held 17.3 million shares valued at $7.27 billion.\nOverall BRK-B ranks 10th on our list of former U.S. president Barack Obama's portfolio stocks. You can visit Obama Stock Portfolio: 10 Year Returns to see the other stocks that are on hedge funds’ radar. While we acknowledge the potential of BRK-B as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising than BRK-B but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n \nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-07-13T16:39:28.000Z",
        "Title": "Warren Buffett Eliminated This Stock From Berkshire's Portfolio Last Year. It Has Fallen 32% in the First Half of 2024.",
        "Author": "  Courtney Carlsen, The Motley Fool ",
        "Text": "Last year, Warren Buffett and his team at Berkshire Hathaway eliminated its stake in Globe Life (NYSE: GL), a stock that had been a part of its portfolio for over two decades. The company faced some serious legal issues last year and suffered a deep sell-off earlier this year when it was the subject of a short-seller report.\nSince the start of the year, Globe Life stock has plummeted 32.4%, according to data from S&P Global Market Intelligence. Here's what investors should know about the dip and what's next for Globe Life.\nLast year, storm clouds began to emerge over Globe Life when one of its subsidiaries, American Income Life Insurance Co. and Arias Agencies, faced a lawsuit accusing it of inappropriate workplace conduct, including rampant drug use, sexual abuse, and degradation of agents who didn't hit sales targets. Compounding its troubles were accusations from a former executive who said he was fired for blowing the whistle on \"potentially illegal\" sales practices.\nWarren Buffett, who emphasizes management's character and integrity, seemingly took the accusations quite seriously, and Berkshire sold its stake in the insurer last year. Although it wasn't a sizable position, it has long been a staple of Berkshire Hathaway's portfolio since 2001.\nInvestors seemed to shrug off the accusations as the calendar turned to 2024. Then, on March 6, the U.S. Department of Justice issued subpoenas to Globe Life and American Income Life as part of an investigation into allegations of fraud and misconduct at one of its top life insurance agencies.\nIn early April, Globe Life took another hit when short seller Fuzzy Panda Research accused the insurer of \"extensive\" insurance fraud that was ignored by management. The short seller interviewed former employees \"who showed us where the fraud was hidden\" and that the fraud was ignored by management despite being \"obvious and reported hundreds of times.\"\nGlobe Life has since recovered from its low of $39 per share since the short report was published, indicating that perhaps the sell-off was overdone. Today, the company is priced at a dirt cheap valuation of 8.2 times earnings.\nHowever, the company continues to face questions and received \"a preliminary, informal inquiry from the SEC\" in May to investigate the short sellers' claims. While it is not a formal investigation by the SEC, these issues pose a risk and will be an overhang for Globe Life's stock for the time being.\nBefore you buy stock in Globe Life, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Globe Life wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nCourtney Carlsen has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nWarren Buffett Eliminated This Stock From Berkshire's Portfolio Last Year. It Has Fallen 32% in the First Half of 2024. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-16T16:34:00.000Z",
        "Title": "Top Analyst Reports for Berkshire Hathaway, McDonald's & American Express",
        "Author": "  Sheraz Mian ",
        "Text": "Tuesday, July 16, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), McDonald's Corporation (MCD) and American Express Company (AXP), as well as a micro-cap stock Steel Partners Holdings L.P. (SPLP). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Berkshire Hathaway have outperformed the Zacks Insurance - Property and Casualty industry over the year-to-date period (+21.8% vs. +19.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility. Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus. However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance. (You can read the full research report on Berkshire Hathaway here >>>)McDonald's shares have underperformed the Zacks Retail - Restaurants industry over the past year (-14.8% vs. -12.4%). The company is witnessing macroeconomic challenges and commodity and wage inflation are primary headwinds. Earnings estimates for 2024 have declined in the past 60 days, depicting analysts concern regarding the stock growth potential. Nevertheless, McDonald’s is likely to benefit from marketing campaigns, unit expansion and a loyalty program. McDonald’s is increasing its focus on menu innovation, as it believes that the strengthening of the core menu and solid marketing are likely to pave the way for additional growth in the upcoming periods. Also, emphasis on Accelerating the Arches strategy bodes well. McDonald’s expects its velocity accelerators of Experience of the Future, digital and delivery to drive growth over the long term.(You can read the full research report on McDonald’s here >>>)Shares of American Express have outperformed the Zacks Financial - Miscellaneous Services industry over the past year (+39.3% vs. +13.0%). The company’s growth initiatives, like launching new products, reaching new agreements and forging alliances, are boosting its revenues. Consumer spending on T&E, which carries higher margins for AmEx, is advancing well. Its balance sheet looks strong with ample cash. Solid cash-generation abilities enable the pursuit of business investments and prudent deployment of capital via buybacks and dividends. However, with higher utilization of the firm’s cards, costs in the form of card member services and card member rewards are likely to go up. Rising marketing costs are straining its margins. Its current debt level amid a high-interest rate environment induces a rise in interest expenses. The stock is overvalued at the moment. As such, the stock warrants a cautious stance.(You can read the full research report on American Express here >>>)Steel Partners' shares have underperformed the Zacks Diversified Operations industry over the past year (-3.8% vs. +9.9%). This microcap company with market capitalization of $734.16 million have seen EBITDA margin declined from 14.2% to 12.3% in the first quarter of 2024 due to an underperformance in the Energy and Diversified Industrial segments. Energy revenues fell 33.7% and Diversified Industrial sales decreased 3.9%, impacting profitability. Also, fluctuations due to geopolitical tensions impact operational costs and investor confidence.Nevertheless, Steel Partners' revenues rose 7% year over year to $476.3 million in the first quarter of 2024, driven by a consolidation in its supply chain and an 18.5% rise in Financial Services revenues. With a diversified portfolio across various sectors and the inclusion of Steel Connect, SPLP mitigates risks and boosts growth. As of Mar 31, 2024, SPLP had $273.9 million in cash, with debt reduced to $92.8 million. SPLP also reduced interest expenses by 76.7% in the first quarter.(You can read the full research report on Steel Partners here >>>)Other noteworthy reports we are featuring today include Analog Devices, Inc. (ADI), Dell Technologies Inc. (DELL) and GE HealthCare Technologies Inc. (GEHC).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nSolid Insurance Business Aid Berkshire (BRK.B), Cat Loss Ail\nSolid Expansion Efforts Aid McDonald's (MCD) Amid High Costs\nImproving Volumes Aid American Express (AXP), High Costs Ail\nFeatured Reports\nBattery Management System Solutions Aid Analog Devices (ADI)Per the Zacks analyst, Analog Devices is benefiting from a strong momentum in the electric vehicle space on the back of its robust Battery Management System solutions.\nSolid Demand for AI Servers Aids Dell Technologies (DELL)Per the Zacks analyst, Dell is benefiting from strong demand for AI servers driven by ongoing digital transformation and heightened interest in generative AI applications.\nGE HealthCare (GEHC) To Gain from Rising Product DemandPer the Zacks analyst, GE HealthCare's (GEHC) topline is likely to driven by rising demand for its products as it cater to growing markets. However, choppy macro environment to weigh on the stock.\nDemand for Rental Units Aid AvalonBay (AVB) Amid High SupplyPer the Zacks Analyst, AvalonBay is likely to gain from the healthy demand for residential units amid high home ownership costs, though new deliveries and high interest rates are woes.\nSolid Order Growth Aids Textron (TXT), Labor Shortage WoesPer the Zacks analyst, solid order flow backed by rising commercial air traffic has been boosting Textron's revenues. Yet, shortage of skilled labor remains a concern for this stock.\nMolson Coors' (TAP) Premiumization & Innovation Bodes WellPer Zacks analyst, Molson Coors is committed to growing market share via innovation and premiumization. The company is making efforts to redefine its product portfolio and expand in growth areas.\nAgios' (AGIO) Progress With Pyrukynd EncouragingThough Agios is entirely dependent on sole marketed drug Pyrukynd for growth, the Zacks Analyst is encouraged by the drug's label expansion studies in thalassemia and sickle cell disease indications.\nNew Upgrades\nGenerac (GNRC) Rides on Healthy Residential Product SalesPer the Zacks analyst, Generac's performance is likely to be driven by solid demand for its Residential products, notably a boost in Ecobee sales. C&I product shipments are gaining traction.\nStrategic Investments, Customer Addition Aid UGI (UGI)Per the Zacks analyst UGI's ongoing capital expenditure has strengthened infrastructure and allows it to serve its expanding customer base. Rising demand for its services will boost performance.\nIncreasing Guest Traffic Aids Shake Shack's (SHAK) ProspectsPer the Zacks analyst, Shake Shack is benefiting from improving guest traffic on the back of strategic marketing initiatives, new store openings, and its focus on menu innovation.\nNew Downgrades\nElevated Crude Prices to Hurt Eni's (E) Refining MarginsPer the Zacks analyst, elevated crude prices may hurt Eni's profitability by raising its refining business' input expenses. The company's significant exposure to debt capital also adds to the concern.\nAmerican Airlines (AAL) Reels Under High Fuel & Labor CostsThe Zacks analyst is worried about the high fuel and labor costs which are hurting the company's bottom line. American Airlines' liquidity position is also concerning.\nWeak Lithium Prices, Specialties Unit Ail Albemarle (ALB)Per the Zacks analyst, Albemarle faces margin headwinds from weaker lithium market pricing. The softness in consumer electronics markets will also hurt its Specialties segment.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nAmerican Express Company (AXP) : Free Stock Analysis Report\nDell Technologies Inc. (DELL) : Free Stock Analysis Report\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\nGE HealthCare Technologies Inc. (GEHC) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-10T21:45:22.000Z",
        "Title": "Here's Why Berkshire Hathaway B (BRK.B) Gained But Lagged the Market Today",
        "Author": "  Zacks Equity Research ",
        "Text": "Berkshire Hathaway B (BRK.B) closed at $413.79 in the latest trading session, marking a +0.8% move from the prior day. The stock's performance was behind the S&P 500's daily gain of 1.02%. On the other hand, the Dow registered a gain of 1.09%, and the technology-centric Nasdaq increased by 1.18%.\nThe the stock of company has risen by 0.49% in the past month, leading the Finance sector's loss of 5.14% and undershooting the S&P 500's gain of 4.44%.\nThe upcoming earnings release of Berkshire Hathaway B will be of great interest to investors. The company's upcoming EPS is projected at $5.10, signifying a 10.39% increase compared to the same quarter of the previous year. In the meantime, our current consensus estimate forecasts the revenue to be $97.31 billion, indicating a 5.19% growth compared to the corresponding quarter of the prior year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $18.71 per share and revenue of $368.44 billion. These totals would mark changes of +8.91% and +1.09%, respectively, from last year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Berkshire Hathaway B. These revisions help to show the ever-changing nature of near-term business trends. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. Berkshire Hathaway B currently has a Zacks Rank of #3 (Hold).\nWith respect to valuation, Berkshire Hathaway B is currently being traded at a Forward P/E ratio of 21.95. This signifies a premium in comparison to the average Forward P/E of 12.46 for its industry.\nOne should further note that BRK.B currently holds a PEG ratio of 3.14. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Insurance - Property and Casualty stocks are, on average, holding a PEG ratio of 1.52 based on yesterday's closing prices.\nThe Insurance - Property and Casualty industry is part of the Finance sector. With its current Zacks Industry Rank of 52, this industry ranks in the top 21% of all industries, numbering over 250.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-31T20:29:00.000Z",
        "Title": "Berkshire Hathaway Inc. Information Regarding Second Quarter Earnings Release",
        "Author": "Business Wire ",
        "Text": "OMAHA, Neb., July 31, 2024--(BUSINESS WIRE)--(BRK.A; BRK.B) – Berkshire Hathaway Inc.’s second quarter earnings release and its quarterly report on Form 10-Q will be posted on the Internet on Saturday, August 3, 2024, at approximately 7:00 a.m. Central time where it can be accessed at www.berkshirehathaway.com.\nAbout Berkshire\nBerkshire Hathaway and its subsidiaries engage in diverse business activities including insurance and reinsurance, utilities and energy, freight rail transportation, manufacturing, retailing and services. Common stock of the company is listed on the New York Stock Exchange, trading symbols BRK.A and BRK.B.\nCautionary Statement\nCertain statements contained in this press release are \"forward looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. Berkshire assumes no obligation and does not intend to update these forward-looking statements.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240731273169/en/\nContacts\nMarc D. Hamburg402-346-1400\n"
    },
    {
        "Date": "2024-07-17T13:44:00.000Z",
        "Title": "The Zacks Analyst Blog Berkshire Hathaway, McDonald's, American Express and Steel Partners Holdings",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – July 17, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Berkshire Hathaway Inc. (BRK.B), McDonald's Corp. MCD and American Express Co. AXP, Steel Partners Holdings L.P. SPLP.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc., McDonald's Corp.  and American Express Co., as well as a micro-cap stock Steel Partners Holdings L.P. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Berkshire Hathaway have outperformed the Zacks Insurance - Property and Casualty industry over the year-to-date period (+21.8% vs. +19.9%). The company is one of the largest property and casualty insurance companies with numerous diverse business activities. A strong cash position supports earnings-accretive bolt-on buyouts and is indicative of its financial flexibility.Continued insurance business growth fuels increase in float, drive earnings and generates maximum return on equity. The non-insurance businesses have also been doing well in the last few years. The addition of Pilot Travel Centers (PTC) has strengthened its energy business. A sturdy capital level provides further impetus.However, exposure to cat loss induces earnings volatility and also affects the underwriting results. Huge capital expenditure remains a headwind. With the demise of Charles Munger, uncertainty looms over the company's performance.(You can read the full research report on Berkshire Hathaway here >>>)McDonald's shares have underperformed the Zacks Retail - Restaurants industry over the past year (-14.8% vs. -12.4%). The company is witnessing macroeconomic challenges and commodity and wage inflation are primary headwinds. Earnings estimates for 2024 have declined in the past 60 days, depicting analysts' concern regarding the stock growth potential.Nevertheless, McDonald’s is likely to benefit from marketing campaigns, unit expansion and a loyalty program. McDonald’s is increasing its focus on menu innovation, as it believes that the strengthening of the core menu and solid marketing are likely to pave the way for additional growth in the upcoming periods.Also, emphasis on Accelerating the Arches strategy bodes well. McDonald’s expects its velocity accelerators of Experience of the Future, digital and delivery to drive growth over the long term.(You can read the full research report on McDonald’s here >>>)Shares of American Express have outperformed the Zacks Financial - Miscellaneous Services industry over the past year (+39.3% vs. +13.0%). The company’s growth initiatives, like launching new products, reaching new agreements and forging alliances, are boosting its revenues.Consumer spending on T&E, which carries higher margins for AmEx, is advancing well. Its balance sheet looks strong with ample cash. Solid cash-generation abilities enable the pursuit of business investments and prudent deployment of capital via buybacks and dividends.However, with higher utilization of the firm’s cards, costs in the form of card member services and card member rewards are likely to go up. Rising marketing costs are straining its margins. Its current debt level amid a high-interest rate environment induces a rise in interest expenses. The stock is overvalued at the moment. As such, the stock warrants a cautious stance.(You can read the full research report on American Express here >>>)Steel Partners' shares have underperformed the Zacks Diversified Operations industry over the past year (-3.8% vs. +9.9%). This microcap company with market capitalization of $734.16 million have seen EBITDA margin declined from 14.2% to 12.3% in the first quarter of 2024 due to an underperformance in the Energy and Diversified Industrial segments. Energy revenues fell 33.7% and Diversified Industrial sales decreased 3.9%, impacting profitability. Also, fluctuations due to geopolitical tensions impact operational costs and investor confidence.Nevertheless, Steel Partners' revenues rose 7% year over year to $476.3 million in the first quarter of 2024, driven by a consolidation in its supply chain and an 18.5% rise in Financial Services revenues.With a diversified portfolio across various sectors and the inclusion of Steel Connect, SPLP mitigates risks and boosts growth. As of Mar 31, 2024, SPLP had $273.9 million in cash, with debt reduced to $92.8 million. SPLP also reduced interest expenses by 76.7% in the first quarter.(You can read the full research report on Steel Partners here >>>)\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmerican Express Company (AXP) : Free Stock Analysis Report\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-20T06:01:08.000Z",
        "Title": "Berkshire sells around $1.48 billion Bank of America shares, filing shows",
        "Author": "Reuters ",
        "Text": "(Reuters) -Berkshire Hathaway sold about 33.9 million shares of Bank of America for around $1.48 billion over multiple transactions this week, a regulatory filing showed.\nAfter the sale, Berkshire owned about 999 million BofA shares.\nBerkshire is one of the Charlotte, North Carolina-based lender's largest shareholder. It also invests in several other banks, including Wells Fargo & Co and JPMorgan Chase\nThe conglomerate, owned by Warren Buffett, began investing in Bank of America in 2011, purchasing $5 billion of preferred stock plus warrants to buy 700 million common shares, at a time many investors worried about the bank's capital needs.\n(Reporting by Chandni Shah and Surbhi Misra in Bengaluru; Editing by Sam Holmes and Tomasz Janowski)\n"
    },
    {
        "Date": "2024-07-01T12:17:00.000Z",
        "Title": "Berkshire Hathaway Specialty Insurance Expands to the Nordics, Names Regional and Product Line Leadership",
        "Author": "Business Wire ",
        "Text": "BOSTON & STOCKHOLM, July 01, 2024--(BUSINESS WIRE)--Berkshire Hathaway Specialty Insurance (BHSI) today announced that it has expanded its operations to the Nordic countries, opening an office in Stockholm, and naming Anna Green as Head of Nordics. BHSI has also appointed Karin Bryner as Head of Executive & Professional Lines and Anton Holmgren as Head of General Property, for the Nordics.\n\"Launching BHSI in the Nordics is an exciting continuation of BHSI’s steady global expansion. We will continue to expand our local team and capabilities, and look forward to bringing the certainty of BHSI’s financial strength, underwriting acumen, and CLAIMS IS OUR PRODUCT philosophy to customers and distribution partners throughout Sweden, Denmark, Norway, and Finland,\" said Andreas Krause, Head of DACH, BHSI.\nBeginning immediately, BHSI’s Nordic office is underwriting Executive & Professional Lines, General Property, Energy, and Construction.\n\"We look forward to building a strong team in the Nordics and bringing BHSI’s commitment to excellent technical underwriting and highly responsive service to the market. We have already had great response from brokers and customers,\" said Anna Green, Head of Nordics, BHSI.\nAnna Green takes the reins as Head of Nordics with industry experience spanning the Nordics, as well as Europe, the UK, and the Asia Pacific region. Anna started her insurance career more than 20 years ago and was most recently CEO of the Sweden Branch of another global insurer. Anna has deep expertise in Specialty and Environmental underwriting. She is based in Stockholm and can be reached at anna.green@bhspecialty.com.\nKarin Bryner comes to her role as Head of Executive & Professional Lines with more than 20 years of experience in financial lines underwriting, including more than a decade focused on Nordic risks. She was most recently Underwriting Manager, Financial Lines in Sweden, at another global insurer. She is based in Stockholm and can be reached at Karin.Bryner@bhspecialty.com.\nAnton Holmgren brings more than a decade of property underwriting experience to his role as Head of General Property. He has held increasingly senior underwriting roles over his career, including Nordic Head of Underwriting, Property, Engineering Lines & Marine, at another global insurer. He will be based in Stockholm and can be reached at Anton.holmgren@bhspecialty.com.\nBHSI’s new office in Sweden is located at:\nBrahegatan 10114 37 StockholmSweden\nIn Europe, Berkshire Hathaway Specialty Insurance (BHSI) trades under Berkshire Hathaway European Insurance DAC (BHEI) and Berkshire Hathaway International Insurance Limited (BHIIL). BHEI is an Irish domiciled Designated Activity Company, Registration Number 636883 and Registered Office at 2nd Floor, 7 Grand Canal Street Lower, Dublin D02 KW81. Berkshire Hathaway International Insurance Limited (BHIIL) is an incorporated England and Wales limited liability company, Registration Number 3230337 and Registered Office at 8 Fenchurch Place, 4th Floor, London EC3M 4AJ, United Kingdom. BHEI and BHIIL are affiliates of Berkshire Hathaway Specialty Insurance Company (BHSIC), a Nebraska USA domiciled corporation, which provides commercial property, casualty, healthcare professional liability, executive and professional lines, transactional liability, surety, marine, travel, programs, accident and health, medical stop loss, homeowners, and multinational insurance. BHSIC, BHIIL and BHEI are subsidiaries of Berkshire Hathaway's National Indemnity group of insurance companies, which hold financial strength ratings of A++ from AM Best and AA+ from Standard & Poor's. Based in Boston, Berkshire Hathaway Specialty Insurance has offices in Atlanta, Boston, Chicago, Columbia, Dallas, Houston, Indianapolis, Irvine, Los Angeles, New York, Plymouth Meeting, San Francisco, San Ramon, Seattle, Stevens Point, Adelaide, Auckland, Barcelona, Brisbane, Brussels, Cologne, Dubai, Dublin, Frankfurt, Hong Kong, Kuala Lumpur, London, Lyon, Macau, Madrid, Manchester, Melbourne, Milan, Munich, Paris, Perth, Singapore, Stockholm, Sydney, Toronto, and Zurich.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240630408644/en/\nContacts\nMEDIAJoAnn Lee / +1 617.936.2937\n"
    },
    {
        "Date": "2024-07-24T20:41:00.000Z",
        "Title": "Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division Names Marjorie Hutchings as Chief Information Officer",
        "Author": "Business Wire ",
        "Text": "Marjorie Hutchings brings over three decades of technology expertise to BHHC, advancing its Workers Compensation Division’s innovation and operational excellence\nSAN FRANCISCO, July 24, 2024--(BUSINESS WIRE)--Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division today announced the appointment of Marj Hutchings as the new Chief Information Officer (CIO). With 35 years of experience in technology, 27 of which are in the insurance industry, Hutchings will oversee the IT organization’s administration, daily operations, and strategic planning.\n\"Marj is an exceptional technology leader whose vast experience and innovative mindset will be instrumental in driving our IT initiatives forward,\" said Rob Darby, President and CEO of BHHC Workers Compensation. \"Her extensive background in modernizing applications, data security, and cloud implementation aligns well with our strategic goals to enhance operational efficiency and deliver superior service and data security to our policyholders and agency partners.\"\nBefore joining BHHC, Hutchings served as the CIO at State Fund, where she was pivotal in a project overseeing the replacement of multiple independent systems with a unified software suite. Her experience includes work on property and casualty claims systems, customer-facing web platforms, virtualization of production systems, and the implementation of private cloud infrastructure. She was also an original member of the technology team for the insurance startup Esurance, an Allstate company focusing on leveraging advanced technology to drive business strategy.\n\"We are excited to welcome Marj to our leadership team,\" added Darby. \"Her proven track record in technology management and her ability to lead complex projects make her an excellent fit for BHHC as we continue to innovate and expand our capabilities in the workers compensation insurance sector.\"\nHutchings holds a Bachelor of Science in Business Administration/Computer Information Systems from Northern Arizona University and is a Leadership Fellow of the National Association of Corporate Directors (NACD).\nAbout Berkshire Hathaway Homestate Companies\nThe Berkshire Hathaway Homestate Companies (BHHC) are a group of six insurance carriers that are part of the Berkshire Hathaway insurance group. Headquartered in Omaha, Nebraska, and with over 50 years in business, BHHC has evolved from a regional carrier to a national insurance group, writing a diverse book of policies from coast to coast. The Berkshire Hathaway Homestate Companies include Berkshire Hathaway Homestate Insurance Company, BHHC Special Risks Insurance Company, Continental Divide Insurance Company, Cypress Insurance Company, Oak River Insurance Company, and Redwood Fire and Casualty Insurance Company.\nBHHC has earned an enviable record of success in the insurance industry. Our financial strength provides our employees, agency partners, and policyholders with an assurance of stability, and we’ve earned AM Best's highest financial strength rating of A++ (Superior) (as of February 22, 2024).\nVisit www.bhhc.com to learn more.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240724680247/en/\nContacts\nMedia: media@bhhc.com\n"
    },
    {
        "Date": "2024-07-25T13:51:00.000Z",
        "Title": "AM Best Affirms Credit Ratings of Berkshire Hathaway GUARD Insurance Companies’ Members",
        "Author": "Business Wire ",
        "Text": "OLDWICK, N.J., July 25, 2024--(BUSINESS WIRE)--AM Best has affirmed the Financial Strength Rating of A+ (Superior) and the Long-Term Issuer Credit Ratings of \"aa-\" (Superior) of WestGUARD Insurance Company, AmGUARD Insurance Company, EastGUARD Insurance Company, NorGUARD Insurance Company and AZGUARD Insurance Company (Omaha, NE), which operate under an intercompany pooling agreement. These companies are members of Berkshire Hathaway GUARD Insurance Companies (GUARD) and are domiciled in Wilkes-Barre, PA, unless otherwise specified. The outlook of these Credit Ratings (ratings) is stable.\nThe ratings reflect GUARD’s balance sheet strength, which AM Best assesses as strongest, as well as its adequate operating performance, neutral business profile and appropriate enterprise risk management, with lift from parental support.\nGUARD has maintained risk-adjusted capitalization consistently at the strongest level, as measured by Best’s Capital Adequacy Ratio (BCAR). The group’s overall balance sheet strength also benefits from ample liquidity, aided by significant allocations to cash and high-quality, short-duration fixed income investments. Similar to other Berkshire Hathaway Inc. (Berkshire) affiliates, GUARD also has a relatively high allocation to equity investments. This can lead to occasional fluctuations in surplus levels during periods of capital market volatility, but Berkshire’s investment strategies historically have demonstrated a track record of positive returns and capital appreciation over time. GUARD’s overall balance sheet strength assessment also considers its uneven loss reserve development patterns over the past several years, which has included occasional reserve strengthening in certain business lines outside of its core workers’ compensation product offerings.\nGUARD’s operating performance declined sharply in 2023, following a period of several years when the group had generated results consistently that were supportive of the adequate operating performance assessment. GUARD’s results in 2023 included significant underwriting losses that included the impact of material reserve strengthening across several business lines. AM Best notes that GUARD has made several changes to its senior management team over the past 12 months, and that the group’s new leadership has implemented a number of underwriting initiatives that are intended to improve performance while refocusing the group on its aim to be a national primary carrier for micro and small business owners, offering one-stop-shop insurance solutions while growing its excess & surplus market presence. AM Best expects the company’s performance metrics to improve gradually given the changes described above, and that its overall operating results will return to levels that are supportive of its current ratings over the near term.\nGUARD’s ratings further recognize the implicit and explicit financial support provided by GUARD’s immediate parent, National Indemnity Company, a subsidiary of Berkshire, including significant capital support via reinsurance transactions and capital contributions.\nThis press release relates to Credit Ratings that have been published on AM Best’s website. For all rating information relating to the release and pertinent disclosures, including details of the office responsible for issuing each of the individual ratings referenced in this release, please see AM Best’s Recent Rating Activity web page. For additional information regarding the use and limitations of Credit Rating opinions, please view Guide to Best's Credit Ratings. For information on the proper use of Best’s Credit Ratings, Best’s Performance Assessments, Best’s Preliminary Credit Assessments and AM Best press releases, please view Guide to Proper Use of Best’s Ratings & Assessments.\nAM Best is a global credit rating agency, news publisher and data analytics provider specializing in the insurance industry. Headquartered in the United States, the company does business in over 100 countries with regional offices in London, Amsterdam, Dubai, Hong Kong, Singapore and Mexico City. For more information, visit www.ambest.com.\nCopyright © 2024 by A.M. Best Rating Services, Inc. and/or its affiliates. ALL RIGHTS RESERVED.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240725805111/en/\nContacts\nGuilherme Monteiro Simoes, CFA Senior Financial Analyst +1 908 882 2317 guy.simoes@ambest.com\nChristopher Sharkey Associate Director, Public Relations +1 908 882 2310 christopher.sharkey@ambest.com\nGregory Dickerson Director +1 908 882 1737 gregory.dickerson@ambest.com\nAl Slavin Senior Public Relations Specialist +1 908 882 2318 al.slavin@ambest.com\n"
    },
    {
        "Date": "2024-07-16T02:07:53.000Z",
        "Title": "Watch These Berkshire Hathaway Price Levels After Stock Closes at Record High",
        "Author": "  Timothy Smith ",
        "Text": "\nShares in Berkshire Hathaway closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings.\nThe stock broke out from a symmetrical triangle, a chart pattern that suggests a continuation of the current uptrend.\nThe measuring principle projects a near-term price target in the shares of $465, while a bars pattern projects a longer-term target of around $500.\nDuring retracements, Berkshire shares may find support around $415 from the symmetrical triangle's top trendline, and near a multi-month uptrend line at $390.\n\nShares in Warren Buffett's Berkshire Hathaway (BRK.A, BRK.B) closed at a record high on Monday, buoyed by gains in some of the conglomerate’s key holdings, including Apple (AAPL), American Express, (AXP), Chevron (CVX), and Occidental Petroleum (OXY). Investors typically view the performance of the company’s stock, which trades at about 23 times analysts' full-year operating profit projections, as a proxy for the health of the U.S. economy due to its diversification across a broad range of industries.\nBerkshire Hathaway shares added 2.4% to finish Monday's session at $434.42.\nAmid the stock’s move to record highs, we’ll take a closer look at the technicals on the Berkshire Hathaway weekly chart and identify important levels to watch out for.\nSince bottoming out midway between the 50- and 200-week moving averages (MAs) in early October last year. Berkshire shares have trended consistently higher. More recently, the price broke out from textbook symmetrical triangle, a chart pattern that indicates a continuation of the current uptrend.\nImportantly, the initial breakout from the pattern occurred on the highest weekly trading volume since late February, suggesting buying conviction behind the move. Moreover, the relative strength index (RSI) sits just below overbought levels to confirm strong price momentum in the stock.\nBelow, we’ll use two different technical analysis techniques to predict near-term and longer-term price targets. These levels help us determine a general area on the chart where Berkshire shares may climb to and encounter resistance if the price continues to trend higher.\nTo forecast a potential short-term price target, we can use the measuring principle. We do this by calculating the distance between the symmetrical triangle’s two trendlines near their widest point and apply that amount to the breakout area. For example, we add $50 to $415, which projects a target at $465\nInvestors can speculate a longer-term price target by using a chart overlay of prior price action. This works by taking the bars pattern from the uptrend that preceded the symmetrical triangle and applying it to the most recent swing low. In this case, we take the bullish bars pattern between October 2023 and February this year and align it with the April low, which indicates a possible upside target of around $500.\nInvestors looking for a key pullback level should keep an eye on the $415 area, where Berkshire shares would likely find buying interest near the symmetrical triangle’s top trendline. A more significant retracement could see the stock revisit a multi-month uptrend trendline around $390, with this location also sitting in close proximity to the 50-week MA.\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info.\nAs of the date this article was written, the author does not own any of the above securities.\nRead the original article on Investopedia.\n"
    },
    {
        "Date": "2024-07-24T20:41:00.000Z",
        "Title": "Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division Names Marjorie Hutchings as Chief Information Officer",
        "Author": "Business Wire ",
        "Text": "Marjorie Hutchings brings over three decades of technology expertise to BHHC, advancing its Workers Compensation Division’s innovation and operational excellence\nSAN FRANCISCO, July 24, 2024--(BUSINESS WIRE)--Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division today announced the appointment of Marj Hutchings as the new Chief Information Officer (CIO). With 35 years of experience in technology, 27 of which are in the insurance industry, Hutchings will oversee the IT organization’s administration, daily operations, and strategic planning.\n\"Marj is an exceptional technology leader whose vast experience and innovative mindset will be instrumental in driving our IT initiatives forward,\" said Rob Darby, President and CEO of BHHC Workers Compensation. \"Her extensive background in modernizing applications, data security, and cloud implementation aligns well with our strategic goals to enhance operational efficiency and deliver superior service and data security to our policyholders and agency partners.\"\nBefore joining BHHC, Hutchings served as the CIO at State Fund, where she was pivotal in a project overseeing the replacement of multiple independent systems with a unified software suite. Her experience includes work on property and casualty claims systems, customer-facing web platforms, virtualization of production systems, and the implementation of private cloud infrastructure. She was also an original member of the technology team for the insurance startup Esurance, an Allstate company focusing on leveraging advanced technology to drive business strategy.\n\"We are excited to welcome Marj to our leadership team,\" added Darby. \"Her proven track record in technology management and her ability to lead complex projects make her an excellent fit for BHHC as we continue to innovate and expand our capabilities in the workers compensation insurance sector.\"\nHutchings holds a Bachelor of Science in Business Administration/Computer Information Systems from Northern Arizona University and is a Leadership Fellow of the National Association of Corporate Directors (NACD).\nAbout Berkshire Hathaway Homestate Companies\nThe Berkshire Hathaway Homestate Companies (BHHC) are a group of six insurance carriers that are part of the Berkshire Hathaway insurance group. Headquartered in Omaha, Nebraska, and with over 50 years in business, BHHC has evolved from a regional carrier to a national insurance group, writing a diverse book of policies from coast to coast. The Berkshire Hathaway Homestate Companies include Berkshire Hathaway Homestate Insurance Company, BHHC Special Risks Insurance Company, Continental Divide Insurance Company, Cypress Insurance Company, Oak River Insurance Company, and Redwood Fire and Casualty Insurance Company.\nBHHC has earned an enviable record of success in the insurance industry. Our financial strength provides our employees, agency partners, and policyholders with an assurance of stability, and we’ve earned AM Best's highest financial strength rating of A++ (Superior) (as of February 22, 2024).\nVisit www.bhhc.com to learn more.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240724680247/en/\nContacts\nMedia: media@bhhc.com\n"
    },
    {
        "Date": "2024-07-22T14:00:01.000Z",
        "Title": "Why Berkshire Hathaway Is Likely to Continue to Sell Its Apple Stake",
        "Author": "  Grahamites ",
        "Text": "In a previous discussion, I wrote about potential reasons why Apple Inc. (NASDAQ:AAPL) is missing from the permanent holding list for Warren Buffett (Trades, Portfolio)'s Berkshire Hathaway(NYSE:BRK.A)(NYSE:BRK.B). Shortly after publication, the insurance conglomerate reported that it cut its stake in the tech giant by about 13% during the first quarter.\nWarning! GuruFocus has detected 4 Warning Signs with CCL.\nThis 13% cut is the second quarter in a row that Buffett has trimmed Berkshire's massive Apple position. The company also sold about 1% of its Apple position during the fourth quarter of 2023. Berkshire's first-quarter sale marked its largest cut in Berkshire's Apple stake since the initial purchase in 2016. I believe Buffett is very likely to continue to sell down the Apple stake over the next several quarters and years for a few reasons.\nWhen asked about the Apple sale during the annual meeting, Buffett said the following:\n\"Almost everybody I know pays a lot more attention to not paying taxes than I think they should. We don't mind paying taxes at Berkshire, and we are paying a 21% federal rate on the gains we're taking in Apple and that rate was 35% not too long ago, and it's been 52% in the past when I've been operatingIt doesn't bother me in the least to write that check and I would really hope that with all that America has done for all of you, it shouldn't bother you that we do it and if I'm doing it at 21%, and we're doing it at a lot higher percentage later on, I don't think you'll actually mind that we sold a little Apple this year.\nEssentially Buffett said that he is selling Apple now because the capital gains tax rate is at a very low level and he thinks the capital gain tax rate may rise in the future due to the growing budget deficit. Here the guru is again subtlety insinuating that the company is not a permanent holding for Berkshire Hathaway because if it doesn't consider selling Apple at all, then the tax rate does not matter.\nApple's current valuation, driven by years of strong performance, has reached a peak level. The following chart shows Apple's price-to-owner earnings, price-sales and price-book ratios all reached peak levels.\nNot only is Apple's valuation at peak level, its margin expansion, which is driven by both improving operational efficiency and higher contribution from higher-margin service revenue, may also have reached its peak, leaving little room for future margin expansion.\nApple's potential peak margin, combined with the possible slowdown in the growth rate of the smartphone business and the heightened competition from Huawei, suggest revenue and earnings may struggle to sustain the impressive growth rate achieved in recent years. In fact, we have already noticed a slowdown in recent quarters. It has yet to be seen whether the hype surrounding Apple Intelligence, the company's version of artificial intelligence, will materially boost the sales of the next generation of iPhones.\nCEO Tim Cook started Apple's share buyback program in 2013. Since then, the company has repurchased $651 billion worth of its common stock, reducing its share count by 11 billion shares, or roughly 41% of its outstanding shares. From 2013 to 2019, Apple's stock was very cheap, making the stock repurchases extremely value-additive.\nThe stock got cheap again for a short period of time during 2020 and 2022. However, as I pointed out above, at the present market price, Apple's valuation has reached peak level. At this level, stock buybacks are very unlikely to be the best way to allocate capital. Nonetheless, share repurchases remain Apple's largest capital allocation option. Therefore, its return from capital allocation is almost guaranteed to decline from what it has been over the past decade.\nBuffett has repeatedly cited Cook's leadership as a major reason for his investment decision. Cook has proven that he possesses the rare skillset of both operational excellence and outstanding capital allocation capability.\nCook is turning 64 in November. By Berkshire's standard, he is far from retirement age. However, the CEO himself has publicly said he will not stick around for many years. Concerns over Cook's retirement first emerged in 2021 when he said he \"will probably be leaving Apple in the next 10 years, A recent report from Bloomberg wrote that people close to him believe Cook will be Apple's CEO for at least another three years.\nAs I wrote in my previous discussion, Apple is not an idiot-proof business. Cook's potential retirement may not be imminent, but Buffett must be thinking about it.\nGiven the uncertainties surrounding capital gains tax rates, concerns about Apple's peak valuation and peak margin, diminishing returns from capital allocation and the potential retirement of Cook, it is extremely likely that Berkshire Hathaway will continue to trim its massive position in Apple. We will find out over the next few quarters.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-07-26T07:38:00.000Z",
        "Title": "Berkshire (BRK.B) Rises 24% YTD: What Should Investors Do Now?",
        "Author": "  Tanuka De ",
        "Text": "Shares of Berkshire Hathaway Inc. (BRK.B) have gained 23.8% year to date, outperforming the industry’s 22.6% growth, the Finance sector’s rise of 18.2% and the S&P 500 composite’s rise of 19.3%.  Berkshire Hathaway is a conglomerate with more than 90 subsidiaries engaged in diverse business activities. Per Warren Buffett, its “strength comes from its Niagara of diverse earnings delivered after interest costs, taxes and substantial charges for depreciation and amortization.” Its property and casualty insurance business, one of the largest property and casualty insurance companies, generates the maximum return on equity.\nImage Source: Zacks Investment Research\nBerkshire shares are trading well above the 50-day moving average, indicating a bullish trend. Shares are trading near the high end of its 52-week range. \nImage Source: Zacks Investment Research\nAmong its diverse business activities, the most important is its insurance operations, which contribute around one-fourth of Berkshire’s top line. The insurance business is poised for long-term growth, banking on increased exposure, prudent underwriting standards and better pricing. Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. Notably, Berkshire generated underwriting profit in 18 of the last 20 years. However, when catastrophes occur, like other insurers, Berkshire’s underwriting profitability is affected, resulting in a deterioration of its combined ratio. In a favorable interest rate environment, it derives higher interest income from short-term investments.Berkshire Hathaway’s economically sensitive non-insurance businesses — Utilities and Energy, and Manufacturing, Service and Retail — are performing well. The Utilities and Energy business has grown with increased revenue contributions from Burlington Northern SantaFe Corp. However, unfavorable changes in the business mix and lower fuel surcharge revenues are areas of concern. Nonetheless, lower fuel costs are expected to limit any downside.  Demand for utilities is expected to be strong in the future and drive earnings growth. Increasing demand for goods and services, given an improved economic backdrop, should benefit its Manufacturing, Service and Retail operations. Collectively, these have driven revenues higher and facilitated margin expansion over the past many years.With a huge cash hoard, we believe Berkshire Hathaway will successfully continue its acquisition spree, acquiring entities that have consistent earning power and generate impressive returns on equity. While big acquisitions open up more business opportunities for the company, bolt-on acquisitions enhance the earnings of the existing business.  Warren Buffett has always eyed acquisitions or made investments in properties that are undervalued or have potential for growth. Investments in Coca-Cola KO and American Express AXP show the investment acumen of Warren Buffet and Charlie Munger. Berkshire Hathaway also has stakes in behemoths like Apple, Bank of America, Chevron and Occidental Petroleum.Also, Berkshire Hathaway's liquidity helps it repurchase shares regularly. It bought back shares worth $2.6 billion in the first quarter of 2024.\nThe stock is overvalued compared to its industry. It is currently trading at a price-to-book multiple of 1.65, higher than the industry average of 1.56.  However, we believe that given Berkshire Hathaway's dominant market presence, diverse business activities, and, above all, the name Warren Buffet, a premium valuation is quite justified for this Zacks Rank #3 (Hold) stock.\nImage Source: Zacks Investment Research\nReturn on equity in the trailing 12 months was 7.3%, underperforming the industry average of 7.8%. Return on equity, a profitability measure, reflects how effectively a company is utilizing its shareholders. It's noteworthy that though BRK.B’s ROE is lagging behind the industry average, the company successfully improved the same even during the pandemic. \nImage Source: Zacks Investment Research\nThe same holds true for return on invested capital (ROIC), which has increased every year since 2020. This reflects BRK.B’s efficiency in utilizing funds to generate income. However, ROIC in the trailing 12 months was 5.7%, lower than the industry average of 5.9%.\nImage Source: Zacks Investment Research\nOne of the two analysts covering the stock has raised estimates for 2024 and 2025 over the past 30 days, while one has lowered the same for 2025. Thus, the Zacks Consensus Estimate for 2024 implies a 0.4% year-over-year increase, while the same for 2025 suggests a 0.6% decrease.\nImage Source: Zacks Investment Research\nIn a letter to shareholders, Warren Buffett stated that Berkshire Hathaway has the largest GAAP net worth recorded by any American business and it occupies about 6% of the total GAAP net worth of S&P 500 companies.Holding shares of Berkshire Hathaway renders dynamism to a shareholder's portfolio. It gives a feel of investing in mutual funds apart from rewarding investors with higher returns at the same time. But above all, the company has Warren Buffett at its helm, who has been creating tremendous value for shareholders over nearly six decades with his unique skills. Thus, investors who already hold Berkshire shares should continue to retain the stock in their portfolio.However, given its premium valuation, new investors can wait for a better entry point. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nAmerican Express Company (AXP) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-24T20:41:00.000Z",
        "Title": "Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division Names Marjorie Hutchings as Chief Information Officer",
        "Author": "Business Wire ",
        "Text": "Marjorie Hutchings brings over three decades of technology expertise to BHHC, advancing its Workers Compensation Division’s innovation and operational excellence\nSAN FRANCISCO, July 24, 2024--(BUSINESS WIRE)--Berkshire Hathaway Homestate Companies (BHHC), Workers Compensation Division today announced the appointment of Marj Hutchings as the new Chief Information Officer (CIO). With 35 years of experience in technology, 27 of which are in the insurance industry, Hutchings will oversee the IT organization’s administration, daily operations, and strategic planning.\n\"Marj is an exceptional technology leader whose vast experience and innovative mindset will be instrumental in driving our IT initiatives forward,\" said Rob Darby, President and CEO of BHHC Workers Compensation. \"Her extensive background in modernizing applications, data security, and cloud implementation aligns well with our strategic goals to enhance operational efficiency and deliver superior service and data security to our policyholders and agency partners.\"\nBefore joining BHHC, Hutchings served as the CIO at State Fund, where she was pivotal in a project overseeing the replacement of multiple independent systems with a unified software suite. Her experience includes work on property and casualty claims systems, customer-facing web platforms, virtualization of production systems, and the implementation of private cloud infrastructure. She was also an original member of the technology team for the insurance startup Esurance, an Allstate company focusing on leveraging advanced technology to drive business strategy.\n\"We are excited to welcome Marj to our leadership team,\" added Darby. \"Her proven track record in technology management and her ability to lead complex projects make her an excellent fit for BHHC as we continue to innovate and expand our capabilities in the workers compensation insurance sector.\"\nHutchings holds a Bachelor of Science in Business Administration/Computer Information Systems from Northern Arizona University and is a Leadership Fellow of the National Association of Corporate Directors (NACD).\nAbout Berkshire Hathaway Homestate Companies\nThe Berkshire Hathaway Homestate Companies (BHHC) are a group of six insurance carriers that are part of the Berkshire Hathaway insurance group. Headquartered in Omaha, Nebraska, and with over 50 years in business, BHHC has evolved from a regional carrier to a national insurance group, writing a diverse book of policies from coast to coast. The Berkshire Hathaway Homestate Companies include Berkshire Hathaway Homestate Insurance Company, BHHC Special Risks Insurance Company, Continental Divide Insurance Company, Cypress Insurance Company, Oak River Insurance Company, and Redwood Fire and Casualty Insurance Company.\nBHHC has earned an enviable record of success in the insurance industry. Our financial strength provides our employees, agency partners, and policyholders with an assurance of stability, and we’ve earned AM Best's highest financial strength rating of A++ (Superior) (as of February 22, 2024).\nVisit www.bhhc.com to learn more.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240724680247/en/\nContacts\nMedia: media@bhhc.com\n"
    },
    {
        "Date": "2024-07-09T17:44:53.000Z",
        "Title": "How Much Berkshire Hathaway Stock Does the Gates Foundation Own?",
        "Author": "  Ryan Vanzo, The Motley Fool ",
        "Text": "Judging by the disclosed holdings in the Gates Foundation (formerly called the Bill and Melinda Gates Foundation Trust), one would think that billionaire Bill Gates is a big fan of Warren Buffett. According to its latest 13F filing, the foundation run by Gates owns a huge amount of Buffett's holding company, Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B).\nRight now, the largest stock position in the $46 billion trust's publicly disclosed portfolio is Microsoft. Gates co-founded Microsoft back in 1975 and in 2010 he committed to donating his entire stake in Microsoft to charity by the time he died. As a result, much of the foundation's holdings in Microsoft came from Gates' donations over the years. Today, the trust's stake in Microsoft is valued at around $15.4 billion.\nBerkshire Hathaway, meanwhile, is the third-largest position in the trust's portfolio at around $7.3 billion. Most of those Berkshire shares were donated to the foundation by Buffett.\nAfter Gates committed to donating the majority of his wealth to charity more than a decade ago, Buffett immediately joined him in making a similar pledge. A trust was launched in 2000 and was initially run by Gates, his now ex-wife Melinda French Gates, and Buffett. Together, the trio convinced dozens of other billionaires to also donate the majority of their wealth to various charitable causes. Buffett served as a member of the foundation's board until June 2021. Melinda Gates resigned from the board effective June 2024. Since 2021, Buffett started donating portions of his Berkshire stock to other charitable trusts instead, including trusts run by his three children.\nWhile Berkshire Hathaway stock trades at all-time highs, the foundation's stake has shrunk in recent quarters (the sale is partly related to stipulations for how the donated stock must be used by the trust). Last quarter, for example, it trimmed its stake by 2.6 million shares -- a reduction of around 13%. However, don't expect it to disappear from the portfolio completely anytime soon. There are still plenty of funds left to utilize for charitable causes.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $785,556!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nRyan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nHow Much Berkshire Hathaway Stock Does the Gates Foundation Own? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-07-23T23:33:00.000Z",
        "Title": "Warren Buffett's Berkshire sheds Bank of America stock",
        "Author": "  Dan Weil ",
        "Text": "Legendary investor Warren Buffett, chief executive of Berkshire Hathaway  (BRK.B) , has succeeded in a wide variety of industries, including financial services.\nPremiums from his insurance holdings finance much of his other investments. Buffett began accumulating shares of insurer GEICO in 1951. It’s now wholly-owned by Berkshire, representing a foundational part of Buffett’s holdings.\nBerkshire helped ensure the U.S. financial system’s stability with purchases of Goldman Sachs equity in the financial crisis of 2008 and of Bank of America stock during a turbulent period in 2011. Berkshire also made hefty profits for itself with the deals.\nBuffett has also had great success with his investment in credit card titan American Express  (AXP) . Berkshire owned $37.5 million of its shares, as of March 31.\nKevin Dietsch/Getty Images\nBerkshire’s biggest positions in financial stocks (all as of March 31, except as noted) are:\nBank of America  (BAC) , with Berkshire’s stake worth $42.5 billion as of July 19\nAmEx, worth $37.5 million\nSecurities ratings agency Moody’s  (MCO) , worth $11.2 billion\nInsurance company Chubb  (CB) , worth $6.8 billion\nBanking titan Citigroup  (C) , worth $3.6 billion\nAs for banks, Berkshire held JPMorgan Chase, Wells Fargo, U.S. Bancorp and Bank of New York Mellon in the past.\nRelated: Analysts revamp Berkshire stock outlook after Warren Buffett meeting\nBuffett offered an interesting assessment of the banking industry in 1996, as cited by Business Insider. \"It's a business that can be a very good business, when run right,” said the Oracle of Omaha (Berkshire is based there).\n“There's no magic to it. You just have to stay away from doing something foolish. It's a little like investing. You don't have to do anything very smart. You just have to avoid doing things that are ungodly dumb.\"\nLast week, Berkshire sold about 34 million shares of Bank of America for $1.5 billion. Given that Berkshire still has a huge position — it’s the bank’s biggest shareholder by far — the sale could just represent profit-taking.\nBofA has jumped 27% so far this year to a quote of $42.60. That’s three times Berkshire’s average purchase price of $14 for all of its BofA shares, according to Barron’s. So there’s plenty of profits to take.\nBut Buffett also could be taking the first step on the road to completely exit BofA. Or Berkshire, which now has a 12.8% stake in BofA, may just want to drive its stake below 10%, Barron’s writer Andrew Bary noted.\nThat way it wouldn’t have to report trades of the stock to the Securities and Exchange Commission within two business days.\nMeanwhile, Bank of America released its second-quarter earnings last week, and most analysts gave the news a positive reception.\n“The biggest highlight was the company's encouraging net interest income (NII) outlook for the remaining half of the year,” Morningstar analyst Suryansh Sharma wrote in a commentary.” NII is the difference between a bank’s interest revenue and its interest expenses.\nFund manager buys and sells:\nGoldman Sachs offers 3 high-conviction stock picks\nCathie Wood unloads shares of rebounding tech titan\nVeteran fund manager sees world of pain coming for stocks\nManagement expects NII to rise to around $14.5 billion by the fourth quarter from $13.9 billion in the current quarter, he said.\n“Profitability in the second half should also be boosted by expense control and relatively strong fee income in the asset-management, investment banking, and trading businesses.”\nSharma plans to increase his $38 fair value estimate for BofA’s stock price by a mid-single digit percentage soon. He assigns the bank a wide moat, meaning he thinks it has competitive advantages that will last at least 20 years.\nRelated: Veteran fund manager sees world of pain coming for stocks\nThe author owns shares of Berkshire Hathaway, Bank of America and Goldman Sachs.\n"
    },
    {
        "Date": "2024-07-26T07:38:00.000Z",
        "Title": "Berkshire (BRK.B) Rises 24% YTD: What Should Investors Do Now?",
        "Author": "  Tanuka De ",
        "Text": "Shares of Berkshire Hathaway Inc. (BRK.B) have gained 23.8% year to date, outperforming the industry’s 22.6% growth, the Finance sector’s rise of 18.2% and the S&P 500 composite’s rise of 19.3%.  Berkshire Hathaway is a conglomerate with more than 90 subsidiaries engaged in diverse business activities. Per Warren Buffett, its “strength comes from its Niagara of diverse earnings delivered after interest costs, taxes and substantial charges for depreciation and amortization.” Its property and casualty insurance business, one of the largest property and casualty insurance companies, generates the maximum return on equity.\nImage Source: Zacks Investment Research\nBerkshire shares are trading well above the 50-day moving average, indicating a bullish trend. Shares are trading near the high end of its 52-week range. \nImage Source: Zacks Investment Research\nAmong its diverse business activities, the most important is its insurance operations, which contribute around one-fourth of Berkshire’s top line. The insurance business is poised for long-term growth, banking on increased exposure, prudent underwriting standards and better pricing. Continued insurance business growth fuels an increase in float, drives earnings and generates maximum return on equity. Notably, Berkshire generated underwriting profit in 18 of the last 20 years. However, when catastrophes occur, like other insurers, Berkshire’s underwriting profitability is affected, resulting in a deterioration of its combined ratio. In a favorable interest rate environment, it derives higher interest income from short-term investments.Berkshire Hathaway’s economically sensitive non-insurance businesses — Utilities and Energy, and Manufacturing, Service and Retail — are performing well. The Utilities and Energy business has grown with increased revenue contributions from Burlington Northern SantaFe Corp. However, unfavorable changes in the business mix and lower fuel surcharge revenues are areas of concern. Nonetheless, lower fuel costs are expected to limit any downside.  Demand for utilities is expected to be strong in the future and drive earnings growth. Increasing demand for goods and services, given an improved economic backdrop, should benefit its Manufacturing, Service and Retail operations. Collectively, these have driven revenues higher and facilitated margin expansion over the past many years.With a huge cash hoard, we believe Berkshire Hathaway will successfully continue its acquisition spree, acquiring entities that have consistent earning power and generate impressive returns on equity. While big acquisitions open up more business opportunities for the company, bolt-on acquisitions enhance the earnings of the existing business.  Warren Buffett has always eyed acquisitions or made investments in properties that are undervalued or have potential for growth. Investments in Coca-Cola KO and American Express AXP show the investment acumen of Warren Buffet and Charlie Munger. Berkshire Hathaway also has stakes in behemoths like Apple, Bank of America, Chevron and Occidental Petroleum.Also, Berkshire Hathaway's liquidity helps it repurchase shares regularly. It bought back shares worth $2.6 billion in the first quarter of 2024.\nThe stock is overvalued compared to its industry. It is currently trading at a price-to-book multiple of 1.65, higher than the industry average of 1.56.  However, we believe that given Berkshire Hathaway's dominant market presence, diverse business activities, and, above all, the name Warren Buffet, a premium valuation is quite justified for this Zacks Rank #3 (Hold) stock.\nImage Source: Zacks Investment Research\nReturn on equity in the trailing 12 months was 7.3%, underperforming the industry average of 7.8%. Return on equity, a profitability measure, reflects how effectively a company is utilizing its shareholders. It's noteworthy that though BRK.B’s ROE is lagging behind the industry average, the company successfully improved the same even during the pandemic. \nImage Source: Zacks Investment Research\nThe same holds true for return on invested capital (ROIC), which has increased every year since 2020. This reflects BRK.B’s efficiency in utilizing funds to generate income. However, ROIC in the trailing 12 months was 5.7%, lower than the industry average of 5.9%.\nImage Source: Zacks Investment Research\nOne of the two analysts covering the stock has raised estimates for 2024 and 2025 over the past 30 days, while one has lowered the same for 2025. Thus, the Zacks Consensus Estimate for 2024 implies a 0.4% year-over-year increase, while the same for 2025 suggests a 0.6% decrease.\nImage Source: Zacks Investment Research\nIn a letter to shareholders, Warren Buffett stated that Berkshire Hathaway has the largest GAAP net worth recorded by any American business and it occupies about 6% of the total GAAP net worth of S&P 500 companies.Holding shares of Berkshire Hathaway renders dynamism to a shareholder's portfolio. It gives a feel of investing in mutual funds apart from rewarding investors with higher returns at the same time. But above all, the company has Warren Buffett at its helm, who has been creating tremendous value for shareholders over nearly six decades with his unique skills. Thus, investors who already hold Berkshire shares should continue to retain the stock in their portfolio.However, given its premium valuation, new investors can wait for a better entry point. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCocaCola Company (The) (KO) : Free Stock Analysis Report\nAmerican Express Company (AXP) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-07-15T09:55:00.000Z",
        "Title": "Is Berkshire Hathaway a Millionaire Maker?",
        "Author": "  Reuben Gregg Brewer, The Motley Fool ",
        "Text": "If you look at the history of Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) stock, it has trounced the market over the long term. There are many people who have ridden CEO Warren Buffett's success to millionaire status. But what about the future? Is Berkshire Hathaway still a millionaire-maker stock? That's a hard question to answer.\nBerkshire Hathaway is an insurance company. It's a transportation company. It's a utility. It's a midstream company. It's a manufacturer. It's a retailer. It is a lot of things all under one roof, and that list is actually not complete because there are still more businesses hidden under the covers. At the end of the day, Berkshire Hathaway is a conglomerate. But it's not like most other conglomerates, either.\nWarren Buffett is famous as an investor. And that's how he looks at Berkshire Hathaway. So the company is almost like a mutual fund. He buys companies he thinks are good, well run, and priced attractively. That includes investing in the shares of a company as well as buying companies in their entirety. But Buffett doesn't actually run any company in which he invests; he hires good managers to do that. Buffett just keeps tabs on what's going on, only stepping in when there is a legitimate need.\nThis approach has worked out incredibly well for investors. Since just the turn of the century, Berkshire Hathaway's stock price has increased roughly 990%. The S&P 500 index's total return, which assumes dividend reinvestment, was only 490% or so. Looking only at price performance, the S&P rose just 280% or so. Note that Berkshire Hathaway does not pay dividends, so its total return is equal to its stock performance.\nBut investing is about looking to the future. So what can investors expect from Berkshire Hathaway stock from this point, after it has rewarded investors with such a huge level of outperformance? Warren Buffett is pretty clear:\nThere remain only a handful of companies in this country capable of truly moving the needle at Berkshire, and they have been endlessly picked over by us and by others. Some we can value; some we can't. And, if we can, they have to be attractively priced. Outside the U.S., there are essentially no candidates that are meaningful options for capital deployment at Berkshire. All in all, we have no possibility of eye-popping performance.\nThat's not a great prognosis, with Buffett basically suggesting that Berkshire Hathaway will end up providing S&P 500-like returns. For starters, that's not such a bad thing. But don't forget how Buffett invests. His comment about not being able to find needle-moving investments is being made in 2024 when the stock market is near all-time highs.\nWhat if the stock market sells off? Historically speaking, bear markets always follow bull markets and bring with them investment opportunities. Buffett is a patient investor, only investing when he believes he's found a stock worth buying. In fact, Buffett's approach shines in bad markets, as he generally has the capital saved up to put money to work when others are fearful. At the end of the first quarter, for example, Berkshire Hathaway had over $180 billion in cash and short-term investments sitting on its balance sheet just waiting to be used.\nAlthough Berkshire Hathaway is a gigantic company and future growth may not live up to past performance, don't count this company out. It has a very unique business approach that allows it to take advantage of market weakness. When the market is hot, as it is today, Buffett's approach is out of step and the company he runs will lumber along.\nBut when the next bear market comes along, Berkshire Hathaway is highly likely to take the actions necessary to lead to above average long-term performance. This company may not be the millionaire maker it once was, but that doesn't mean it has lost the ability to make investors rich.\nBefore you buy stock in Berkshire Hathaway, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Berkshire Hathaway wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $791,929!*\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.\nSee the 10 stocks »\n*Stock Advisor returns as of July 8, 2024\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway. The Motley Fool has a disclosure policy.\nIs Berkshire Hathaway a Millionaire Maker? was originally published by The Motley Fool\n"
    }
]