[
    {
        "Date": "2024-02-06T05:36:48.000Z",
        "Title": "Alphabet is seeking outside investment for its GFiber internet business",
        "Author": "  Jeffrey Dastin ",
        "Text": "By Jeffrey Dastin\nSAN FRANCISCO (Reuters) - Alphabet plans to seek external investment for GFiber, its business selling Wi-Fi and internet connectivity in parts of the United States, the company told Reuters on Monday, as it looks to ramp up its expansion to more cities.\nGFiber, owned by Google's parent company, competes with larger internet service providers including Comcast, Verizon Communications and AT&T.\nSince vowing 14 years ago that it would boost internet speeds 100-fold through fiber-optic cables, GFiber has expanded to 15 states starting with its 2012 launch in Kansas.\nIn the past six years, it has tripled its customer base, GFiber told Reuters, without specifying total users. It signed deals in 2023 that would bring its services to more than 25 additional cities.\nStill, the company faces competition from big incumbents and has yet to provide internet in large swaths of the U.S., including six of the 10 most populous cities including New York.\n\"This next step of raising external capital will enable them (GFiber) to scale their technical leadership, expand their reach, and provide better internet access to more communities,\" Ruth Porat, Alphabet's president and chief investment officer, told Reuters in a statement.\nAlphabet declined to comment on the amount of funds GFiber was looking to raise or the valuation it was seeking.\nGFiber has already hired an investment bank to start the process of selling equity in the company, according to a source close to Alphabet's efforts. The future goal is for GFiber to be independent from Alphabet, the source said on condition of anonymity.\nGFiber CEO Dinni Jain said in a statement: \"We are now ready to scale this much faster.\"\nOTHER BETS\nGFiber is one of Alphabet's so-called Other Bets, its collection of businesses other than Google that are at an earlier stage of research or commercialization. They include health company Verily and self-driving car business Waymo, which have both raised money from outside investors.\nIn 2023, the Other Bets collectively lost $4.1 billion on revenue of $1.5 billion, primarily generated by internet and healthcare-related services, according to Alphabet's annual report.\nPorat, who also serves as chief financial officer, told analysts last week that Alphabet aimed to \"sharpen our investment focus, while capturing the upside given compelling technology breakthroughs across the portfolio\" of Other Bets.\nOne such business, Alphabet's moonshot division known as X, was also looking for external capital to spin out more projects, she said at the time. Alphabet generally is working to revamp its cost base, Porat said.\nThe company, like others in the technology sector, has recently announced job cuts. It declined to comment on whether GFiber's fundraising effort had any relation to Alphabet's overall cost-efficiency program.\n(Reporting by Jeffrey Dastin in San Francisco; Editing by Jamie Freed)\n"
    },
    {
        "Date": "2024-02-07T13:01:38.000Z",
        "Title": "Alphabet's Culture Issue Is Worse Than Its Earnings Issue",
        "Author": "  Grahamites ",
        "Text": "Google's parent company, Alphabet Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL), reported earnings on Jan. 30. Although revenue grew by double digits, the stock was down after the report because ad sales growth was slower than analysts' expectations. Google search and YouTube ads revenue had healthy double-digit growth, but the Google Network segment's revenue declined 2% year over year. Combined, Google ad revenue grew 11% year over year.\nWarning! GuruFocus has detected 6 Warning Signs with META.\nCompared to Amazon (NASDAQ:AMZN), Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META), Alphabet's results were clearly disappointing.\nI have followed big U.S. and Chinese technology companies for more than 10 years now. I remember back in 2014, Alibaba (NYSE:BABA) and Alphabet both seemed invincible. But now, both companies are running into trouble. In my opinion, both Alibaba and Alphabet's biggest challenge is culture, which ironically used to be their strength. In the past I've written about Alibaba's cultural crisis. In this discussion, I will focus on Alphabet's culture with discussions of both its pros and cons.\nDuring the 2018 Berkshire Hathaway (NYSE:BRK.A) (NYSE:BRK.B) shareholder meeting, the late Charlie Munger commented on Alphabet's culture. He said, \"I've been to Google headquarters. It looked to me like a kindergarten.\" Warren Buffett (Trades, Portfolio) added, \"A very rich kindergarten.\"\nI agree with Munger and Buffett's observations about Google because I have also been to its headquarters a few times. Personally I wouldn't use the word kindergarten to describe it, but the atmosphere is certainly very laid-back with plenty of on-site facilities. This atmosphere was designed from day one to help facilitate creativity, as laid out by Google's very first founders' letter, which states the following:\nGoogle is not a conventional company. We do not intend to become one. Throughout Google's evolution as a privately held company, we have managed Google differently. We have also emphasized an atmosphere of creativity and challenge, which has helped us provide unbiased, accurate and free access to information for those who rely on us around the world.\nHaving the best talent is key to Alphabet's business model. To attract the best talent, the company created the unconventional decentralized atmosphere and offered the highest compensation package in the industry. As a result, it has always had a very high win-rate when recruiting talent. Once the best engineers join the company, they have maximum amount of flexibility and enjoy tremendous benefits such as a free gym, snacks, diverse on-site restaurants and much more. In other words, everything is taken care of by Alphabet. This is probably why Munger and Buffett call it a kindergarten.\nThis culture worked very well in the early years. I remember during my first visit to Google campus in 2014, I was really impressed by the open and vibrant culture. For a long time, this was key to Alphabet's moat.\nLike all other big tech companies, Alphabet grew its employee base rapidly over the past decade as its business continued to expand. In 2014, the company had only 53,600 employees. By the end of 2022, the number of employees had ballooned to 190,234. Inevitably, more employees means more bureaucracy. This is true for all big tech companies. The company realized it had too many employees so, for the first time in its history, it implemented layoffs, which decreased the employee count to 182,381 as of the latest quarter.\nBut bureaucracy is not Alphabet's main cultural issue. I think the biggest issue with its culture is complacency and sloth, which ironically is the accumulated result of the decentralized and creative culture it is proud of. It is analogous to spoiling your children. The best way to destroy a talented child is to spoil him or her with easy-to-get luxuries. For many years, Alphabet's engineers have been used to this hands-off and laid-back approach of management. This approach works as long as the business is booming. But once the competition picks up, Alphabet's culture can be detrimental. It is like going to war with an army of soldiers who are rusty at essential military skills.\nAnother issue with the company's culture is its lack of flexibility in terms of product design and development, which resulted in less user-friendly products. The best example is the cloud business. Alphabet developed the cloud technology years before Amazon. But Alphabet's product is not user-friendly at all because its engineers are not used to listening to customer feedback. Therefore, Alphabet's cloud business has grown much slower than Amazon and Microsoft. I'm concerned the company will repeat this problem again with Bard, which is its version of a conversational artificial intelligence tool.\nLast but not least, I think Alphabet is facing a problem of cultural division. This was inevitable as the company grew its employee base. To be fair, most big tech companies will face this problem. But with Alphabet, the issue is particularly severe because it is more open than the other tech companies. Therefore, there are fewer rules governing employee behaviors, which makes it harder for management to reconcile differences.\nAlphabet's earnings release is disappointing, but not too bad. For long-term investors, the more concerning issue is its culture. Unless management takes dramatic action, the cultural issues are here to stay. Fortunately, Sundar Pichai has realized the culture issues and has taken steps to address them. It remains to be seen whether he can successfully tackle them in the future.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-03T00:39:07.000Z",
        "Title": "Why Major Tech Stocks Like Alphabet and Broadcom Flew Higher on Friday",
        "Author": "  Eric Volkman, The Motley Fool ",
        "Text": "The end of the trading week saw a notable bull run toward tech stocks. Buoyed by solid quarterly results from some of the sector's big players, investors plowed into a great many companies in the industry. This resulted in a broad rally throughout, lifting share prices in many tech segments.\nAlphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), for instance, saw both of its listed stocks creep up almost 1%, while semiconductor and other components specialist Broadcom (NASDAQ: AVGO) enjoyed a 2% gain. Content delivery network (CDN) and cybersecurity company Cloudflare (NYSE: NET) and cloud services provider Datadog (NASDAQ: DDOG) rose a respective 4% and nearly 6%.\nThe week was a banner one for tech stocks. On Thursday alone, Meta Platforms (owner of Facebook and Instagram) and Amazon both reported boffo, estimates-beating quarters. That breathed even more life into a resurgent sector that has been looking very robust so far this year.\nThe two tech bellwethers -- Meta in social media, and Amazon in both e-commerce and cloud computing with its Amazon Web Services (AWS) -- have previously posted quarters that were well better than expected. These felt a bit different, though, as Meta declared its first-ever dividend, and Amazon benefited from its customers purchasing an astounding 1 billion-plus items through its site during the Black Friday/Cyber Monday period alone.\nSo for a brief, shining moment, the tech sector as a whole could do no wrong. Users and clients are obviously hungry to use a very wide variety of services, no matter whether they're specialty cloud offerings, search enhancements, or content delivery network offerings to get their online videos playing more smoothly.\nAdding fuel to this happy bonfire was today's latest Labor Department release of the nation's monthly employment figures. Jobs continue to be added to the economy, with employers taking on 353,000 workers in the first month of 2024.\nAnd a revision to December numbers tacked on an extra 100,000 jobs. This is still a humming economy, and a humming economy needs good tech.\nCan the rally continue? I believe it surely can, and likely will. We're in the thick of earnings season, and there is still a host of notable tech stocks that are set to report their latest quarterly figures. We shouldn't be surprised to see even more winning days for the broader sector in the immediate future.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Alphabet wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 29, 2024\n \nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Eric Volkman has positions in Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Cloudflare, Datadog, and Meta Platforms. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy.\nWhy Major Tech Stocks Like Alphabet and Broadcom Flew Higher on Friday was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-24T19:49:31.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL): Undervalued and Overlooked Magnificent Seven Stock",
        "Author": "  TipRanks ",
        "Text": "Magnificent Seven stocks have attracted plenty of buzz as investors gravitate toward their vast market share and exceptional returns. Every Magnificent Seven stock has more than doubled over the past five years. These assets have significantly outperformed the market during that time. However, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) has been a largely underappreciated stock.\nThe corporation has amassed a $1.75 trillion market cap and is up by 56% over the past year. Still, that gain falls behind most of the Magnificent Seven stocks. New opportunities and a good valuation can help Alphabet gain momentum and accumulate long-term returns for investors. Those catalysts make me bullish on the stock.\nAlthough the company owns the largest search engine in the world, it’s fallen behind the Magnificent Seven stocks in recent years. These are the one-year and five-year returns for each stock within the cohort.\nOne-year returns:\nNvidia: 223%\nMeta Platforms: 171%\nAmazon: 77%\nMicrosoft: 58%\nAlphabet: 56%\nApple: 22%\nTesla: -2%\nFive-year returns:\nNvidia: 1,579%\nTesla: 882%\nApple: 320%\nMicrosoft: 260%\nMeta Platforms: 187%\nAlphabet: 157%\nAmazon: 106%\nThese are still impressive returns and outpace the S&P 500 (SPX) and Nasdaq 100 (NDX). However, Alphabet has been outclassed by every Magnificent Seven stock except Amazon (NASDAQ:AMZN) over the past five years.\nWhile the stock has underperformed its peers within the cohort, Alphabet has a better valuation than most tech companies. The stock trades at a 24.5 P/E ratio and has solid profit margins. The company’s net profit margin usually exceeds 20% and should get a big boost in future quarters.\nAlphabet has three components on its side: rising revenue, more profits, and cost-cutting measures. The tech giant reported 13% year-over-year revenue growth and 51.8% year-over-year net income growth in Q4 2023. Alphabet’s efforts to trim its workforce contributed to higher margins and seem to be ongoing.\nA contributing factor to Alphabet’s rising net income is the recent profitability of Google Cloud. The cloud computing segment has been taking up a larger percentage of revenue and attributed to more than 10% of Q4-2023 revenue. Google Cloud generated $9.2 billion of the company’s $86.3 billion in revenue. Google Cloud swung from a $186 million operating loss in Q4 2022 to generating $864 million in operating income in Q4 2023.\nGoogle Cloud’s margins should improve significantly in future quarters and reduce the company’s P/E ratio by increasing its earnings.\nWhile it’s nice to see Alphabet expanding in other verticals, it’s no secret that advertising is the main engine for this corporation. Advertising sales slowed down in 2022 but came back to life in 2023. Its fourth-quarter results further highlight this fact and suggest that Alphabet has more to gain.\nThe fourth quarter featured $76.3 billion in Google Services revenue. This segment mainly consists of the company’s advertising and grew by 12.5% year-over-year. Advertising should receive an additional boost from the Olympic Games and the upcoming Presidential Election.\nHigher advertising revenue also translates into more profits. While the same can be said about most businesses, Alphabet achieved a 35.0% operating margin with its Google Services segment in Q4.\nAmong the Magnificent Seven stocks, Nvidia (NASDAQ:NVDA) and Microsoft (NASDAQ:MSFT) are the clear leaders in the artificial intelligence industry. However, Alphabet is also poised to gain a meaningful slice of the pie by using its existing technology and making new investments.\nAlphabet recently launched Gemini in a bid to bolster its AI presence. The tech firm also invested over $2 billion into an OpenAI competitor. Alphabet has been using artificial intelligence to improve its search results and cloud platform, but these investments represent the next steps to gain market share.\nAlphabet can close the gap in the AI race with Microsoft. The company started Google Cloud two years after Amazon got a head start with Amazon Web Services. Now, Google Cloud is a critical component of the company’s business. Alphabet has invested in many ventures known as Other Bets that are growing at a high rate. While this segment makes up a small part of total revenue, it’s worth monitoring the collection of businesses under the umbrella term.\nMost analysts are bullish on Alphabet stock. The stock sports 29 Buys and eight Hold ratings from analysts, giving it a Strong Buy consensus rating. The average GOOGL stock price target of $164.59 implies 14.3% upside potential.\nAlphabet is an under-the-radar stock (relatively) due to the impressive performances of other Magnificent Seven stocks. The tech giant has outperformed the market but has underperformed most of the corporations in its cohort.\nRising revenue and profits from advertising and cloud computing present a great opportunity. Alphabet also seems determined to gain more market share in artificial intelligence, which is a great long-term move for the corporation.\nDisclosure\n"
    },
    {
        "Date": "2024-02-01T14:48:49.000Z",
        "Title": "Alphabet Inc. (NASDAQ:GOOG) Q4 2023 Earnings Call Transcript",
        "Author": "  Insider Monkey Transcripts ",
        "Text": "Alphabet Inc. (NASDAQ:GOOG) Q4 2023 Earnings Call Transcript January 30, 2024\nAlphabet Inc. beats earnings expectations. Reported EPS is $1.64, expectations were $1.6.\nOperator: Welcome, everyone. Thank you for standing by for the Alphabet Fourth Quarter 2023 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. [Operator Instructions] I would now like to hand the conference over to your speaker today, Jim Friedland, Director of Investor Relations. Please go ahead.\nJim Friedland: Thank you. Good afternoon, everyone, and welcome to Alphabet's fourth quarter 2023 earnings conference call. With us today are Sundar Pichai, Philipp Schindler, and Ruth Porat. Now, I'll quickly cover the Safe Harbor. Some of the statements that we make today regarding our business, operations, and financial performance may be considered forward-looking. Such statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10-K and 10-Q, including the risk factors discussed in our upcoming Form 10-K filing for the year ended December 31, 2023. We undertake no obligation to update any forward-looking statement.\nDuring this call, we will present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyz/investor. Our comments will be on year-over-year comparisons unless we state otherwise. And now, I'll turn the call over to Sundar.\nSundar Pichai: Hello, everyone. Our results reflect strong momentum and product innovation continuing into 2024. Today, I'm going to talk about four main topics. One, our investments in AI, including how it's helping search. Two, subscriptions which reached $15 billion in annual revenue, up 5x since 2019. Subscriptions is growing strongly, powered by YouTube Premium and Music, YouTube TV and Google One. Three, Cloud which crossed $9 billion in revenues this quarter and saw accelerated growth driven by our Gen AI and product leadership. And four, our investments and focus to meet the growth opportunities ahead. First, AI and Search. As you know, we have long led the way in using AI to improve many of our products from search to ads, to most of our consumer and enterprise products, helping billions of people already.\nLast year brought new excitement around Gen AI and I'm proud of how we responded, responsibly with deep advances in foundation models and a number of great launches. We closed the year by launching the Gemini era, a new industry-leading series of models that will fuel the next generation of advances. Gemini is the first realization of the vision we had when we formed Google DeepMind, bringing together our two world-class research teams. It's engineered to understand and combine text, images, audio, video and code in a natively multimodal way and it can run on everything from mobile devices to data centers. Gemini gives us a great foundation. It's already demonstrating state-of-the-art capabilities and it's only going to get better. Gemini Ultra is coming soon.\nThe team is already working on the next versions and bringing it to our products. That starts with Search. We're already experimenting with Gemini in search where it's making our Search Generative Experience or SGE faster for users. We have seen a 40% reduction in latency in English in the U.S. I'm happy with what we are seeing in the earliest days of SGE, it's available through search labs in seven languages. By applying generative AI to Search, we are able to serve a wider range of information needs and answer new types of questions, including those that benefit from multiple perspectives. People are finding it particularly useful for more complex questions like comparisons or longer queries. It's also helpful in areas where people are looking for deeper understanding such as education or even gift ideas.\nWe are improving satisfaction including answers for more conversational and intricate queries. As I mentioned earlier, we are surfacing more links with SGE and linking to a wider range of sources on the results page and will continue to prioritize approaches that add value for our users and send valuable traffic to publishers. Beyond SGE, we are continuing to use AI to make searching more accessible and intuitive. Circle to Search, lets you search what you see on Android phones with a simple gesture without switching apps. It's available starting this week on Pixel 8 and Pixel 8 Pro and the new Samsung Galaxy S24 Series. And Lens now offers generative AI overviews. You can add text to a visual search to ask questions about anything you see and get AI-powered insights in the moment.\nIn addition to Search, we are also seeing a lot of interest in our AI-powered solutions for advertisers. That includes our new conversational experience that uses Gemini to accelerate the creation of search campaigns. Then there is Bard, our conversational AI tool that complements search. It's now powered by Gemini Pro and is much more capable at things like understanding, summarizing, reasoning, coding and planning. It's now in over 40 languages and over 230 countries around the world. Looking ahead, we'll be rolling out an even more advanced version for subscribers powered by Gemini Ultra. That's a good segue to subscriptions. As I said earlier, it's now a $15 billion business annually. YouTube is the key driver of our subscription revenues.\nAvailable in over 100 countries and regions, YouTube Music and Premium have real momentum. They're engaging passionate users and driving great returns for the music industry and creators. YouTube TV is also doing well. We've had great consumer feedback on the viewing experience. People love the navigation, multi view and unlimited DVR. NFL Sunday Ticket has found it’s perfect home on YouTube and Philipp will talk about that more. Let me also talk about our subscription service, Google One. It's doing incredibly well with strong user growth. It provides expanded storage, unlocks exclusive features in Google products and allows us to build a strong relationship with our most engaged users. Google One is growing very well and we are just about to cross 100 million subscribers.\nFrom here, we are going to bring in more AI features and look forward to more strong growth to come. Next, Google Cloud. Throughout 2023, we introduced thousands of product advances, including broad Gen AI capabilities across our AI infrastructure, our Vertex AI platform and our new Duvet AI agents. In Q4, our product and Gen AI leadership enabled us to win and expand relationships with many leading brands including Hugging Face, McDonald's, Motorola Mobility and Verizon. Google Cloud offers our AI Hypercomputer, a groundbreaking supercomputing architecture that combines our powerful TPUs and GPUs, AI software and multi-slice and multi-host technology to provide performance and cost advantages for training and serving models. Customers like Anthropic, Character AI, Essential AI and Mistral AI are building and serving models on it.\nFor developers building Gen AI applications, we offer Vertex AI, a comprehensive enterprise AI platform. It helps customers like Deutsche Telekom and Moody's discover, customize, augment and deploy over 130 Gen AI models, including PaLM, Med-PaLM, Sec-PaLM and Gemini, as well as popular open source and partner models. Vertex AI has seen strong adoption with the API request increasing nearly 6x from H1 to H2 last year. Using Vertex AI, Samsung recently announced its Galaxy S24 Series smartphone with Gemini and Imagen 2, our advanced text-to-image model. Shutterstock has added Imagen 2 to their AI image generator, enabling users to turn simple text prompts into unique visuals and Victoria's Secret & Company will look to personalize and improve the customer experience with Gemini, Vertex AI search and conversations.\nCustomers are increasingly choosing Duvet AI, our packaged AI agents for Google Workspace and Google Cloud Platform to boost productivity and improve their operations. Since its launch, thousands of companies and more than a million trusted testers have used Duvet AI. It will incorporate Gemini soon. In Workspace, Duvet AI is helping employees benefit from improved productivity and creativity at thousands of paying customers around the world, including Singapore Post, Uber and Woolworths. In Google Cloud Platform, Duvet AI assist software developers and cybersecurity analysis. Duvet AI for developers is the only Gen AI offering to support the company development and operations lifecycle, fine-tune with the customers’ own core corpus and policies.\nIt's helping Wayfair, GE Appliances and Commerzbank write better software, faster with AI code completion, code generation and chat support. With Duvet AI and security operations, we are helping cybersecurity teams at Fiserv, Spotify and Pfizer. Our robust growth has been driven by strong direct and indirect channels. With ISVs, we have nearly tripled the number of co-sell deals from 2022 to 2023. In our ecosystem, there are nearly 90,000 Google Cloud Gen AI-enabled consultants. And Accenture has teamed up with Google Cloud to create a joint generative AI center of excellence. Next, let me turn to our focus and discipline as we pursue the opportunities ahead. Search, YouTube and Cloud are supported by our state-of-the-art compute infrastructure.\nThis infrastructure is also key to realizing our big AI ambitions. It's a major differentiator for us. We continue to invest responsibly in our data centers and compute to support this new wave of growth in AI-powered services for us and for our customers. Through this, we are being disciplined in how we run the company. You've heard me talk about our efforts to durably reengineer our cost base and to improve our velocity and efficiency. That work continues. Teams are working to focus on key priorities and execute fast, removing layers and simplifying their organizational structures. As just one example, our devices team has brought together different teams from across Nest, Fitbit and other teams into a new functional structure. This will help us pull resources and drive progress across our Pixel portfolio.\nAcross different teams, we have wound down some non-priority projects, which will help us invest and operate well in our growth areas. We are also improving our machine utilization, building on our years of experience in driving cost efficiencies in our computing infrastructure and operations. And through our supplier efficiency efforts and automation of certain processes, we have made major improvements in areas like procurement, achieving significant savings. That's a snapshot of the quarter. Before I close, a couple of other highlights. Pixel 8, our AI-first phone, was awarded Phone of the Year by numerous outlets. It now uses Gemini Nano with features like Magic Compose for Google Messages and more to come. In our Other Bets portfolio of companies, Waymo, which is deeply focused on safety, reached over 1 million fully autonomous ride-hailing trips.\nAnd Isomorphic Labs entered into strategic partnerships with Eli Lilly and Novartis to apply AI to treat diseases, which has great potential. 2023 was a year of profound innovation and product momentum. Thank you to our many partners. We succeed when our partners do, and we are grateful for the work we do together, from our partners across the Android ecosystem who are on display at CES to our deep relationships with retailers, small businesses and advertising partners, to the next generation of AI start-ups and developers and many more. I also want to thank all of our employees for their hard work throughout 2023 and the start of the new year. I'm excited for what's ahead in 2024. Philipp?\nPhilipp Schindler: Thanks, Sundar, and hi, everyone. Google Services revenues of $76 billion were up 12% year-on-year. In Google advertising, Search and other revenues grew 13% year-on-year, led again by solid growth in the retail vertical. We had particular strength in retail in APAC, a trend that began in the second quarter of 2023 and continued through the end of the year. YouTube ads revenue were up 16% year-on-year, driven by growth in both direct response and brand. And network revenues declined 2% year-on-year. In Subscriptions, Platforms and Devices, which was previously named Google Other, year-on-year revenues increased 23% driven by strong growth in subscriptions. Now for some color on the quarter and where we see continued upside for long-term advertising growth.\nOver the last few calls, I have consistently highlighted how we're putting Google AI to work for our customers to deliver profitability and help them achieve their goals in a do-more-with-less environment. From a product perspective, in Q4, Performance Max remained a bright spot. We're also excited about [demand gen] momentum. This is our big bet to help social advertisers find and convert consumers via immersive, relevant visual creatives across YouTube, including YouTube Shorts, Gmail and Discover. In a single campaign, you get access to over three billion users as they stream, scroll, connect and decide what to buy. Tens of thousands of advertisers are testing and on average seeing 6% more conversions per dollar versus image-only ads and discovery campaigns.\nAs we look ahead, we're also starting to put generative AI in the hands of more and more businesses to help them build better campaigns and even better performing ads. Automatically created assets help advertisers show more relevant search ads by creating tailored headlines and descriptions based on each ads’ context. Adoption was up with strong feedback in Q4. In addition to now being available in eight languages, more advanced Gen AI-powered capabilities are coming to ACA. And then last week's big news was that Gemini will power a new conversational experience in Google Ads. This is open in beta to U.S. and UK advertisers. Early tests show advertisers are building higher-quality search campaigns with less effort, especially SMBs who are 42% more likely to publish a campaign with good or excellent ad strength.\nWe can't wait to see how this continues to drive performance and level the playing field for advertisers of all sizes. As we shared last quarter, ads will continue to play an important role in the new search experience, and we'll continue to experiment with new formats native to SGE. SGE is creating new opportunities for us to improve commercial journeys for people by showing relevant ads alongside search results. We've also found that people are finding ads either above or below the AI-powered overview helpful as they provide useful options for people to take action and connect with businesses. Looking at our strong Search performance for the fourth quarter. Retail was a highlight. We continue to see a stronger start to the season up to and including Cyber Five.\nIn Q3, we indicated that we were seeing early trends of consumers being very price-conscious, and we saw this play out in Q4. With promotional demand at an all-time high, deal seekers using Google had access to 2x the deals in the U.S. versus last season as well as a better shopping experience. Launches included a one-stop shop deals destination, new filters like GetItFast and AI-generated gifting recommendations in SGE. These new features drove incremental query growth during key shopping moments like Cyber Five. Our proven AI-powered ad solutions were also a win for retailers looking to accelerate omni growth and capture holiday demand. Quick examples include a large U.S. big-box retailer who drove a 60%-plus increase in omni ROAS and a 22%-plus increase in store traffic using Performance Max during Cyber-Five; and a well-known global fashion brand, who drove a 15%-plus higher omnichannel conversion rate versus regular shopping traffic by showcasing its store pickup offering across top markets through pickup later on shopping ads.\nMoving on to YouTube. We're obviously pleased with YouTube's advertising revenue growth in Q4 and also significant growth in our subscription revenue. I'll reiterate what I have said before. YouTube success starts with creator success. We give millions of creators more ways to create content and connect with fans and more ways to make money and build their own businesses than any other platform. More creators means more content, which leads to more viewers. And via ads and subscriptions, these viewers fund our creators and drive the eyeballs and engagement our advertisers want. To keep this momentum going, we're focused on delivering value across four pillars: creation, viewers, monetization and responsibility. First, creation, which increasingly takes place on mobile devices.\nWe've invested in a full suite of tools, including our new YouTube Create app for Shorts, to help people make everything from 15-second Shorts to 15-minute videos to 15-hour live streams with a production studio in the palm of their hands. Gen AI is supercharging these capabilities. Anyone with a phone can swap in a new backdrop, remove background extras, translate their video into dozens of languages, all without a big studio budget. We're excited about our first products in this area from Dream Screen for AI-generated backgrounds to allowed for AI-powered dubbing. There is more to come. Number two, viewers. We continue to grow watch time across YouTube with strong growth in Shorts and Connected TV. Shorts remains a top priority. We have 2 billion-plus logged-in users every month, and we are averaging 70 billion in daily views.\nConnected TVs or what we refer to as the living room is where viewership is growing the fastest. We're investing to make this experience even better with interactive features tailored to TVs, plus the content people love: our creators, NFL Sunday Ticket and the range of live sports and studio content via YouTube TV and Primetime Channels. Put this all together, and YouTube is the must-have app on every Connected TV. Monetization is pillar number three and realized through a combination of ad-supported and subscription offerings. Advertising generates the bulk of our revenue, and we continue to invest heavily here. We've rolled out CTV-first formats like 30-second non-skippable ads and pause experiences as well as an industry-first send-to-phone experience that lets people use a second screen to engage with ads.\nFor Shorts, we've developed new formats that are less interruptive to viewers. It's early. We're learning but excited by the opportunities for ads this can unlock. Shorts monetization continues to progress nicely. Our AI part video format from video reach and video view campaigns to demand gen and video action continue to make advertiser dollars go further and drive results across the funnel. We're also introducing new and existing advertisers to YouTube via sports content. 90-plus upfront and scatter advertisers, including Unilever, are partnering with YouTube in our first year across NFL Sunday Ticket in-game advertising opportunities. Our subscription offerings are also growing at a healthy clip. YouTube Music and Premium performed well.\nPremium users are delivering more value to our partners and YouTube than even ad-supported users do. On average, each additional Premium sign-up boost earnings for creators, music and media partners and YouTube itself. And we've made Premium even more attractive with new features, bundles and other enhancements. We're also pleased with our first season of NFL Sunday Ticket. It gave creators new opportunities to create content and feed user engagement across traditional user content and professional sports content. Feedback on the user experience, including MultiView, has been great. We're excited to continue to innovate here. Responsibility is our fourth pillar, and it underlines everything we do across YouTube. We continue to focus relentlessly on this.\nAs always, deepening our relationships with key partners to bring them the best of Google is a key priority for us, and we continue to do this across industries in Q4. We just talked about the NFL. Sundar mentioned Samsung, among others earlier. Another highlight was our expanded partnership with Porsche to enhance customers' digital experiences with a deeper in-vehicle integration of Google built-in services, including Google Maps and Play. Whether it's continued collaboration with our partners and key ecosystems, we're putting Google AI to work for more customers. I'm excited about the opportunities for continued impact in 2024. I'll wrap with a huge note of gratitude to our customers and partners. Our success is only possible because of their success and then to our Googlers for their outstanding work and focus this year.\nRuth, over to you.\nRuth Porat: Thank you, Philipp. We are very pleased with our full year results with 2023 Alphabet revenues of $307 billion, up 9% versus 2022, which added $25 billion to revenues for the year. We ended with a strong fourth quarter with consolidated revenues of $86.3 billion, up 13% versus last year in both reported and constant currency. Search remained the largest contributor to revenue growth. My comments will be on year-over-year comparisons for the fourth quarter, unless I state otherwise. Total cost of revenues was $37.6 billion, up 6%. Other cost of revenues was $23.6 billion, up 5%, with the increase driven primarily by content acquisition costs associated with YouTube subscription offerings. The growth rate also reflects the offsetting benefit of lapping $1.2 billion in inventory-related charges that we called out in the fourth quarter last year as well as a reduction in depreciation expense due to changes in estimated useful lives we made starting in the first quarter of 2023.\nIn terms of total expenses, the year-on-year comparisons reflect an additional $1.2 billion in exit charges that we took in the fourth quarter of 2023 in connection with actions to optimize our global office space. As you can see in our earnings release, these charges were allocated across the expense lines in other cost of revenues and OpEx based on associated headcount. Operating expenses were $25 billion, up 11%, primarily reflecting an increase in R&D expenses, which were driven by the real estate charges, followed by compensation. Operating income was $23.7 billion, up 30%, and our operating margin was 27%. Net income was $20.7 billion, and EPS was $1.64. We delivered free cash flow of $7.9 billion, which was affected by the timing of the $10.5 billion tax payment we made on October 16 that we called out previously related to the deferral of certain tax payments to the fourth quarter.\nFor the full-year 2023, free cash flow was $69 billion. We repurchased a total of $62 billion of our Class A and Class C shares in 2023 and ended the year with $111 billion in cash and marketable securities. Turning to segment results. Within Google Services, revenues were $76.3 billion, up 12%. Google Search and other advertising revenues of $48 billion in the quarter were up 13%, led again by growth in retail. YouTube advertising revenues of $9.2 billion were up 16% driven by both direct response and brand advertising. Network advertising revenues of $8.3 billion were down 2%. Subscriptions, Platforms and Devices revenues, which we previously referred to as other revenues, were $10.8 billion, up 23%, primarily reflecting growth in YouTube subscription revenues.\nTAC was $14 billion, up 8%. Google Services operating income was $26.7 billion, up 32%, and the operating margin was 35%. Turning to the Google Cloud segment. Revenues were $9.2 billion for the quarter, up 26%. We're very pleased with the momentum of GCP with an increasing contribution from AI. Google Workspace also delivered strong revenue growth, primarily driven by increases in average revenue per seat. Google Cloud delivered operating income of $864 million and an operating margin of 9%. As to our Other Bets, for the full-year 2023, revenues were $1.5 billion, and the operating loss was $4.1 billion. Results in the fourth quarter benefited from a milestone payment in one of the Other Bets. Turning to our outlook for the business. With respect to Google Services, first, within advertising.\nWe were pleased with the sequential revenue growth of Search and YouTube advertising throughout 2023, which reflects the extraordinary work across our teams to drive improved experiences for users and attractive ROI for advertisers. As we enter 2024 with advertising revenues of more than $100 billion higher than 2019, we remain focused on sustaining healthy growth on this larger base. Second, within Subscriptions, Platforms and Devices, our total revenues from subscription products reached $15 billion for the full-year 2023, driven primarily by substantial growth in subscribers for our YouTube subscription offerings. The substantial increase in our subscription revenues over the past few years demonstrates the ability of our teams to deliver high value-add offerings and provides a strong base on which to build, including through YouTube and newer services like Google One.\nPlay had solid growth again in the fourth quarter, driven primarily by an increase in the number of buyers. In Devices, we continue to make sizable investments with increased emphasis on our Pixel family, particularly with AI-powered innovation while driving further efficiencies across the portfolio. Turning to Google Cloud. We are pleased with operating performance in the year. Full year revenues of $33 billion were up 26% versus prior year, ending with strong Q4 performance. The Cloud team is intensely focused on bringing the benefits of Gemini, our industry-leading AI technology, to enterprises and governments globally, and we are gratified with the level of engagement. The strong demand we are seeing for our vertically integrated AI portfolio is creating new opportunities for Google Cloud across every product area.\nIn terms of profitability, the improvement in 2023 reflects sustained focus across the team with the intent to maintain healthy profitability while we continue to invest to support long-term growth. Turning to margins and expenses. As we have repeatedly stressed, we remain committed to our framework to durably reengineer our cost base as we invest to support our growth priorities. Key contributors to moderating our expense growth include: first, product and process prioritization to ensure we have the right resources behind our most important opportunities and to reallocate resources where we can; second, organizational efficiency and structure. We're focused on removing layers to simplify execution and drive velocity. Both product prioritization and the organization design efforts result in a slower pace of hiring, as you can see with our headcount down year-on-year, reflecting the reductions we announced in the first quarter of 2023 and a much slower pace of hiring.\nWe will continue to invest in top technical and engineering talent. Finally, we continue to execute the other work streams to slow expense growth, including improving efficiency in our technical infrastructure, streamlining operations across Alphabet through the use of AI, increasing efficiency of our spend with suppliers and vendors through our central procurement organization, and optimizing our real estate portfolio. With respect to CapEx, our reported CapEx in the fourth quarter was $11 billion, driven overwhelmingly by investment in our technical infrastructure with the largest component for servers followed by data centers. The step-up in CapEx in Q4 reflects our outlook for the extraordinary applications of AI to deliver for users, advertisers, developers, cloud enterprise customers and governments globally and the long-term growth opportunities that offers.\nIn 2024, we expect investment in CapEx will be notably larger than in 2023. With regard to Other Bets, we've been working to sharpen our investment focus while capturing the upside given compelling technology breakthroughs across the portfolio. For example, last week, Alphabet's X announced that it would be moving to spin out more projects as independent companies through external capital, giving X the opportunity to bring more focus to the breakthrough technologies it is working on to address some of the world's most pressing challenges. Thank you. Sundar, Philipp and I will now take your questions.\nSee also 15 Cheapest Countries to Get Permanent Residency Heading into 2024 and Here is How Billionaire Chris Hohn’s Hedge Fund Beat the Market with 33% Gain.\nTo continue reading the Q&A session, please click here.\n"
    },
    {
        "Date": "2024-02-07T13:08:00.000Z",
        "Title": "Better Tech Stock: Meta Platforms vs. Alphabet",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) headed in opposite directions after their latest earnings reports. Meta's stock soared 20% to an all-time high on Feb. 2, after the social media giant followed up its big fourth-quarter earnings beat with rosy guidance for the first quarter, a $50 billion boost to its buyback plan, and the initiation of its first-ever dividend. Alphabet's stock sank 8% on Jan. 31, even though its fourth-quarter numbers easily cleared analysts' expectations with double-digit growth across its core businesses.\nAs of this writing, Meta's stock has rallied more than 150% over the past 12 months. Alphabet's stock has rallied just over 30%. Let's see why the bulls rushed to Meta instead of Alphabet -- and if that trend will continue throughout the rest of 2024.\nMeta and Alphabet both generate most of their revenue from digital ads, but their business models are different. Meta is the world's largest social media company, and 3.98 billion people use at least one of its core apps -- Facebook, Messenger, Instagram, and WhatsApp -- every month. It sells its ads across all four platforms, as well as its Audience Network for third-party apps and websites. It's also producing augmented and virtual reality devices through its Reality Labs segment.\nAlphabet's Google owns the world's largest search engine, the top streaming video platform in YouTube, and the most popular mobile operating system in Android. It also owns the world's third largest cloud infrastructure platform, sells its own first-party hardware devices, and develops self-driving vehicles through its Waymo subsidiary.\nGoogle and Facebook controlled 39% and 18% of the global digital advertising market in terms of annual revenue, respectively, in 2023. But both companies face stiff competition from ByteDance's TikTok, which claimed 3% of the market and continues to lock in younger audiences with its short videos. To counter TikTok, Google has been beefing up YouTube Shorts, while Meta has been expanding its similar Reels across Facebook and Instagram.\nMeta and Alphabet generated 98% and 77% of their revenue, respectively, from digital ads in 2023. Both companies struggled with slower ad sales in 2022, as the macro headwinds drove more businesses to rein their ad spending.\nMeta also struggled with Apple's (NASDAQ: AAPL) privacy changes on iOS, which made it tougher to craft targeted ads from third-party data. Google wasn't as affected by the iOS update, because it mainly relied on first-party data and already paid Apple billions of dollars each year to remain the default search engine on iOS. But despite all of those challenges, Meta's ad revenue grew at a much faster rate than Google's over the past year.\nMetric\nQ4 2022\nQ1 2023\nQ2 2023\nQ3 2023\nQ4 2023\nMeta ad revenue growth (YOY)\n(4%)\n4%\n12%\n24%\n24%\nGoogle ad revenue growth (YOY)\n(4%)\n0%\n3%\n9%\n11%\nData source: Company earnings reports. YOY = Year over year.\nMeta outperformed Google for three reasons. First, Chinese e-commerce and gaming companies significantly ramped up their spending on Facebook and Instagram to reach more overseas users. Second, Meta countered Apple's changes by gathering more first-party data and upgrading its AI algorithms. Lastly, its higher ad impressions offset its lower ad prices.\nGoogle didn't seem to attract as much spending from those Chinese companies, and declining impressions across its sprawling ad network partly offset its rising impressions across its core search engine and YouTube. Google's growing dependence on ad-free subscriptions for YouTube and YouTube Music also suggested its advertising business was running out of steam. Meanwhile, Google's closely watched cloud business continued to grow at a slower rate than its larger rival, Microsoft (NASDAQ: MSFT) Azure, which implied it was falling behind in the cutthroat cloud and AI race.\nMeta's rising ad revenue, layoffs, and other cost-cutting measures boosted its operating margin from 25% in 2022 to 35% in 2023, even as it ramped up its spending in its unprofitable Reality Labs business. Alphabet also executed several rounds of layoffs, but its operating margin rose from 26% in 2022 to just 27% in 2023.\nAnalysts expect Meta's revenue and earnings to grow 12% and 18%, respectively, in 2024. Based on those estimates, which might need to be raised after Meta's latest earnings beat, its stock doesn't look particularly expensive at 28 times forward earnings. Its forward yield of 0.4% won't attract any serious investors, but it's a clear sign that it can continue to generate a stable profit while expanding its metaverse ecosystem.\nAnalysts expect Alphabet's revenue and earnings to rise 11% and 17%, respectively, in 2024. It doesn't pay a dividend yet, but its stock looks a bit cheaper at 21 times forward earnings. However, concerns about its advertising business and its ability to keep pace with Microsoft in the AI race could continue to compress its near-term valuations.\nIt's a close call, but I believe Meta will continue to outperform Alphabet this year as its advertising growth accelerates and it expands its operating margin. Its simpler business model could also make it more appealing for growth-oriented investors.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Apple, Meta Platforms, and Microsoft. The Motley Fool has a disclosure policy.\nBetter Tech Stock: Meta Platforms vs. Alphabet was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-13T07:57:53.000Z",
        "Title": "Alphabet Stock (NASDAQ:GOOGL): AI Innovation Warrants a Higher Multiple",
        "Author": "  TipRanks ",
        "Text": "Alphabet (NASDAQ:GOOGL) (NASDAQ:GOOG) stock has performed well but still hasn’t been the most magnificent of the so-called Magnificent Seven group over the past year. The artificial intelligence (AI) rally is still going strong into 2024, and though Alphabet has big AI innovation projects (perhaps better than some rivals), the stock still hasn’t been able to drive a great deal of multiple expansion in recent years.\nAt writing, shares of GOOGL go for a very reasonable 22.2 times forward price-to-earnings (P/E), making it not only the “cheapest” Magnificent Seven stock but also a name that’s not all too much pricier than where the stock normally trades. The modest valuation alone leaves me incredibly bullish on the stock as the company looks to put its foot on the gas with Gemini (formerly Bard).\nWith Google recently pulling the curtain on its Gemini Ultra paid tier, the firm is essentially following in the footsteps of ChatGPT-owner OpenAI. Heck, Gemini Ultra may appear to outperform ChatGPT-4 in certain measures. However, you can’t really dub either one as “better” for all uses, at least not yet.\nGemini is every bit as intriguing as it is capable. But is there something fundamentally wrong with the Alphabet story as it stays on the cutting edge of AI innovation, just like many of its peers?\nThere is one piece of hair on the GOOGL stock narrative. That lies in the high degree of uncertainty as to the fate of Google Search once AI potentially takes its place as the go-to “internet guru.” For now, it’s not yet known how many people will leave Google for greener pastures as new chatbots aim to grab a slice of share away from the previously untouchable search market.\nFor now, it’s probably a known fact that Google is leaning heavily on the strength of its search engine when it comes to sales and earnings. Given Google’s heavy reliance on Search, I guess you could say a bear-case scenario exists that would cause some to view the stock as a bit of a value trap.\nStill, I think the GOOGL avoiders and skeptics are wrong to view the name as a value trap just because it’s the heavyweight champ in Search with everything to lose as consumer-facing AI gets smarter and faster by the day.\nIf anything, generative AI products on Google could make the whole experience of Googling that much better. If there’s a company that can disrupt Google search, it’s a Google-built AI chatbot.\nAdditionally, Google chatbots are backed by one of the most enviable search engines (and data sets) on the planet. AI chatbot hallucinations (AI just making things up) remain one of the biggest problems with AI these days. As AI models — especially those created by Google — pay more emphasis on citing sources (and the reliability of said sources), we could see more links make good use of trusted websites with a thumbs up from Google.\nKnowing who and what to trust is vital, especially in the age of AI, when some users may just believe their chatbots without source-checking.\nCould it be that a search-based LLM (large language model) is only as good as the search engine behind it? Possibly. Only time will tell if search-backed LLMs become more popular than their data-trained ones that lack access to the most up-to-date information. And with “edge AI” (on-device AI) on the horizon, it’s just too early to tell how things will pan out with AI models in the future.\nPersonally, I see the most utility in a search-focused AI chatbot or a search engine that has a chatbot sitting off to the side, ready to assist upon request.\nEven if Google Search is bound to take a hit in the coming years, I’m confident that Alphabet will be able to adapt as it looks to diversify its revenue stream with a handful of powerful AI products. Just as Apple (NASDAQ:AAPL) was able to reinvent itself by shifting from the iPod (last generation’s top seller) to the iPhone, Alphabet will be able to move on from Google Search to what’s next as the industry tides shift.\nToday, Search represents a massive portion of the overall sales mix. But who knows what the breakdown will look like 10 years from now. My guess is that AI innovations will have grown into services that diversify the company beyond Search, perhaps putting it on the track of greater growth.\nSelf-driving vehicle services (think Waymo), AI-assisted drug discovery, generative AI search tailored for physicians, Google Cloud with AI, Gemini, and other intriguing technologies are essentially options capable of contributing to the earnings mix over time. Indeed, they could turn Alphabet into less of a search company and more of a disruptive AI company. With that said, I view Alphabet stock as one of the cheapest AI stocks in today’s overheated tech-driven market.\nOn TipRanks, GOOGL stock comes in as a Strong Buy. Out of 37 analyst ratings, there are 29 Buys and eight Hold recommendations. The average GOOGL stock price target is $164.56, implying upside potential of 11.5%. Analyst price targets range from a low of $141.00 per share to a high of $180.00 per share.\nThough GOOGL stock has been red-hot, surging nearly 60% over the past year alone, it still seems lukewarm when compared to some of its Magnificent Seven rivals. Whether Alphabet stock heats up on the back of AI to the magnitude of its peers remains to be seen. In any case, GOOGL stands out as a stock with GARP (growth at a reasonable price) written all over it. And it looks like a great pick-up, even if we are long overdue for a market correction in the first half of the year.\nDisclosure\n"
    },
    {
        "Date": "2024-02-02T12:46:03.000Z",
        "Title": "Analysts Have Made A Financial Statement On Alphabet Inc.'s (NASDAQ:GOOGL) Full-Year Report",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Shareholders might have noticed that Alphabet Inc. (NASDAQ:GOOGL) filed its full-year result this time last week. The early response was not positive, with shares down 7.2% to US$141 in the past week. It was a credible result overall, with revenues of US$307b and statutory earnings per share of US$5.80 both in line with analyst estimates, showing that Alphabet is executing in line with expectations. Earnings are an important time for investors, as they can track a company's performance, look at what the analysts are forecasting for next year, and see if there's been a change in sentiment towards the company. We've gathered the most recent statutory forecasts to see whether the analysts have changed their earnings models, following these results.\n View our latest analysis for Alphabet \nTaking into account the latest results, the consensus forecast from Alphabet's 47 analysts is for revenues of US$342.2b in 2024. This reflects a notable 11% improvement in revenue compared to the last 12 months. Statutory earnings per share are predicted to grow 14% to US$6.76. Before this earnings report, the analysts had been forecasting revenues of US$340.3b and earnings per share (EPS) of US$6.68 in 2024. The consensus analysts don't seem to have seen anything in these results that would have changed their view on the business, given there's been no major change to their estimates.\nThere were no changes to revenue or earnings estimates or the price target of US$163, suggesting that the company has met expectations in its recent result. Fixating on a single price target can be unwise though, since the consensus target is effectively the average of analyst price targets. As a result, some investors like to look at the range of estimates to see if there are any diverging opinions on the company's valuation. Currently, the most bullish analyst values Alphabet at US$180 per share, while the most bearish prices it at US$140. This is a very narrow spread of estimates, implying either that Alphabet is an easy company to value, or - more likely - the analysts are relying heavily on some key assumptions.\nOf course, another way to look at these forecasts is to place them into context against the industry itself. We would highlight that Alphabet's revenue growth is expected to slow, with the forecast 11% annualised growth rate until the end of 2024 being well below the historical 17% p.a. growth over the last five years. Juxtapose this against the other companies in the industry with analyst coverage, which are forecast to grow their revenues (in aggregate) 9.7% annually. Factoring in the forecast slowdown in growth, it looks like Alphabet is forecast to grow at about the same rate as the wider industry.\nThe most obvious conclusion is that there's been no major change in the business' prospects in recent times, with the analysts holding their earnings forecasts steady, in line with previous estimates. They also reconfirmed their revenue estimates, with the company predicted to grow at about the same rate as the wider industry. The consensus price target held steady at US$163, with the latest estimates not enough to have an impact on their price targets.\nWith that said, the long-term trajectory of the company's earnings is a lot more important than next year. We have forecasts for Alphabet going out to 2026, and you can see them free on our platform here.\nYou can also see our  analysis of Alphabet's Board and CEO remuneration and experience, and whether company insiders have been buying stock.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-26T19:25:34.000Z",
        "Title": "Alphabet Drops During Renewed Fears About Google’s AI Offerings",
        "Author": "  Jeran Wittenstein ",
        "Text": "(Bloomberg) -- Alphabet Inc. is falling amid renewed fears that the Google owner’s missteps in artificial intelligence are putting its search business at risk.\nMost Read from Bloomberg\nHow Much Wealth You Need to Join the Richest 1% Around the World\nApple to Wind Down Electric Car Effort After Decadelong Odyssey\nSingapore’s Richest Banking Dynasty Grapples With Succession\nThis Is Where New Migrants Are Going When They Reach the US\nSupreme Court Immunity Case Jeopardizes Trump Trial Pre-Election\nThe stock dropped as much as 4.4% Monday following last week’s pause of a Google image generation feature that drew criticism over inaccurate historical depictions of race. Alphabet shed more than $70 billion from its market value.\nProblems with AI tools may fuel the perception that Google is “an unreliable source for AI” and create an opening for competitors, Melius Research analyst Ben Reitzes warned in a research note.\n“We have been arguing that Search behavior is about to change - with new AI-infused features,” said Reitzes. “This ‘once in a generation’ change by itself creates opportunities for competitors, but even more if a meaningful portion of users grow concerned about Google’s hallucinations and bias.”\nLast week, Google acknowledged inaccuracies in image generation depictions of people and said it’s addressing the problems. Google aims to resume the feature in the “next couple of weeks,” Demis Hassabis, head of the research division Google DeepMind, said on Monday at the Mobile World Congress in Barcelona.\nMost Read from Bloomberg Businessweek\nChina’s Piano Dreams Are Fading for a Cash-Strapped Middle Class\nElon Musk’s Vegas Tunnel Project Has Been Racking Up Safety Violations\nHollywood Is Banking on Dune: Part Two to Revive the Blockbuster Experience\nThere’s One Musk Endeavor That’s Not Doing So Great\nHong Kong’s Hottest New Store Is the Costco in Shenzhen\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-24T19:49:31.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL): Undervalued and Overlooked Magnificent Seven Stock",
        "Author": "  TipRanks ",
        "Text": "Magnificent Seven stocks have attracted plenty of buzz as investors gravitate toward their vast market share and exceptional returns. Every Magnificent Seven stock has more than doubled over the past five years. These assets have significantly outperformed the market during that time. However, Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) has been a largely underappreciated stock.\nThe corporation has amassed a $1.75 trillion market cap and is up by 56% over the past year. Still, that gain falls behind most of the Magnificent Seven stocks. New opportunities and a good valuation can help Alphabet gain momentum and accumulate long-term returns for investors. Those catalysts make me bullish on the stock.\nAlthough the company owns the largest search engine in the world, it’s fallen behind the Magnificent Seven stocks in recent years. These are the one-year and five-year returns for each stock within the cohort.\nOne-year returns:\nNvidia: 223%\nMeta Platforms: 171%\nAmazon: 77%\nMicrosoft: 58%\nAlphabet: 56%\nApple: 22%\nTesla: -2%\nFive-year returns:\nNvidia: 1,579%\nTesla: 882%\nApple: 320%\nMicrosoft: 260%\nMeta Platforms: 187%\nAlphabet: 157%\nAmazon: 106%\nThese are still impressive returns and outpace the S&P 500 (SPX) and Nasdaq 100 (NDX). However, Alphabet has been outclassed by every Magnificent Seven stock except Amazon (NASDAQ:AMZN) over the past five years.\nWhile the stock has underperformed its peers within the cohort, Alphabet has a better valuation than most tech companies. The stock trades at a 24.5 P/E ratio and has solid profit margins. The company’s net profit margin usually exceeds 20% and should get a big boost in future quarters.\nAlphabet has three components on its side: rising revenue, more profits, and cost-cutting measures. The tech giant reported 13% year-over-year revenue growth and 51.8% year-over-year net income growth in Q4 2023. Alphabet’s efforts to trim its workforce contributed to higher margins and seem to be ongoing.\nA contributing factor to Alphabet’s rising net income is the recent profitability of Google Cloud. The cloud computing segment has been taking up a larger percentage of revenue and attributed to more than 10% of Q4-2023 revenue. Google Cloud generated $9.2 billion of the company’s $86.3 billion in revenue. Google Cloud swung from a $186 million operating loss in Q4 2022 to generating $864 million in operating income in Q4 2023.\nGoogle Cloud’s margins should improve significantly in future quarters and reduce the company’s P/E ratio by increasing its earnings.\nWhile it’s nice to see Alphabet expanding in other verticals, it’s no secret that advertising is the main engine for this corporation. Advertising sales slowed down in 2022 but came back to life in 2023. Its fourth-quarter results further highlight this fact and suggest that Alphabet has more to gain.\nThe fourth quarter featured $76.3 billion in Google Services revenue. This segment mainly consists of the company’s advertising and grew by 12.5% year-over-year. Advertising should receive an additional boost from the Olympic Games and the upcoming Presidential Election.\nHigher advertising revenue also translates into more profits. While the same can be said about most businesses, Alphabet achieved a 35.0% operating margin with its Google Services segment in Q4.\nAmong the Magnificent Seven stocks, Nvidia (NASDAQ:NVDA) and Microsoft (NASDAQ:MSFT) are the clear leaders in the artificial intelligence industry. However, Alphabet is also poised to gain a meaningful slice of the pie by using its existing technology and making new investments.\nAlphabet recently launched Gemini in a bid to bolster its AI presence. The tech firm also invested over $2 billion into an OpenAI competitor. Alphabet has been using artificial intelligence to improve its search results and cloud platform, but these investments represent the next steps to gain market share.\nAlphabet can close the gap in the AI race with Microsoft. The company started Google Cloud two years after Amazon got a head start with Amazon Web Services. Now, Google Cloud is a critical component of the company’s business. Alphabet has invested in many ventures known as Other Bets that are growing at a high rate. While this segment makes up a small part of total revenue, it’s worth monitoring the collection of businesses under the umbrella term.\nMost analysts are bullish on Alphabet stock. The stock sports 29 Buys and eight Hold ratings from analysts, giving it a Strong Buy consensus rating. The average GOOGL stock price target of $164.59 implies 14.3% upside potential.\nAlphabet is an under-the-radar stock (relatively) due to the impressive performances of other Magnificent Seven stocks. The tech giant has outperformed the market but has underperformed most of the corporations in its cohort.\nRising revenue and profits from advertising and cloud computing present a great opportunity. Alphabet also seems determined to gain more market share in artificial intelligence, which is a great long-term move for the corporation.\nDisclosure\n"
    },
    {
        "Date": "2024-02-07T11:00:25.000Z",
        "Title": "Alphabet Inc.'s (NASDAQ:GOOGL) Stock Is Going Strong: Is the Market Following Fundamentals?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Most readers would already be aware that Alphabet's (NASDAQ:GOOGL) stock increased significantly by 11% over the past three months. Since the market usually pay for a company’s long-term fundamentals, we decided to study the company’s key performance indicators to see if they could be influencing the market. In this article, we decided to focus on Alphabet's  ROE.\nReturn on Equity or ROE is a test of how effectively a company is growing its value and managing investors’ money. In simpler terms, it measures the profitability of a company in relation to shareholder's equity.\n View our latest analysis for Alphabet \nReturn on equity can be calculated by using the formula:\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\nSo, based on the above formula, the ROE for Alphabet is:\n26% = US$74b ÷ US$283b (Based on the trailing twelve months to December 2023).\nThe 'return' refers to a company's earnings over the last year. Another way to think of that is that for every $1 worth of equity, the company was able to earn $0.26 in profit.\nSo far, we've learned that ROE is a measure of a company's profitability. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics.\nFirst thing first, we like that Alphabet has an impressive ROE. Second, a comparison with the average ROE reported by the industry of 11% also doesn't go unnoticed by us. Probably as a result of this, Alphabet was able to see a decent net income growth of 18% over the last five years.\nAs a next step, we compared Alphabet's net income growth with the industry, and pleasingly, we found that the growth seen by the company is higher than the average industry growth of 6.2%.\nEarnings growth is an important metric to consider when valuing a stock. What investors need to determine next is if the expected earnings growth, or the lack of it, is already built into the share price. This then helps them determine if the stock is placed for a bright or bleak future. What is GOOGL worth today? The  intrinsic value infographic in our free research report  helps visualize whether GOOGL is currently mispriced by the market.\nGiven that Alphabet doesn't pay any dividend to its shareholders, we infer that the company has been reinvesting all of its profits to grow its business.\nIn total, we are pretty happy with Alphabet's performance. In particular, it's great to see that the company is investing heavily into its business and along with a high rate of return, that has resulted in a sizeable growth in its earnings. That being so, a study of the latest analyst forecasts show that the company is expected to see a slowdown in its future earnings growth. To know more about the latest analysts predictions for the company, check out this visualization of analyst forecasts for the company.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-05T16:15:00.000Z",
        "Title": "61.5 Billion Reasons Alphabet Stock Is a Buy Again for 2024",
        "Author": "  Nicholas Rossolillo, The Motley Fool ",
        "Text": "Alphabet's (NASDAQ: GOOGL) (NASDAQ: GOOG) Google Search is totally back to kick off 2024. But as investors' collective focus pivoted to profitable growth during the bear market, this is where the company stood out. Total operating income profit margins dialed in at 27.5% in Q4 2023, up from 24% a year ago.\nWith profits rising again, Alphabet went to work last year doling out more shareholder returns. And those returns comprise the 61.5 billion reasons Alphabet is still a buy and hold in my book for 2024.\nAlphabet revealed in its Q4 2023 financial filings that it shelled out a whopping $61.5 billion worth of share buybacks last year. That was a near-4% increase from 2022. Not bad for a bear market.\nGranted, Alphabet also doled out employee stock-based compensation of $22.5 billion last year. Nevertheless, the buybacks still more than offset that amount and effectively reduced the total share count along the way. Investors were rewarded with a net 3.3% decrease in average shares outstanding in 2023 (a lower share count boosts earnings per share for remaining shareholders).\nPaired with those profit margin increases, the lowered share count is what helped Alphabet report a massive 56% year-over-year increase in earnings per share in Q4 2023.\nOf course, of the world's largest tech companies that also repurchase stock as part of their shareholder return policy, Apple reigns supreme. (Amazon is excluded here, as it has no current stock buyback program.)\nHowever, what's impressive about Alphabet's shareholder returns is that it was also able to pull this off, all the while shelling out massive amounts of cash to upgrade its data centers and global infrastructure for a new era of artificial intelligence and accelerated computing. Purchases of property and equipment (or capex) totaled $32.3 billion last year. By comparison, Apple's capex was about one-third of Alphabet's.\nThat speaks volumes about Apple's efficiency in designing and selling top consumer products, but let's not take too much away from Alphabet. It's a totally different business model, one where constant data center upgrades to support its internet-based business are a necessity.\nAnd in spite of all the capex spending and $61.5 billion in stock buybacks, Alphabet didn't even make a dent in its massive cash hoard. At the end of the year, it had cash and short-term equivalents of $111 billion, plus long-term investments of $31 billion. That's relatively unchanged from the cash and equivalents of $114 billion, and long-term investments of $30.5 billion, at the end of 2022.\nIn other words, Alphabet still has plenty of room to return even more cash to its shareholders in the years to come.\nAlphabet's various businesses continue to make more changes to focus on shareholder value creation as 2024 gets rolling. Google Cloud is only just now hitting the 10% operating profit margin threshold, so it has space to run higher. And the Google Other Bets segment (X Labs, which houses start-ups like Waymo) also said it will be bringing in outside investors starting this year to unlock more potential.\nIf profit margins increase again this year, I expect another ramp-up in Alphabet's stock buybacks. This, paired with all that cash on the balance sheet, is a top reason I'm content to keep holding my shares for the long haul.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Alphabet wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 29, 2024\n \nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Nicholas Rossolillo has positions in Alphabet, Amazon, Apple, Meta Platforms, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has a disclosure policy.\n61.5 Billion Reasons Alphabet Stock Is a Buy Again for 2024 was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-28T22:45:21.000Z",
        "Title": "Alphabet (GOOGL) Declines More Than Market: Some Information for Investors",
        "Author": "  Zacks Equity Research ",
        "Text": "The most recent trading session ended with Alphabet (GOOGL) standing at $136.38, reflecting a -1.8% shift from the previouse trading day's closing. This move lagged the S&P 500's daily loss of 0.17%. Elsewhere, the Dow lost 0.06%, while the tech-heavy Nasdaq lost 0.55%.\nThe the stock of internet search leader has fallen by 8.31% in the past month, lagging the Computer and Technology sector's gain of 2.65% and the S&P 500's gain of 3.98%.\nMarket participants will be closely following the financial results of Alphabet in its upcoming release. It is anticipated that the company will report an EPS of $1.49, marking a 27.35% rise compared to the same quarter of the previous year. Meanwhile, the latest consensus estimate predicts the revenue to be $65.95 billion, indicating a 13.58% increase compared to the same quarter of the previous year.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $6.78 per share and revenue of $286.52 billion, which would represent changes of +16.9% and +11.7%, respectively, from the prior year.\nInvestors might also notice recent changes to analyst estimates for Alphabet. These revisions help to show the ever-changing nature of near-term business trends. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 1.24% increase. Right now, Alphabet possesses a Zacks Rank of #3 (Hold).\nFrom a valuation perspective, Alphabet is currently exchanging hands at a Forward P/E ratio of 20.5. This valuation marks a discount compared to its industry's average Forward P/E of 27.08.\nWe can additionally observe that GOOGL currently boasts a PEG ratio of 1.28. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. By the end of yesterday's trading, the Internet - Services industry had an average PEG ratio of 2.18.\nThe Internet - Services industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 101, putting it in the top 41% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-05T11:02:01.000Z",
        "Title": "Alphabet Inc: An Exploration into Its Intrinsic Value",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Alphabet Inc's (NASDAQ:GOOGL) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 4 Warning Sign with MA.\nAs of 2024-02-05, Alphabet Inc's intrinsic value as calculated by the Discounted Earnings model is $185.66. It's currently trading at a price of $142.37. Therefore, the margin of safety based on the DCF model is 23.32%. The company is modestly undervalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Alphabet Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$5.94\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.09%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 21.80% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n102.56\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n106.93\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n185.66\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $166.94. This valuation indicates that the Alphabet Inc is modestly undervalued, accompanied by a margin of safety of 14.72%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-19T12:00:21.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL) sheds 4.8% this week, as yearly returns fall more in line with earnings growth",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose your money. But on the bright side, if you buy shares in a high quality company at the right price, you can gain well over 100%. For instance, the price of Alphabet Inc. (NASDAQ:GOOGL) stock is up an impressive 152% over the last five years. On the other hand, the stock price has retraced 4.8% in the last week. However, this might be related to the overall market decline of 0.06% in a week.\nIn light of the stock dropping 4.8% in the past week, we want to investigate the longer term story, and see if fundamentals have been the driver of the company's positive five-year return.\n View our latest analysis for Alphabet \nTo quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\nOver half a decade, Alphabet managed to grow its earnings per share at 22% a year. This EPS growth is reasonably close to the 20% average annual increase in the share price. This indicates that investor sentiment towards the company has not changed a great deal. In fact, the share price seems to largely reflect the EPS growth.\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values).\nWe know that Alphabet has improved its bottom line lately, but is it going to grow revenue? You could check out this free report showing analyst revenue forecasts.\nIt's nice to see that Alphabet shareholders have received a total shareholder return of 49% over the last year. That gain is better than the annual TSR over five years, which is 20%. Therefore it seems like sentiment around the company has been positive lately. In the best case scenario, this may hint at some real business momentum, implying that now could be a great time to delve deeper. Is Alphabet cheap compared to other companies? These 3 valuation measures might help you decide.\nIf you would prefer to check out another company -- one with potentially superior financials -- then do not miss this free list of companies that have proven they can grow earnings.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-05T05:58:41.000Z",
        "Title": "Should You Hold Alphabet (GOOG)?",
        "Author": "  Soumya Eswaran ",
        "Text": "Madison Investments, an investment advisor, released its “Madison Sustainable Equity Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. During the fourth quarter, equity markets ended the year on a high note, with the S&P 500 achieving an 11.7% increase. This brought the full-year return to 26.3%. The Fund (Class Y) returned 18.0% for the year, but had a Q4 return of 11.9%, trailing the S&P 500. The fourth quarter's strength can be attributed to the yield curve's downward shift. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nMadison Sustainable Equity Fund featured stocks such as Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On February 2, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $143.54 per share. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was 4.48%, and its shares gained 36.42% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.777 trillion.\nMadison Sustainable Equity Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:\n\"Alphabet Inc. (NASDAQ:GOOG) was positive during the quarter but had a more modest gain in the fourth quarter following a strong third quarter and as a result, lagged the Technology sector more broadly. Alphabet’s third quarter included solid Search and You Tube results while Cloud growth was a bit softer, growing at 22% year-over-year. Google continues to incorporate AI in its core search businesses. It has been rolled out to a wide number of users across multiple geographies. We will continue to watch how Google adapts AI in its businesses and monitor cloud growth.\"\nA laptop and phone open to Google's services in an everyday setting.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 163 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of third quarter which was 152 in the previous quarter.\nWe discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Light Street Capital's top stock picks. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\nSuggested Articles:\n10 Most Innovative Economies in Central and South America\n15 Highest Quality Flours for Any Type of Recipe\n10 Best Gold Royalty and Small-Cap Gold Stocks to Buy\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-02-15T18:23:27.000Z",
        "Title": "Why Alphabet Stock Stumbled Thursday Morning",
        "Author": "  Danny Vena, The Motley Fool ",
        "Text": "Shares of Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) slipped on Thursday morning, falling as much as 3.8%. As of 12:32 p.m. ET, the stock was still down 2.7%.\nThe catalyst that sent the tech giant lower was troubling reports involving collisions within the company's Waymo self-driving car unit.\nReports emerged late yesterday that Waymo was forced to recall the software that controls its self-driving cars. The company noted that all the cars in its current fleet had been updated, but the cause of the recall was equal parts humorous and troubling.\nWaymo filed a voluntary recall report with the National Highway Traffic Safety Administration for software that had previously powered its fleet. The company cited two separate \"incidents\" that occurred in Phoenix, Arizona, on Dec. 11.\nIt seems that a Waymo self-driving car \"made contact\" (read \"crashed\") with a pickup truck that was being hauled by a tow truck. The company notes that the truck was being \"improperly towed,\" which caused it to consistently veer between lanes of traffic. Following the collision, the tow truck driver failed to stop, and another Waymo vehicle crashed into the pickup just moments later.\nThe company was quick to note that neither Waymo vehicle had passengers at the time, resulting in no injuries and only \"minor vehicle damage.\"\nSelf-driving cars have been making headlines in recent months -- and not in a good way. Earlier this month, a Waymo vehicle had a collision with a cyclist in San Francisco, who suffered only minor injuries. A week later, a crowd surrounded and set fire to a Waymo vehicle in the same city -- presumably in response to the earlier incident, though the matter is still under investigation.\nThis all comes just months after General Motors recalled all 950 of its Cruise robotaxis. A pedestrian, who was the victim of a hit-and-run accident, had been catapulted into an adjacent lane where they were struck by a Cruise self-driving car and dragged after the vehicle wasn't able to stop.\nSelf-driving cars don't move the needle for Alphabet, but some investors believe the technology has the potential to be a significant growth driver in the future.\nThere are plenty of reasons to buy Alphabet stock, but it's clear self-driving isn't yet ready for prime time.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Danny Vena has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool recommends General Motors and recommends the following options: long January 2025 $25 calls on General Motors. The Motley Fool has a disclosure policy.\nWhy Alphabet Stock Stumbled Thursday Morning was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-29T16:30:40.000Z",
        "Title": "Why Is Alphabet (GOOGL) Down 2.7% Since Last Earnings Report?",
        "Author": "  Zacks Equity Research ",
        "Text": "A month has gone by since the last earnings report for Alphabet (GOOGL). Shares have lost about 2.7% in that time frame, underperforming the S&P 500.\nWill the recent negative trend continue leading up to its next earnings release, or is Alphabet due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important drivers.\nAlphabet’s fourth-quarter 2023 earnings of $1.64 per share beat the Zacks Consensus Estimate by 2.5%. The figure grew 56.2% year over year.Revenues of $86.31 billion increased 13% year over year (13% at constant currency).Net revenues, excluding total traffic acquisition costs (“TAC”) (the portion of revenues shared with Google’s partners and amount paid to distribution partners and others who direct traffic to Google’s website), were $72.32 billion, which surpassed the consensus mark of $70.77 billion. The figure rose 14.6% from the year-ago quarter’s level.TAC of $13.99 billion was up 8.2% year over year.Top-line growth was driven by solid Search and YouTube’s performance. The growing cloud and Other Bets segments were a positive. Also, the improving advertisement business was a plus.However, Alphabet continued to witness sluggishness in Google Network ads, which remained a concern.Nevertheless, Alphabet’s growing investments in AI to boost its Search, YouTube and cloud business are likely to yield massive returns in the days ahead. This is expected to instill investor optimism in the stock in the days ahead.\nAlphabet reports revenues under Google Services, Google Cloud and Other Bets.Google Services:Revenues from the Google Services business increased 12.5% year over year to $76.31 billion, accounting for 88.4% of total revenues. The figure beat the Zacks Consensus Estimate of $74.95 billion.Under this business, search revenues from Google-owned sites increased 12.7% year over year to $48.02 billion, surpassing the Zacks Consensus Estimate of $47.84 billion.YouTube’s advertising revenues improved 15.5% year over year to $9.2 billion, while Network advertising revenues decreased 2.1% to $8.3 billion. While YouTube ad revenues came ahead of the Zacks Consensus Estimate of $9.1 billion, Network ad revenues were below the consensus mark of $8.5 billion.Total Google advertising revenues were up 11% year over year to $65.52 billion and accounted for 76% of the total revenues. The figure beat the consensus mark of $65.45 billion.Google subscriptions, platforms and devices revenues, formerly known as Google Other revenues, were $10.8 billion in the fourth quarter, up 22.7% year over year. The figure came ahead of the consensus mark of $9.7 billion.Google Cloud:Google Cloud revenues rose 25.7% year over year to $9.19 billion, accounting for 10.6% of the quarter’s total revenues. The reported metric surpassed the Zacks Consensus Estimate of $9.04 billion.Other Bets:Other Bets’ revenues were $657 million, up 190.7% year over year and accounted for 0.8% of the total fourth-quarter revenues. The figure beat the consensus mark of $298 million.\nEMEA (29% of total revenues): GOOGL generated $25.01 billion in revenues from the region, increasing 15% year over year.APAC (16.2% of total revenues): The region generated $13.98 billion in revenues, up 17% from the year-ago quarter’s level.Other Americas (6% of total revenues): The region generated $5.2 billion in revenues, up 11% on a year-over-year basis.United States (48.7% of total revenues): Alphabet generated $41.99 billion in revenues from the region, which increased 14% from the prior-year quarter’s level.\nCosts and operating expenses were $62.6 billion, up 8.2% year over year. As a percentage of revenues, the figure contracted 360 basis points (bps) from the year-ago quarter’s level.The operating margin was 27.5%, which expanded 360 bps year over year. Segment-wise, Google Services’ operating margin of 35% expanded 520 bps from the prior-year quarter’s level.Google Cloud reported operating income of $864 million compared with a loss of $186 million in the year-ago quarter.Other Bets reported a loss of $863 million compared with a loss of $1.24 billion in the prior-year quarter.\nAs of Dec 31, 2023, cash, cash equivalents and marketable securities were $110.9 billion, down from $119.9 billion as of Sep 30, 2023.Long-term debt was $13.25 billion at the end of the reported quarter compared with $13.8 billion at the end of the previous quarter.Alphabet generated $19.92 billion of cash from operations in fourth-quarter 2023 compared with $30.7 billion in third-quarter 2023.GOOGL spent $11.02 billion on capex, netting a free cash flow of $7.9 billion in the reported quarter.\nHow Have Estimates Been Moving Since Then?\nIt turns out, estimates revision have trended upward during the past month.\nVGM Scores\nCurrently, Alphabet has a nice Growth Score of B, however its Momentum Score is doing a bit better with an A. However, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\nOverall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.\nOutlook\nEstimates have been trending upward for the stock, and the magnitude of these revisions looks promising. Notably, Alphabet has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-17T10:06:00.000Z",
        "Title": "Here's Why Alphabet Is the Best AI Stock to Buy Right Now",
        "Author": "  Neil Patel, The Motley Fool ",
        "Text": "The possibility of interest rate cuts and ongoing inflationary pressures might draw investor attention. But nothing beats the excitement around artificial intelligence (AI). This has undoubtedly been the top market topic in the last year or so.\nWith shares soaring 404% since the start of 2023, Nvidia looks like it's the poster child of the AI boom. Thanks to its position as an infrastructure provider, investors probably view the business as the best way to play the trend.\nBut don't forget about the tech behemoth that is Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG). I think this top internet enterprise is the best AI stock to buy right now. Here's why.\nThe release of OpenAI's ChatGPT in late 2022 revitalized the discussion around AI and its potential to impact many different industries. This spurred companies to figure out ways to incorporate the technology into their own operations, hoping investors would reward this new focus.\nHowever, it shouldn't come as a shock to anyone that Alphabet has long been prioritizing AI advancements. The company's top segment, Google Search, started using machine learning and AI capabilities as far back as 2001 to help users improve spelling when making search queries. There's no doubt that this focus helped make Alphabet the dominant company that it is today.\nGoogle Search is arguably the single most important internet-based service in the world, mainly because it has become a gateway for users to find information. And its success is still critical to Alphabet today, as Search raked in $48 billion of revenue in the fourth quarter of 2023, representing 56% of the company's total.\nCEO Sundar Pichai claimed in a 2016 blog post that Alphabet was no longer a mobile-first enterprise, but \"AI-first\" from that point forward. This meant creating \"a world where computing becomes universally available.\"\nI'd say the business has been successful in this regard. Many of Alphabet's products already incorporate AI. Gmail uses AI not only to help with spell check, but by also reducing spam. Google Cloud continues to integrate AI functionality into the various tools it offers clients, so that they can benefit from this revolutionary technology. And -- what I believe is an extremely neat feature -- Google Photos allows users to find an image they're looking for by searching what's in the picture. These are just a few examples.\nTen years from now, I have a lot of confidence that Alphabet will not only remain a leader in AI, but that it could also separate itself from other top companies in the space. It all has to do with Alphabet's data advantage.\nFifteen of the company's products and services are used by more than 500 million people across the globe. In fact, google.com and youtube.com are the two most visited websites on the planet. Consequently, I'd be surprised if there's another business that collects more data than Alphabet.\nAnd this means the company can constantly train its AI systems to improve. This leads to a positive feedback loop where more data means better AI models, which results in improved customer experiences and greater usage, leading to even more data collection. That's a powerful advantage for Alphabet.\nIt's probably no wonder that the company's latest generative AI model, Gemini, beats ChatGPT in numerous performance areas.\nBesides the topic of AI, Alphabet makes for a smart investment because its shares are attractively priced. The FAANG stock trades at a price-to-earnings (P/E) multiple of 25.6.\nNvidia, on the other hand, sells for a P/E ratio of 97.2. To be fair, the chipmaker is registering monster growth. But it looks like investors are pricing in the belief that growth at this rate can go on indefinitely. And this won't be the case.\nThis makes Alphabet the best AI stock to buy right now, in my opinion.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Neil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy.\nHere's Why Alphabet Is the Best AI Stock to Buy Right Now was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-27T12:00:14.000Z",
        "Title": "Alphabet (NASDAQ:GOOGL) Has A Rock Solid Balance Sheet",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of permanent loss is the risk I worry about... and every practical investor I know worries about.' It's only natural to consider a company's balance sheet when you examine how risky it is, since debt is often involved when a business collapses. As with many other companies Alphabet Inc. (NASDAQ:GOOGL) makes use of debt. But the more important question is: how much risk is that debt creating?\nGenerally speaking, debt only becomes a real problem when a company can't easily pay it off, either by raising capital or with its own cash flow. If things get really bad, the lenders can take control of the business. While that is not too common, we often do see indebted companies permanently diluting shareholders because lenders force them to raise capital at a distressed price. Of course, the upside of debt is that it often represents cheap capital, especially when it replaces dilution in a company with the ability to reinvest at high rates of return. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n Check out our latest analysis for Alphabet \nThe chart below, which you can click on for greater detail, shows that Alphabet had US$12.9b in debt in December 2023; about the same as the year before. However, its balance sheet shows it holds US$110.9b in cash, so it actually has US$98.0b net cash.\nAccording to the last reported balance sheet, Alphabet had liabilities of US$81.8b due within 12 months, and liabilities of US$37.2b due beyond 12 months. Offsetting this, it had US$110.9b in cash and US$48.0b in receivables that were due within 12 months. So it actually has US$39.9b more liquid assets than total liabilities.\nThis surplus suggests that Alphabet has a conservative balance sheet, and could probably eliminate its debt without much difficulty. Succinctly put, Alphabet boasts net cash, so it's fair to say it does not have a heavy debt load!\nAlso good is that Alphabet grew its EBIT at 18% over the last year, further increasing its ability to manage debt. There's no doubt that we learn most about debt from the balance sheet. But it is future earnings, more than anything, that will determine Alphabet's ability to maintain a healthy balance sheet going forward. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\nFinally, while the tax-man may adore accounting profits, lenders only accept cold hard cash. While Alphabet has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance. During the last three years, Alphabet generated free cash flow amounting to a very robust 81% of its EBIT, more than we'd expect. That puts it in a very strong position to pay down debt.\nWhile we empathize with investors who find debt concerning, you should keep in mind that Alphabet has net cash of US$98.0b, as well as more liquid assets than liabilities. And it impressed us with free cash flow of US$69b, being 81% of its EBIT. So we don't think Alphabet's use of debt is risky. Over time, share prices tend to follow earnings per share, so if you're interested in Alphabet, you may well want to click here to check an interactive graph of its earnings per share history.\nIf, after all that, you're more interested in a fast growing company with a rock-solid balance sheet, then check out our list of net cash growth stocks without delay.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-14T21:31:41.000Z",
        "Title": "Nvidia replaces Alphabet as Wall St's third most valuable company",
        "Author": "  Noel Randewich ",
        "Text": "By Noel Randewich\n(Reuters) -Nvidia eclipsed Google-parent Alphabet as the third most valuable U.S. company on Wednesday, just after overtaking Amazon and as investors looked to the dominant AI chipmaker's upcoming quarterly report.\nThe Santa Clara, California company's stock rose 2.46%, putting its value at $1.825 trillion, while Alphabet's stock climbed 0.55%, leaving it with a value of $1.821 trillion.\nNvidia has been a top beneficiary of technology companies' race to build AI into their products and services, and the latest gain in its stock came a day after it ended a session with a market capitalization above Amazon's for the first time in two decades.\nAmazon's market capitalization was $1.776 trillion after its stock rose 1.39% on Wednesday.\nNvidia controls about 80% of the high-end AI chip market, a position that has boosted its stock price 47% this year after it more than tripled in 2023. Customers face shortages of Nvidia's top-of-the-line components while AI developers face months-long waiting lists to use its processors through cloud-computing providers.\nTechnology-related companies, including Microsoft and Meta Platforms, have also rallied to record highs on AI optimism.\nNvidia's quarterly report next Wednesday will be among Wall Street's most closely watched of the week. Analysts expect another blowout quarter and outlook, and anything less could deflate Wall Street's AI rally, some investor warned.\n\"The market recognizes Nvidia as the AI king. But if Nvidia has one bad quarterly report, if they don’t overly-exceed investors’ expectations, this thing could sell off 20 or 30 percent in one after-hours session,\" said Jake Dollarhide, Chief Executive Officer of Longbow Asset Management in Tulsa.\nSusquehanna analyst Christopher Rolland on Wednesday increased his price target for Nvidia's stock to $850 from $625, saying he expects strong quarterly results and guidance. Nvidia shares were last at $739.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world's most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world's third most valuable publicly-listed company, according to LSEG.\nAnalysts, on average, see Nvidia's January fiscal quarter revenue more than tripling to $20.37 billion, fueled by demand for its top-shelf AI chips, according to LSEG data. Analysts see its adjusted net profit surging over 400% to $11.38 billion.\nNvidia is trading at around 34 times expected earnings, up from about 24 in early January, and down from over 50 a year ago, according to LSEG.\n(Reporting by Noel Randewich in Oakland, Calif., and by Medha Singh in Bengaluru; Editing by Arun Koyyur, Nick Zieminski and David Gregorio)\n"
    },
    {
        "Date": "2024-02-07T13:01:38.000Z",
        "Title": "Alphabet's Culture Issue Is Worse Than Its Earnings Issue",
        "Author": "  Grahamites ",
        "Text": "Google's parent company, Alphabet Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL), reported earnings on Jan. 30. Although revenue grew by double digits, the stock was down after the report because ad sales growth was slower than analysts' expectations. Google search and YouTube ads revenue had healthy double-digit growth, but the Google Network segment's revenue declined 2% year over year. Combined, Google ad revenue grew 11% year over year.\nWarning! GuruFocus has detected 6 Warning Signs with META.\nCompared to Amazon (NASDAQ:AMZN), Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META), Alphabet's results were clearly disappointing.\nI have followed big U.S. and Chinese technology companies for more than 10 years now. I remember back in 2014, Alibaba (NYSE:BABA) and Alphabet both seemed invincible. But now, both companies are running into trouble. In my opinion, both Alibaba and Alphabet's biggest challenge is culture, which ironically used to be their strength. In the past I've written about Alibaba's cultural crisis. In this discussion, I will focus on Alphabet's culture with discussions of both its pros and cons.\nDuring the 2018 Berkshire Hathaway (NYSE:BRK.A) (NYSE:BRK.B) shareholder meeting, the late Charlie Munger commented on Alphabet's culture. He said, \"I've been to Google headquarters. It looked to me like a kindergarten.\" Warren Buffett (Trades, Portfolio) added, \"A very rich kindergarten.\"\nI agree with Munger and Buffett's observations about Google because I have also been to its headquarters a few times. Personally I wouldn't use the word kindergarten to describe it, but the atmosphere is certainly very laid-back with plenty of on-site facilities. This atmosphere was designed from day one to help facilitate creativity, as laid out by Google's very first founders' letter, which states the following:\nGoogle is not a conventional company. We do not intend to become one. Throughout Google's evolution as a privately held company, we have managed Google differently. We have also emphasized an atmosphere of creativity and challenge, which has helped us provide unbiased, accurate and free access to information for those who rely on us around the world.\nHaving the best talent is key to Alphabet's business model. To attract the best talent, the company created the unconventional decentralized atmosphere and offered the highest compensation package in the industry. As a result, it has always had a very high win-rate when recruiting talent. Once the best engineers join the company, they have maximum amount of flexibility and enjoy tremendous benefits such as a free gym, snacks, diverse on-site restaurants and much more. In other words, everything is taken care of by Alphabet. This is probably why Munger and Buffett call it a kindergarten.\nThis culture worked very well in the early years. I remember during my first visit to Google campus in 2014, I was really impressed by the open and vibrant culture. For a long time, this was key to Alphabet's moat.\nLike all other big tech companies, Alphabet grew its employee base rapidly over the past decade as its business continued to expand. In 2014, the company had only 53,600 employees. By the end of 2022, the number of employees had ballooned to 190,234. Inevitably, more employees means more bureaucracy. This is true for all big tech companies. The company realized it had too many employees so, for the first time in its history, it implemented layoffs, which decreased the employee count to 182,381 as of the latest quarter.\nBut bureaucracy is not Alphabet's main cultural issue. I think the biggest issue with its culture is complacency and sloth, which ironically is the accumulated result of the decentralized and creative culture it is proud of. It is analogous to spoiling your children. The best way to destroy a talented child is to spoil him or her with easy-to-get luxuries. For many years, Alphabet's engineers have been used to this hands-off and laid-back approach of management. This approach works as long as the business is booming. But once the competition picks up, Alphabet's culture can be detrimental. It is like going to war with an army of soldiers who are rusty at essential military skills.\nAnother issue with the company's culture is its lack of flexibility in terms of product design and development, which resulted in less user-friendly products. The best example is the cloud business. Alphabet developed the cloud technology years before Amazon. But Alphabet's product is not user-friendly at all because its engineers are not used to listening to customer feedback. Therefore, Alphabet's cloud business has grown much slower than Amazon and Microsoft. I'm concerned the company will repeat this problem again with Bard, which is its version of a conversational artificial intelligence tool.\nLast but not least, I think Alphabet is facing a problem of cultural division. This was inevitable as the company grew its employee base. To be fair, most big tech companies will face this problem. But with Alphabet, the issue is particularly severe because it is more open than the other tech companies. Therefore, there are fewer rules governing employee behaviors, which makes it harder for management to reconcile differences.\nAlphabet's earnings release is disappointing, but not too bad. For long-term investors, the more concerning issue is its culture. Unless management takes dramatic action, the cultural issues are here to stay. Fortunately, Sundar Pichai has realized the culture issues and has taken steps to address them. It remains to be seen whether he can successfully tackle them in the future.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-09T07:19:30.000Z",
        "Title": "Alphabet Inc CEO Sundar Pichai Sells 22,500 Shares",
        "Author": "  GuruFocus Research ",
        "Text": "Sundar Pichai, CEO of Alphabet Inc (NASDAQ:GOOG), executed a sale of 22,500 shares in the company on February 7, 2024, according to a recent SEC Filing. Alphabet Inc is a global technology company that specializes in internet-related services and products, which include online advertising technologies, a search engine, cloud computing, software, and hardware.\nWarning! GuruFocus has detected 5 Warning Signs with BLBD.\nOver the past year, the insider has sold a total of 90,000 shares and has not made any purchases of the company's stock.\nThe insider transaction history for Alphabet Inc indicates a pattern of insider sales, with 51 insider sells recorded over the past year and no insider buys during the same period.\nOn the date of the insider's recent transaction, shares of Alphabet Inc were trading at $146.29, resulting in a market capitalization of $1,821,698.17 billion.\nThe company's price-earnings ratio stands at 25.38, which is above the industry median of 21.11 but below the historical median price-earnings ratio for Alphabet Inc.\nWith the current share price at $146.29 and the GuruFocus Value at $147.96, the price-to-GF-Value ratio is 0.99, indicating that the stock is Fairly Valued in relation to its GF Value.\nThe GF Value is calculated considering historical trading multiples, a GuruFocus adjustment factor based on the company's past performance, and future business performance estimates provided by Morningstar analysts.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-07T13:08:00.000Z",
        "Title": "Better Tech Stock: Meta Platforms vs. Alphabet",
        "Author": "  Leo Sun, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) headed in opposite directions after their latest earnings reports. Meta's stock soared 20% to an all-time high on Feb. 2, after the social media giant followed up its big fourth-quarter earnings beat with rosy guidance for the first quarter, a $50 billion boost to its buyback plan, and the initiation of its first-ever dividend. Alphabet's stock sank 8% on Jan. 31, even though its fourth-quarter numbers easily cleared analysts' expectations with double-digit growth across its core businesses.\nAs of this writing, Meta's stock has rallied more than 150% over the past 12 months. Alphabet's stock has rallied just over 30%. Let's see why the bulls rushed to Meta instead of Alphabet -- and if that trend will continue throughout the rest of 2024.\nMeta and Alphabet both generate most of their revenue from digital ads, but their business models are different. Meta is the world's largest social media company, and 3.98 billion people use at least one of its core apps -- Facebook, Messenger, Instagram, and WhatsApp -- every month. It sells its ads across all four platforms, as well as its Audience Network for third-party apps and websites. It's also producing augmented and virtual reality devices through its Reality Labs segment.\nAlphabet's Google owns the world's largest search engine, the top streaming video platform in YouTube, and the most popular mobile operating system in Android. It also owns the world's third largest cloud infrastructure platform, sells its own first-party hardware devices, and develops self-driving vehicles through its Waymo subsidiary.\nGoogle and Facebook controlled 39% and 18% of the global digital advertising market in terms of annual revenue, respectively, in 2023. But both companies face stiff competition from ByteDance's TikTok, which claimed 3% of the market and continues to lock in younger audiences with its short videos. To counter TikTok, Google has been beefing up YouTube Shorts, while Meta has been expanding its similar Reels across Facebook and Instagram.\nMeta and Alphabet generated 98% and 77% of their revenue, respectively, from digital ads in 2023. Both companies struggled with slower ad sales in 2022, as the macro headwinds drove more businesses to rein their ad spending.\nMeta also struggled with Apple's (NASDAQ: AAPL) privacy changes on iOS, which made it tougher to craft targeted ads from third-party data. Google wasn't as affected by the iOS update, because it mainly relied on first-party data and already paid Apple billions of dollars each year to remain the default search engine on iOS. But despite all of those challenges, Meta's ad revenue grew at a much faster rate than Google's over the past year.\nMetric\nQ4 2022\nQ1 2023\nQ2 2023\nQ3 2023\nQ4 2023\nMeta ad revenue growth (YOY)\n(4%)\n4%\n12%\n24%\n24%\nGoogle ad revenue growth (YOY)\n(4%)\n0%\n3%\n9%\n11%\nData source: Company earnings reports. YOY = Year over year.\nMeta outperformed Google for three reasons. First, Chinese e-commerce and gaming companies significantly ramped up their spending on Facebook and Instagram to reach more overseas users. Second, Meta countered Apple's changes by gathering more first-party data and upgrading its AI algorithms. Lastly, its higher ad impressions offset its lower ad prices.\nGoogle didn't seem to attract as much spending from those Chinese companies, and declining impressions across its sprawling ad network partly offset its rising impressions across its core search engine and YouTube. Google's growing dependence on ad-free subscriptions for YouTube and YouTube Music also suggested its advertising business was running out of steam. Meanwhile, Google's closely watched cloud business continued to grow at a slower rate than its larger rival, Microsoft (NASDAQ: MSFT) Azure, which implied it was falling behind in the cutthroat cloud and AI race.\nMeta's rising ad revenue, layoffs, and other cost-cutting measures boosted its operating margin from 25% in 2022 to 35% in 2023, even as it ramped up its spending in its unprofitable Reality Labs business. Alphabet also executed several rounds of layoffs, but its operating margin rose from 26% in 2022 to just 27% in 2023.\nAnalysts expect Meta's revenue and earnings to grow 12% and 18%, respectively, in 2024. Based on those estimates, which might need to be raised after Meta's latest earnings beat, its stock doesn't look particularly expensive at 28 times forward earnings. Its forward yield of 0.4% won't attract any serious investors, but it's a clear sign that it can continue to generate a stable profit while expanding its metaverse ecosystem.\nAnalysts expect Alphabet's revenue and earnings to rise 11% and 17%, respectively, in 2024. It doesn't pay a dividend yet, but its stock looks a bit cheaper at 21 times forward earnings. However, concerns about its advertising business and its ability to keep pace with Microsoft in the AI race could continue to compress its near-term valuations.\nIt's a close call, but I believe Meta will continue to outperform Alphabet this year as its advertising growth accelerates and it expands its operating margin. Its simpler business model could also make it more appealing for growth-oriented investors.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nRandi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Apple and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Apple, Meta Platforms, and Microsoft. The Motley Fool has a disclosure policy.\nBetter Tech Stock: Meta Platforms vs. Alphabet was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-11T12:00:12.000Z",
        "Title": "Should You Investigate Alphabet Inc. (NASDAQ:GOOGL) At US$149?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Today we're going to take a look at the well-established Alphabet Inc. (NASDAQ:GOOGL). The company's stock saw a double-digit share price rise of over 10% in the past couple of months on the NASDAQGS. The recent jump in the share price has meant that the company is trading around its 52-week high. As a large-cap stock with high coverage by analysts, you could assume any recent changes in the company’s outlook is already priced into the stock. But what if there is still an opportunity to buy? Let’s examine Alphabet’s valuation and outlook in more detail to determine if there’s still a bargain opportunity.\n View our latest analysis for Alphabet \nGood news, investors! Alphabet is still a bargain right now. Our valuation model shows that the intrinsic value for the stock is $213.56, but it is currently trading at US$149 on the share market, meaning that there is still an opportunity to buy now. Although, there may be another chance to buy again in the future. This is because Alphabet’s beta (a measure of share price volatility) is high, meaning its price movements will be exaggerated relative to the rest of the market. If the market is bearish, the company's shares will likely fall by more than the rest of the market, providing a prime buying opportunity.\nFuture outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Buying a great company with a robust outlook at a cheap price is always a good investment, so let’s also take a look at the company's future expectations. With profit expected to grow by 48% over the next couple of years, the future seems bright for Alphabet. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.\nAre you a shareholder? Since GOOGL is currently undervalued, it may be a great time to accumulate more of your holdings in the stock. With a positive outlook on the horizon, it seems like this growth has not yet been fully factored into the share price. However, there are also other factors such as capital structure to consider, which could explain the current undervaluation.\nAre you a potential investor? If you’ve been keeping an eye on GOOGL for a while, now might be the time to enter the stock. Its prosperous future outlook isn’t fully reflected in the current share price yet, which means it’s not too late to buy GOOGL. But before you make any investment decisions, consider other factors such as the strength of its balance sheet, in order to make a well-informed investment decision.\nDiving deeper into the forecasts for Alphabet mentioned earlier will help you understand how analysts view the stock going forward. At Simply Wall St, we have the analysts estimates which you can view by clicking here.\nIf you are no longer interested in Alphabet, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-01T15:45:00.000Z",
        "Title": "Alphabet is on Sale: Will Buffett Buy Shares?",
        "Author": "  Tracey Ryniec ",
        "Text": "(0:30) - Should You Buy More of The Magnificent 7?\n(8:00) - If Warren Buffett Buys Apple, Should You Buy Too?\n(32:00) - Episode Roundup: AAPL, GOOGL, BRK.B\n Podcast@Zacks.com\n \nWelcome to Episode #360 of the Value Investor Podcast.\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nThere is a lot of angst on Wall Street about the stocks of Apple (AAPL) and Alphabet (GOOGL) this year. Both are off record highs set earlier in the year and neither one is performing like NVIDIA, up triple digits.\nBerkshire Hathaway (BRK.B)owns Apple shares. Warren Buffett bought a big position in the company in 2016 and considers it one of the four lynchpins of Berkshire Hathaway’s business.\nBuffett loves it so much, he gushes about Apple at nearly every Berkshire Hathaway annual meeting.\nBerkshire Hathaway Bought Apple on the Cheap\nIt may be hard to believe today, but Apple was out of favor in 2016 when Buffett dove in. It traded with a forward P/E as low as 10.6 that year. Apple’s 2024 forward P/E is 28. No one is calling Apple a value stock in 2024.\nApple also had a cheap P/S ratio in 2016. The high that year was 2.8 and the low was 2.3. Currently, Apple trades with a P/S ratio of 7.3. It’s not over 10, which is considered expensive, but 7.3 is above the current average of the S&P 500 at 4.2.\nApple also had an attractive P/B ratio in 2016. It’s high was 4.7 and low was 3.9 that year. A P/B under 3.0 usually indicates value. Currently, Apple’s P/B ratio is a sky-high 38.\nCriteria for Buffett and Berkshire Hathaway to Buy a Stock\nBuffett loves companies with great free cash flow and Alphabet has doubled its free cash flow since 2019. In 2023, it had annual free cash flow of $69.5 billion, up from $30.9 billion in 2019.\nBuffett also likes companies that are doing share buybacks and Alphabet announced a $70 billion buyback in April 2023.\nDoes Alphabet have a moat? Berkshire Hathaway looks for companies with competitive advantages of a “moat.”\nAlphabet’s advertising revenue has been a moat over the last two decades, although some are questioning whether AI might eat into it. But Alphabet also has YouTube, which recently posted its best quarter for ad revenue ever.\nBuffett also likes companies with great management who have been in a place for years. Alphabet fits that bill.\nWill Buffett Buy Shares of Alphabet for the Berkshire Hathaway Stock Portfolio? \nTune into this week’s podcast for Tracey’s analysis of Alphabet’s valuation. The stock is on sale. But is it cheap enough for Buffett to dive in?\n[In full disclosure, Tracey owns shares of GOOGL in her personal portfolio.]\n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-16T16:15:00.000Z",
        "Title": "Alphabet Stock: The Gift That Keeps on Giving -- Or Is It?",
        "Author": "  Neil Rozenbaum, The Motley Fool ",
        "Text": "In this video, I will make the case for paying more attention to Google parent Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) despite all the recent OpenAI announcements such as Sora and a possible Google Search competitor.\n*Stock prices used were from the trading day of Feb. 15, 2024. The video was published on Feb. 16, 2024.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 12, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Neil Rozenbaum has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Neil is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\nAlphabet Stock: The Gift That Keeps on Giving -- Or Is It? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-01T14:48:49.000Z",
        "Title": "Alphabet Inc. (NASDAQ:GOOG) Q4 2023 Earnings Call Transcript",
        "Author": "  Insider Monkey Transcripts ",
        "Text": "Alphabet Inc. (NASDAQ:GOOG) Q4 2023 Earnings Call Transcript January 30, 2024\nAlphabet Inc. beats earnings expectations. Reported EPS is $1.64, expectations were $1.6.\nOperator: Welcome, everyone. Thank you for standing by for the Alphabet Fourth Quarter 2023 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. [Operator Instructions] I would now like to hand the conference over to your speaker today, Jim Friedland, Director of Investor Relations. Please go ahead.\nJim Friedland: Thank you. Good afternoon, everyone, and welcome to Alphabet's fourth quarter 2023 earnings conference call. With us today are Sundar Pichai, Philipp Schindler, and Ruth Porat. Now, I'll quickly cover the Safe Harbor. Some of the statements that we make today regarding our business, operations, and financial performance may be considered forward-looking. Such statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10-K and 10-Q, including the risk factors discussed in our upcoming Form 10-K filing for the year ended December 31, 2023. We undertake no obligation to update any forward-looking statement.\nDuring this call, we will present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyz/investor. Our comments will be on year-over-year comparisons unless we state otherwise. And now, I'll turn the call over to Sundar.\nSundar Pichai: Hello, everyone. Our results reflect strong momentum and product innovation continuing into 2024. Today, I'm going to talk about four main topics. One, our investments in AI, including how it's helping search. Two, subscriptions which reached $15 billion in annual revenue, up 5x since 2019. Subscriptions is growing strongly, powered by YouTube Premium and Music, YouTube TV and Google One. Three, Cloud which crossed $9 billion in revenues this quarter and saw accelerated growth driven by our Gen AI and product leadership. And four, our investments and focus to meet the growth opportunities ahead. First, AI and Search. As you know, we have long led the way in using AI to improve many of our products from search to ads, to most of our consumer and enterprise products, helping billions of people already.\nLast year brought new excitement around Gen AI and I'm proud of how we responded, responsibly with deep advances in foundation models and a number of great launches. We closed the year by launching the Gemini era, a new industry-leading series of models that will fuel the next generation of advances. Gemini is the first realization of the vision we had when we formed Google DeepMind, bringing together our two world-class research teams. It's engineered to understand and combine text, images, audio, video and code in a natively multimodal way and it can run on everything from mobile devices to data centers. Gemini gives us a great foundation. It's already demonstrating state-of-the-art capabilities and it's only going to get better. Gemini Ultra is coming soon.\nThe team is already working on the next versions and bringing it to our products. That starts with Search. We're already experimenting with Gemini in search where it's making our Search Generative Experience or SGE faster for users. We have seen a 40% reduction in latency in English in the U.S. I'm happy with what we are seeing in the earliest days of SGE, it's available through search labs in seven languages. By applying generative AI to Search, we are able to serve a wider range of information needs and answer new types of questions, including those that benefit from multiple perspectives. People are finding it particularly useful for more complex questions like comparisons or longer queries. It's also helpful in areas where people are looking for deeper understanding such as education or even gift ideas.\nWe are improving satisfaction including answers for more conversational and intricate queries. As I mentioned earlier, we are surfacing more links with SGE and linking to a wider range of sources on the results page and will continue to prioritize approaches that add value for our users and send valuable traffic to publishers. Beyond SGE, we are continuing to use AI to make searching more accessible and intuitive. Circle to Search, lets you search what you see on Android phones with a simple gesture without switching apps. It's available starting this week on Pixel 8 and Pixel 8 Pro and the new Samsung Galaxy S24 Series. And Lens now offers generative AI overviews. You can add text to a visual search to ask questions about anything you see and get AI-powered insights in the moment.\nIn addition to Search, we are also seeing a lot of interest in our AI-powered solutions for advertisers. That includes our new conversational experience that uses Gemini to accelerate the creation of search campaigns. Then there is Bard, our conversational AI tool that complements search. It's now powered by Gemini Pro and is much more capable at things like understanding, summarizing, reasoning, coding and planning. It's now in over 40 languages and over 230 countries around the world. Looking ahead, we'll be rolling out an even more advanced version for subscribers powered by Gemini Ultra. That's a good segue to subscriptions. As I said earlier, it's now a $15 billion business annually. YouTube is the key driver of our subscription revenues.\nAvailable in over 100 countries and regions, YouTube Music and Premium have real momentum. They're engaging passionate users and driving great returns for the music industry and creators. YouTube TV is also doing well. We've had great consumer feedback on the viewing experience. People love the navigation, multi view and unlimited DVR. NFL Sunday Ticket has found it’s perfect home on YouTube and Philipp will talk about that more. Let me also talk about our subscription service, Google One. It's doing incredibly well with strong user growth. It provides expanded storage, unlocks exclusive features in Google products and allows us to build a strong relationship with our most engaged users. Google One is growing very well and we are just about to cross 100 million subscribers.\nFrom here, we are going to bring in more AI features and look forward to more strong growth to come. Next, Google Cloud. Throughout 2023, we introduced thousands of product advances, including broad Gen AI capabilities across our AI infrastructure, our Vertex AI platform and our new Duvet AI agents. In Q4, our product and Gen AI leadership enabled us to win and expand relationships with many leading brands including Hugging Face, McDonald's, Motorola Mobility and Verizon. Google Cloud offers our AI Hypercomputer, a groundbreaking supercomputing architecture that combines our powerful TPUs and GPUs, AI software and multi-slice and multi-host technology to provide performance and cost advantages for training and serving models. Customers like Anthropic, Character AI, Essential AI and Mistral AI are building and serving models on it.\nFor developers building Gen AI applications, we offer Vertex AI, a comprehensive enterprise AI platform. It helps customers like Deutsche Telekom and Moody's discover, customize, augment and deploy over 130 Gen AI models, including PaLM, Med-PaLM, Sec-PaLM and Gemini, as well as popular open source and partner models. Vertex AI has seen strong adoption with the API request increasing nearly 6x from H1 to H2 last year. Using Vertex AI, Samsung recently announced its Galaxy S24 Series smartphone with Gemini and Imagen 2, our advanced text-to-image model. Shutterstock has added Imagen 2 to their AI image generator, enabling users to turn simple text prompts into unique visuals and Victoria's Secret & Company will look to personalize and improve the customer experience with Gemini, Vertex AI search and conversations.\nCustomers are increasingly choosing Duvet AI, our packaged AI agents for Google Workspace and Google Cloud Platform to boost productivity and improve their operations. Since its launch, thousands of companies and more than a million trusted testers have used Duvet AI. It will incorporate Gemini soon. In Workspace, Duvet AI is helping employees benefit from improved productivity and creativity at thousands of paying customers around the world, including Singapore Post, Uber and Woolworths. In Google Cloud Platform, Duvet AI assist software developers and cybersecurity analysis. Duvet AI for developers is the only Gen AI offering to support the company development and operations lifecycle, fine-tune with the customers’ own core corpus and policies.\nIt's helping Wayfair, GE Appliances and Commerzbank write better software, faster with AI code completion, code generation and chat support. With Duvet AI and security operations, we are helping cybersecurity teams at Fiserv, Spotify and Pfizer. Our robust growth has been driven by strong direct and indirect channels. With ISVs, we have nearly tripled the number of co-sell deals from 2022 to 2023. In our ecosystem, there are nearly 90,000 Google Cloud Gen AI-enabled consultants. And Accenture has teamed up with Google Cloud to create a joint generative AI center of excellence. Next, let me turn to our focus and discipline as we pursue the opportunities ahead. Search, YouTube and Cloud are supported by our state-of-the-art compute infrastructure.\nThis infrastructure is also key to realizing our big AI ambitions. It's a major differentiator for us. We continue to invest responsibly in our data centers and compute to support this new wave of growth in AI-powered services for us and for our customers. Through this, we are being disciplined in how we run the company. You've heard me talk about our efforts to durably reengineer our cost base and to improve our velocity and efficiency. That work continues. Teams are working to focus on key priorities and execute fast, removing layers and simplifying their organizational structures. As just one example, our devices team has brought together different teams from across Nest, Fitbit and other teams into a new functional structure. This will help us pull resources and drive progress across our Pixel portfolio.\nAcross different teams, we have wound down some non-priority projects, which will help us invest and operate well in our growth areas. We are also improving our machine utilization, building on our years of experience in driving cost efficiencies in our computing infrastructure and operations. And through our supplier efficiency efforts and automation of certain processes, we have made major improvements in areas like procurement, achieving significant savings. That's a snapshot of the quarter. Before I close, a couple of other highlights. Pixel 8, our AI-first phone, was awarded Phone of the Year by numerous outlets. It now uses Gemini Nano with features like Magic Compose for Google Messages and more to come. In our Other Bets portfolio of companies, Waymo, which is deeply focused on safety, reached over 1 million fully autonomous ride-hailing trips.\nAnd Isomorphic Labs entered into strategic partnerships with Eli Lilly and Novartis to apply AI to treat diseases, which has great potential. 2023 was a year of profound innovation and product momentum. Thank you to our many partners. We succeed when our partners do, and we are grateful for the work we do together, from our partners across the Android ecosystem who are on display at CES to our deep relationships with retailers, small businesses and advertising partners, to the next generation of AI start-ups and developers and many more. I also want to thank all of our employees for their hard work throughout 2023 and the start of the new year. I'm excited for what's ahead in 2024. Philipp?\nPhilipp Schindler: Thanks, Sundar, and hi, everyone. Google Services revenues of $76 billion were up 12% year-on-year. In Google advertising, Search and other revenues grew 13% year-on-year, led again by solid growth in the retail vertical. We had particular strength in retail in APAC, a trend that began in the second quarter of 2023 and continued through the end of the year. YouTube ads revenue were up 16% year-on-year, driven by growth in both direct response and brand. And network revenues declined 2% year-on-year. In Subscriptions, Platforms and Devices, which was previously named Google Other, year-on-year revenues increased 23% driven by strong growth in subscriptions. Now for some color on the quarter and where we see continued upside for long-term advertising growth.\nOver the last few calls, I have consistently highlighted how we're putting Google AI to work for our customers to deliver profitability and help them achieve their goals in a do-more-with-less environment. From a product perspective, in Q4, Performance Max remained a bright spot. We're also excited about [demand gen] momentum. This is our big bet to help social advertisers find and convert consumers via immersive, relevant visual creatives across YouTube, including YouTube Shorts, Gmail and Discover. In a single campaign, you get access to over three billion users as they stream, scroll, connect and decide what to buy. Tens of thousands of advertisers are testing and on average seeing 6% more conversions per dollar versus image-only ads and discovery campaigns.\nAs we look ahead, we're also starting to put generative AI in the hands of more and more businesses to help them build better campaigns and even better performing ads. Automatically created assets help advertisers show more relevant search ads by creating tailored headlines and descriptions based on each ads’ context. Adoption was up with strong feedback in Q4. In addition to now being available in eight languages, more advanced Gen AI-powered capabilities are coming to ACA. And then last week's big news was that Gemini will power a new conversational experience in Google Ads. This is open in beta to U.S. and UK advertisers. Early tests show advertisers are building higher-quality search campaigns with less effort, especially SMBs who are 42% more likely to publish a campaign with good or excellent ad strength.\nWe can't wait to see how this continues to drive performance and level the playing field for advertisers of all sizes. As we shared last quarter, ads will continue to play an important role in the new search experience, and we'll continue to experiment with new formats native to SGE. SGE is creating new opportunities for us to improve commercial journeys for people by showing relevant ads alongside search results. We've also found that people are finding ads either above or below the AI-powered overview helpful as they provide useful options for people to take action and connect with businesses. Looking at our strong Search performance for the fourth quarter. Retail was a highlight. We continue to see a stronger start to the season up to and including Cyber Five.\nIn Q3, we indicated that we were seeing early trends of consumers being very price-conscious, and we saw this play out in Q4. With promotional demand at an all-time high, deal seekers using Google had access to 2x the deals in the U.S. versus last season as well as a better shopping experience. Launches included a one-stop shop deals destination, new filters like GetItFast and AI-generated gifting recommendations in SGE. These new features drove incremental query growth during key shopping moments like Cyber Five. Our proven AI-powered ad solutions were also a win for retailers looking to accelerate omni growth and capture holiday demand. Quick examples include a large U.S. big-box retailer who drove a 60%-plus increase in omni ROAS and a 22%-plus increase in store traffic using Performance Max during Cyber-Five; and a well-known global fashion brand, who drove a 15%-plus higher omnichannel conversion rate versus regular shopping traffic by showcasing its store pickup offering across top markets through pickup later on shopping ads.\nMoving on to YouTube. We're obviously pleased with YouTube's advertising revenue growth in Q4 and also significant growth in our subscription revenue. I'll reiterate what I have said before. YouTube success starts with creator success. We give millions of creators more ways to create content and connect with fans and more ways to make money and build their own businesses than any other platform. More creators means more content, which leads to more viewers. And via ads and subscriptions, these viewers fund our creators and drive the eyeballs and engagement our advertisers want. To keep this momentum going, we're focused on delivering value across four pillars: creation, viewers, monetization and responsibility. First, creation, which increasingly takes place on mobile devices.\nWe've invested in a full suite of tools, including our new YouTube Create app for Shorts, to help people make everything from 15-second Shorts to 15-minute videos to 15-hour live streams with a production studio in the palm of their hands. Gen AI is supercharging these capabilities. Anyone with a phone can swap in a new backdrop, remove background extras, translate their video into dozens of languages, all without a big studio budget. We're excited about our first products in this area from Dream Screen for AI-generated backgrounds to allowed for AI-powered dubbing. There is more to come. Number two, viewers. We continue to grow watch time across YouTube with strong growth in Shorts and Connected TV. Shorts remains a top priority. We have 2 billion-plus logged-in users every month, and we are averaging 70 billion in daily views.\nConnected TVs or what we refer to as the living room is where viewership is growing the fastest. We're investing to make this experience even better with interactive features tailored to TVs, plus the content people love: our creators, NFL Sunday Ticket and the range of live sports and studio content via YouTube TV and Primetime Channels. Put this all together, and YouTube is the must-have app on every Connected TV. Monetization is pillar number three and realized through a combination of ad-supported and subscription offerings. Advertising generates the bulk of our revenue, and we continue to invest heavily here. We've rolled out CTV-first formats like 30-second non-skippable ads and pause experiences as well as an industry-first send-to-phone experience that lets people use a second screen to engage with ads.\nFor Shorts, we've developed new formats that are less interruptive to viewers. It's early. We're learning but excited by the opportunities for ads this can unlock. Shorts monetization continues to progress nicely. Our AI part video format from video reach and video view campaigns to demand gen and video action continue to make advertiser dollars go further and drive results across the funnel. We're also introducing new and existing advertisers to YouTube via sports content. 90-plus upfront and scatter advertisers, including Unilever, are partnering with YouTube in our first year across NFL Sunday Ticket in-game advertising opportunities. Our subscription offerings are also growing at a healthy clip. YouTube Music and Premium performed well.\nPremium users are delivering more value to our partners and YouTube than even ad-supported users do. On average, each additional Premium sign-up boost earnings for creators, music and media partners and YouTube itself. And we've made Premium even more attractive with new features, bundles and other enhancements. We're also pleased with our first season of NFL Sunday Ticket. It gave creators new opportunities to create content and feed user engagement across traditional user content and professional sports content. Feedback on the user experience, including MultiView, has been great. We're excited to continue to innovate here. Responsibility is our fourth pillar, and it underlines everything we do across YouTube. We continue to focus relentlessly on this.\nAs always, deepening our relationships with key partners to bring them the best of Google is a key priority for us, and we continue to do this across industries in Q4. We just talked about the NFL. Sundar mentioned Samsung, among others earlier. Another highlight was our expanded partnership with Porsche to enhance customers' digital experiences with a deeper in-vehicle integration of Google built-in services, including Google Maps and Play. Whether it's continued collaboration with our partners and key ecosystems, we're putting Google AI to work for more customers. I'm excited about the opportunities for continued impact in 2024. I'll wrap with a huge note of gratitude to our customers and partners. Our success is only possible because of their success and then to our Googlers for their outstanding work and focus this year.\nRuth, over to you.\nRuth Porat: Thank you, Philipp. We are very pleased with our full year results with 2023 Alphabet revenues of $307 billion, up 9% versus 2022, which added $25 billion to revenues for the year. We ended with a strong fourth quarter with consolidated revenues of $86.3 billion, up 13% versus last year in both reported and constant currency. Search remained the largest contributor to revenue growth. My comments will be on year-over-year comparisons for the fourth quarter, unless I state otherwise. Total cost of revenues was $37.6 billion, up 6%. Other cost of revenues was $23.6 billion, up 5%, with the increase driven primarily by content acquisition costs associated with YouTube subscription offerings. The growth rate also reflects the offsetting benefit of lapping $1.2 billion in inventory-related charges that we called out in the fourth quarter last year as well as a reduction in depreciation expense due to changes in estimated useful lives we made starting in the first quarter of 2023.\nIn terms of total expenses, the year-on-year comparisons reflect an additional $1.2 billion in exit charges that we took in the fourth quarter of 2023 in connection with actions to optimize our global office space. As you can see in our earnings release, these charges were allocated across the expense lines in other cost of revenues and OpEx based on associated headcount. Operating expenses were $25 billion, up 11%, primarily reflecting an increase in R&D expenses, which were driven by the real estate charges, followed by compensation. Operating income was $23.7 billion, up 30%, and our operating margin was 27%. Net income was $20.7 billion, and EPS was $1.64. We delivered free cash flow of $7.9 billion, which was affected by the timing of the $10.5 billion tax payment we made on October 16 that we called out previously related to the deferral of certain tax payments to the fourth quarter.\nFor the full-year 2023, free cash flow was $69 billion. We repurchased a total of $62 billion of our Class A and Class C shares in 2023 and ended the year with $111 billion in cash and marketable securities. Turning to segment results. Within Google Services, revenues were $76.3 billion, up 12%. Google Search and other advertising revenues of $48 billion in the quarter were up 13%, led again by growth in retail. YouTube advertising revenues of $9.2 billion were up 16% driven by both direct response and brand advertising. Network advertising revenues of $8.3 billion were down 2%. Subscriptions, Platforms and Devices revenues, which we previously referred to as other revenues, were $10.8 billion, up 23%, primarily reflecting growth in YouTube subscription revenues.\nTAC was $14 billion, up 8%. Google Services operating income was $26.7 billion, up 32%, and the operating margin was 35%. Turning to the Google Cloud segment. Revenues were $9.2 billion for the quarter, up 26%. We're very pleased with the momentum of GCP with an increasing contribution from AI. Google Workspace also delivered strong revenue growth, primarily driven by increases in average revenue per seat. Google Cloud delivered operating income of $864 million and an operating margin of 9%. As to our Other Bets, for the full-year 2023, revenues were $1.5 billion, and the operating loss was $4.1 billion. Results in the fourth quarter benefited from a milestone payment in one of the Other Bets. Turning to our outlook for the business. With respect to Google Services, first, within advertising.\nWe were pleased with the sequential revenue growth of Search and YouTube advertising throughout 2023, which reflects the extraordinary work across our teams to drive improved experiences for users and attractive ROI for advertisers. As we enter 2024 with advertising revenues of more than $100 billion higher than 2019, we remain focused on sustaining healthy growth on this larger base. Second, within Subscriptions, Platforms and Devices, our total revenues from subscription products reached $15 billion for the full-year 2023, driven primarily by substantial growth in subscribers for our YouTube subscription offerings. The substantial increase in our subscription revenues over the past few years demonstrates the ability of our teams to deliver high value-add offerings and provides a strong base on which to build, including through YouTube and newer services like Google One.\nPlay had solid growth again in the fourth quarter, driven primarily by an increase in the number of buyers. In Devices, we continue to make sizable investments with increased emphasis on our Pixel family, particularly with AI-powered innovation while driving further efficiencies across the portfolio. Turning to Google Cloud. We are pleased with operating performance in the year. Full year revenues of $33 billion were up 26% versus prior year, ending with strong Q4 performance. The Cloud team is intensely focused on bringing the benefits of Gemini, our industry-leading AI technology, to enterprises and governments globally, and we are gratified with the level of engagement. The strong demand we are seeing for our vertically integrated AI portfolio is creating new opportunities for Google Cloud across every product area.\nIn terms of profitability, the improvement in 2023 reflects sustained focus across the team with the intent to maintain healthy profitability while we continue to invest to support long-term growth. Turning to margins and expenses. As we have repeatedly stressed, we remain committed to our framework to durably reengineer our cost base as we invest to support our growth priorities. Key contributors to moderating our expense growth include: first, product and process prioritization to ensure we have the right resources behind our most important opportunities and to reallocate resources where we can; second, organizational efficiency and structure. We're focused on removing layers to simplify execution and drive velocity. Both product prioritization and the organization design efforts result in a slower pace of hiring, as you can see with our headcount down year-on-year, reflecting the reductions we announced in the first quarter of 2023 and a much slower pace of hiring.\nWe will continue to invest in top technical and engineering talent. Finally, we continue to execute the other work streams to slow expense growth, including improving efficiency in our technical infrastructure, streamlining operations across Alphabet through the use of AI, increasing efficiency of our spend with suppliers and vendors through our central procurement organization, and optimizing our real estate portfolio. With respect to CapEx, our reported CapEx in the fourth quarter was $11 billion, driven overwhelmingly by investment in our technical infrastructure with the largest component for servers followed by data centers. The step-up in CapEx in Q4 reflects our outlook for the extraordinary applications of AI to deliver for users, advertisers, developers, cloud enterprise customers and governments globally and the long-term growth opportunities that offers.\nIn 2024, we expect investment in CapEx will be notably larger than in 2023. With regard to Other Bets, we've been working to sharpen our investment focus while capturing the upside given compelling technology breakthroughs across the portfolio. For example, last week, Alphabet's X announced that it would be moving to spin out more projects as independent companies through external capital, giving X the opportunity to bring more focus to the breakthrough technologies it is working on to address some of the world's most pressing challenges. Thank you. Sundar, Philipp and I will now take your questions.\nSee also 15 Cheapest Countries to Get Permanent Residency Heading into 2024 and Here is How Billionaire Chris Hohn’s Hedge Fund Beat the Market with 33% Gain.\nTo continue reading the Q&A session, please click here.\n"
    },
    {
        "Date": "2024-02-15T17:28:01.000Z",
        "Title": "Amazon, Alphabet, and Nvidia attract new interest from Wall Street's biggest investors",
        "Author": " David Hollerith    · Senior Reporter",
        "Text": "Some of Wall Street’s biggest investors made new bets on technology giants in the fourth quarter, loading up on stakes in Amazon (AMZN), Alphabet (GOOG, GOOGL), Alibaba (BABA), and Nvidia (NVDA).\nWarren Buffett’s Berkshire Hathaway (BRK), however, did not. The conglomerate trimmed its holdings in Apple (AAPL) and HP (HPE) while adding to its stakes in oil giants Chevron (CVX) and Occidental Petroleum (OXY). There was at least one additional investment Berkshire kept confidential for now.\nThe details about these new bets made in the fourth quarter emerged this week in a series of filings to the Securities and Exchange Commission. Large institutional investors are required to make these disclosures on a quarterly basis, showing what they bought and sold.\nWhat the latest batch showed is that many piled into tech names at the end of 2023.\nA hedge fund run by Michael Burry — who famously shorted subprime mortgages during the 2008 financial crisis and became a central figure in Michael Lewis’s 2010 book \"The Big Short\" — added 35,000 shares of Alphabet and 30,000 shares of Amazon. That fund, Scion Capital, also boosted bets on Chinese e-commerce giants Alibaba and JD.com.\nMany hedge funds also gravitated to the stock of Nvidia, the dominant artificial intelligence chipmaker.\nBridgewater Associates, the world’s biggest hedge fund firm, increased its stake in Nvidia by 458% as it added more than 220,000 shares.\nIt also increased its position in Alphabet by more than 465,000 shares, making it the fund’s 12th-largest position as of the end of December, and added a small stake in Apple.\nAnother hedge fund, AQR, increased its stake in Nvidia by 22%. But it trimmed its holdings in Apple and Microsoft, its two largest positions, by 5% and 4%, respectively.\nBerkshire sold just 1% of its holdings in Apple, or 10 million shares, leaving it with a huge stake of more than 950 million shares.\nApple has had a rough start to 2024 as it juggled downgrades to its stock price, major changes to its App Store policies, and a potential antitrust lawsuit that could target large swaths of its business. These challenges mounted as it launched the ambitious Vision Pro headset.\nOne other notable investor pared back its exposure to Apple in the fourth quarter: the Soros Fund.\nThe outfit started by billionaire investor George Soros and now run by his son closed out a short position and zeroed out of its underlying holdings in the tech giant.\nSome of these same investors made some notable bets on the banking industry, especially a regional lender that is currently under a lot of scrutiny: New York Community Bank (NYCB).\nThe Soros Fund, AQR, and Millennium Management all increased their exposure to NYCB, which surprised Wall Street on Jan. 31 by slashing its dividend and reporting a net quarterly loss of $252 million.\nIt is not known what these funds did with their stakes between the end of the fourth quarter and now.\nCorrection: A previous version of this story misnamed Millennium Management. We regret the error.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\nRead the latest financial and business news from Yahoo Finance\n"
    },
    {
        "Date": "2024-02-28T22:45:18.000Z",
        "Title": "Alphabet Inc. (GOOG) Suffers a Larger Drop Than the General Market: Key Insights",
        "Author": "  Zacks Equity Research ",
        "Text": "The most recent trading session ended with Alphabet Inc. (GOOG) standing at $137.43, reflecting a -1.91% shift from the previouse trading day's closing. This move lagged the S&P 500's daily loss of 0.17%. Elsewhere, the Dow lost 0.06%, while the tech-heavy Nasdaq lost 0.55%.\nThe company's shares have seen a decrease of 8.46% over the last month, not keeping up with the Computer and Technology sector's gain of 2.65% and the S&P 500's gain of 3.98%.\nInvestors will be eagerly watching for the performance of Alphabet Inc. in its upcoming earnings disclosure. The company is predicted to post an EPS of $1.49, indicating a 27.35% growth compared to the equivalent quarter last year. Meanwhile, our latest consensus estimate is calling for revenue of $65.95 billion, up 13.58% from the prior-year quarter.\nIn terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $6.78 per share and a revenue of $286.52 billion, indicating changes of +16.9% and +11.7%, respectively, from the former year.\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Alphabet Inc. These revisions help to show the ever-changing nature of near-term business trends. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 1.57% higher. Right now, Alphabet Inc. possesses a Zacks Rank of #3 (Hold).\nLooking at valuation, Alphabet Inc. is presently trading at a Forward P/E ratio of 20.68. This signifies a discount in comparison to the average Forward P/E of 27.08 for its industry.\nIt is also worth noting that GOOG currently has a PEG ratio of 1.29. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Internet - Services industry currently had an average PEG ratio of 2.18 as of yesterday's close.\nThe Internet - Services industry is part of the Computer and Technology sector. This industry, currently bearing a Zacks Industry Rank of 101, finds itself in the top 41% echelons of all 250+ industries.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-13T21:23:20.000Z",
        "Title": "Nvidia market cap threatens Alphabet after overtaking Amazon",
        "Author": "  Noel Randewich ",
        "Text": "By Noel Randewich\n(Reuters) - Nvidia was on the verge of overtaking Alphabet as Wall Street's third most valuable company on Tuesday as the dominant AI chipmaker ended the day with a market capitalization above Amazon's for the first time in two decades.\nNvidia's shares slipped 0.17%, leaving its stock market value at $1.78 trillion, eclipsing Amazon's $1.75 trillion value after the online shopping and cloud-computing heavyweight's stock declined 2.15%.\nGoogle-owner Alphabet's stock dipped 1.62%, leaving its market capitalization at $1.81 trillion.\nNvidia has been a top beneficiary of technology companies' race to build AI into their products and services, with its graphics processors in short supply as Meta Platforms and other Big Tech companies buy billions of dollars worth of its components.\nMizuho in a client note raised its price target for Nvidia's stock to $825 from $625 ahead of the Santa Clara, California, company's quarterly results due on Feb. 21. The stock ended Tuesday at $721.28.\nLead times for Nvidia's top-shelf H100 processor have declined, \"but overall demand far outstrips supply,\" Mizuho analyst Vijay Rakesh wrote, adding he sees \"substantial AI upside\" for Nvidia, Broadcom and Advanced Micro Devices.\nNvidia controls about 80% of the high-end AI chip market, a position that has sent its stock up 46% this year after more than tripling in 2023. Technology-related companies, including Microsoft and Meta, have also rallied to record highs on AI optimism.\nAlphabet has put chatbot technology into its Google search engine while marketing generative AI tools to cloud customers. Its stock hit an all-time high a day before its quarterly report on Jan. 30 failed to meet investors' high expectations and sent its shares tumbling. Alphabet's stock remains up 4% in 2024.\nNvidia's market capitalization briefly overtook Amazon's on Monday, but Amazon was back on top by the end of that trading session.\nThe previous time Nvidia was more valuable than Amazon was in 2002, when they were each worth under $6 billion. By mid-2004, Nvidia's stock market value had tumbled to under $2 billion as Alphabet listed its shares at a valuation of $23 billion.\nAn early leader in the AI race, Microsoft in January overtook Apple to become the world's most valuable company, now valued at over $3 trillion. State oil giant Saudi Aramco is the world's third most valuable publicly listed company, according to LSEG.\nWidely viewed as lagging in the AI race, Apple's stock has dropped 4% in 2024.\nSaudi Aramco has a $2 trillion market capitalization, although over 90% of it is closely held by the government of Saudi Arabia and less than 2% of its shares are available for trading by investors.\n(Reporting by Noel Randewich; editing by Jonathan Oatis)\n"
    },
    {
        "Date": "2024-02-22T09:05:00.000Z",
        "Title": "The Zacks Analyst Blog Highlights Alphabet, Bank of America, Advanced Micro Devices, Danaher and TJX",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – February 22, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Alphabet Inc. GOOGL, Bank of America Corp. BAC, Advanced Micro Devices, Inc. AMD, Danaher Corp. DHR and The TJX Companies, Inc. TJX.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Alphabet Inc., Bank of America Corp. and Advanced Micro Devices, Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Alphabet have gained +9.3% over the past six months against the Zacks Internet - Services industry’s gain of +12.4%. The company’s strong cloud division is aiding substantial revenue growth. Moreover, expanding data centers will continue to bolster its presence in the cloud space.Further, major updates in its search segment are enhancing the search results. Also, strong focus on innovation of AI techniques and the home automation space should aid business growth in the long term. Further, its deepening focus on the wearables category remains a tailwind.Alphabet’s expanding presence in the autonomous driving space is contributing well. Its growing efforts to gain a foothold in the healthcare industry are other positives. However, sluggishness in the company’s Network advertisement business remains a headwind. Additionally, its growing litigation issues and increasing expenses are concerns.(You can read the full research report on Alphabet here >>>)Bank of America’s shares have gained +21.4% over the past six months against the Zacks Banks - Major Regional industry’s gain of +24.6%. Higher interest rates and decent loan demand will keep supporting the company’s net interest income (NII) growth in the upcoming quarters. The opening of financial centers and improving digital capabilities is expected to further support the top line.Yet, the current tough macroeconomic environment will continue to weigh on the company’s investment banking (IB) business. This, along with the volatile nature of the capital markets, will likely hurt fee income. Due to inflationary pressure, overall costs are expected to remain elevated.(You can read the full research report on Bank of America here >>>)Shares of AMD have outperformed the Zacks Electronics - Semiconductors industry over the past six months (+56.8% vs. +49.5%). The company is benefiting from portfolio strength and an expanding partner base. Strong demand for EPYC processors has been a growth driver.\nThe launch of the Ryzen 8040 series processor with Ryzen AI and Instinct MI300 Series data center AI accelerators bodes well for top-line growth. AMD continues to benefit from acquisitions, including Xilinx and Pensando, which has diversified its business. For fourth-quarter 2023, AMD expects to witness year-over-year growth in the Data Center and Client segments by double-digit percentage.Sequentially, the Data Center segment’s revenues are expected to grow on a double-digit percentage, while Client is expected to increase. However, weakness in the Gaming and Embedded segment revenues are expected to hurt top-line growth.(You can read the full research report on AMD here >>>)Other noteworthy reports we are featuring today are Danaher Corp. and The TJX Companies, Inc.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThe TJX Companies, Inc. (TJX) : Free Stock Analysis Report\nDanaher Corporation (DHR) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-22T14:00:00.000Z",
        "Title": "Alphabet's Verily Founder Andy Conrad Departs for VC Firm S32",
        "Author": "  Julia Love ",
        "Text": "(Bloomberg) -- Andy Conrad, the founder of Alphabet Inc.’s life sciences unit Verily, has joined venture capital firm S32 as a general partner as the firm seeks to deepen its investments in the booming field of artificial intelligence.\nMost Read from Bloomberg\nNvidia Rises Most in About Nine Months as AI Drives Sales\nBiden Touts $1.2 Billion in Student Loan Relief With Eye to 2024\nStocks Around the World Are Swept Up in AI Rally: Markets Wrap\nShe Was Set to Break Goldman’s Glass Ceiling. Now Beth Hammack Is Leaving\nWhy Are There Suddenly So Many Car Washes?\nConrad is best known in Silicon Valley for launching Verily, which captured the public imagination with efforts to develop glucose-detecting contact lenses and has in recent years focused more on its bottom line. He stepped down as executive chairman of Verily earlier this month but remains an adviser to Alphabet, a spokesperson for S32 said.\nThe venture firm, which announced Conrad’s appointment on Thursday, was founded by veteran Google executive Bill Maris. Conrad said he was drawn to S32 by the opportunity to work with Maris, a friend of more than 25 years, and to help startups as they begin packaging pioneering AI tools as products for corporate clients.\n“Helping entrepreneurs transition from the theoretical components of computer science to the practical ones is a very, very interesting and challenging thing,” Conrad said in an interview. “I really do think there’s a new dawn. And it’s time to get the practical things addressed about the role of machine learning and the role of generative AI and AI in general.”\nHaving made investments in AI startups such as Cohere and BigHat Biosciences, S32 is focused on helping AI companies find the talent they need to sell their tools to major enterprises, said S32 Chief Executive Officer Andy Harrison, who is also a veteran of Alphabet and Verily.\n“Now we’re really in the product phase of AI,” Harrison said in an interview. For AI startups to do business with big companies and generate a return on the investment, “we need to start to build out full teams of product, operational, business and technical people,” he said.\nMost Read from Bloomberg Businessweek\nA24’s Risky Hollywood Moment\nPlug-In Hybrids Are Booming in the World’s Biggest EV Market\nHow Bad Movie Dubbing Led to the Fake Biden Campaign Robocalls\nUS Citizens Become Collateral Damage in Global Sanctions Fight\nHow Capital One’s $35 Billion Discover Merger Could Affect Consumers\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-02-01T21:31:00.000Z",
        "Title": "What Awaits Alphabet-Heavy ETFs After Disappointing Q4 Earnings?",
        "Author": "  Yashwardhan Jain ",
        "Text": "Alphabet GOOGL reported its fourth-quarter 2023 earnings results on Jan 30 after market close. The tech giant reported earnings of $1.64 per share, beating the Zacks Consensus Estimates of $1.60 by 2.5%. GOOGL has a Zacks Growth Score of A.\nAlphabet posted revenues of $86.31 billion for the quarter ended December 2023, increasing at the most rapid expansion rate of 13% year over year since the beginning of 2022. GOOGL, which belongs to the Zacks Internet - Services industry, surpassed the Zacks Consensus Estimate for revenues of $70.77 billion, reflecting a 21.96% positive surprise.\nNet income of $20.69 billion surged 51.9% from the year-ago quarter. Operating profit also rose 3% year over year, reaching 27%.\nAdvertisement revenues for the company increased about 10.97% year over year, reaching $65.52 billion in the fourth quarter, but trailed analyst estimates, according to CNBC. The disappointing ad revenues indicate rising competition for ad budgets from alternative online platforms.\nAccording to Thomas Monteiro, an analyst at Investing.com, as quoted on Reuters, the tech giant’s sluggish ad revenues are indicative of the uncertainty regarding the pace of interest rate cuts by global central banks.\nThe earnings results have a huge impact on ETFs heavily invested in this Internet giant, with shares of GOOGL falling 5.78% after market hours, following its fourth-quarter earnings results. Here, we have highlighted four ETFs with double-digit exposure to Alphabet and look at how the funds have performed since earnings were reported.\nIShares Global Comm Services ETF seeks to track the performance of the S&P Global 1200Communication Services 4.5/22.5/45 Capped Index, with a basket of 65 securities. The fund has an asset base of $254.5 million and charges an annual fee of 0.42%.\nIShares Global Comm Services ETF has an exposure of 12.75% in GOOGL. The fund has around 73.40% of its assets invested in the United States and 7.41% in Japan.\nCommunication Services Select Sector SPDR Fund seeks to track the performance of the Communication Services Select Sector Index, with a basket of 22 securities. The fund has gathered an asset base of $17.07 billion and charges an annual fee of 0.10%.\nCommunication Services Select Sector SPDR Fund has an exposure of 12.64% in GOOGL. The fund has invested around 96.13% in large-cap securities.\nFidelity MSCI Communication Services Index ETF seeks to track the performance of the MSCI USA IMI Communication Services 25/50 Index, with a basket of 108 securities. The fund has amassed an asset base of $945.3 million and charges an annual fee of 0.08%.\nFidelity MSCI Communication Services Index ETF has an exposure of 12.57% in GOOGL. The fund has invested around 86.01% in large-cap securities.\nVanguard Communication Services ETF seeks to track the performance of the MSCI US Investable Market Communication Services 25/50 Index, with a basket of 118 securities. The fund has gathered an asset base of $3.74 billion and charges an annual fee of 0.10%.\nVanguard Communication Services ETF has an exposure of 12.23% in GOOGL. The fund has invested around 49.68% in the technology sector, followed by 27.51% in consumer discretionary and 22.66% in telecommunications.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVanguard Communication Services ETF (VOX): ETF Research Reports\nFidelity MSCI Communication Services Index ETF (FCOM): ETF Research Reports\niShares Global Comm Services ETF (IXP): ETF Research Reports\nCommunication Services Select Sector SPDR ETF (XLC): ETF Research Reports\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-16T14:35:00.000Z",
        "Title": "Alphabet (GOOGL) Boosts YouTube TV With Shortcut Feature",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL Google recently rolled out the “Last Channel Shortcut” feature for YouTube TV users.Notably, the shortcut feature enables users to easily switch between their last-viewed channels, allowing them to do so without interacting with the on-screen UI.Further, the feature pops up with a small animation and a message and can be accessed by long-pressing the \"Select\" or \"OK\" button on their remote. It works across live, on-demand and DVR content.The company also partnered with Roku ROKU to bring this feature to all Roku devices.Alphabet is likely to expand its YouTube TV subscriber base on the back of its latest move.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nApart from the “Last Channel Shortcut” feature, Alphabet introduced the \"Build a Multiview\" feature for YouTube TV, allowing users to create their own combos with up to four pre-selected games, exclusively for subscribers with NBA League Pass and can be accessed from the Home tab.The company also extended its Roku partnership to bring a clock icon in the live guide of all Roku devices. The clock is a convenient addition that was commonplace among traditional TV services.Alphabet also launched a new Channel Guide for YouTube TV, aligning with Google TV's Live tab. The new feature enables users to view free built-in channels from the Live tab, allowing them to inject their favorite channels into the page.Further, Google, via YouTube TV, recently partnered with Peloton Interactive’s PTON streaming service platform, Peloton Entertainment, in a bid to expand its subscriber base.Per the terms of the partnership, Peloton All-Access members can stream their favorite television content from their Peloton Bike, Peloton Row or Peloton Tread. It would also require Peloton All-Access members to have a YouTube TV subscription.All the above-mentioned endeavors will likely strengthen the company’s footing in the global video streaming space, presenting a significant growth opportunity for Alphabet.Per a Fortune Business Insights report, the video streaming market is expected to reach $1.9 trillion by 2030, indicating a CAGR of 19.3% between 2023 and 2030.Moreover, growing momentum in YouTube TV will aid Alphabet in competing well with industry peers like Disney DIS, which is also making concerted efforts to capitalize on the growth opportunities in the video streaming space.Disney is riding on the success of its streaming service business, Hulu.Notably, the company’s Hulu Plus Live TV offers East and West Coast feeds for various channels, allowing viewers in the West to watch with their friends in the East.Recently, Hulu partnered with Fox News to bring Fox Weather on Hulu Plus Live TV, expanding the Live TV platform’s 95-channel core lineup.\nGrowing YouTube TV efforts will likely aid this Zacks Rank #3 (Hold) company to bolster its Google Services segment, which remains the key growth driver for the company. Its shares have rallied 51.3% in the past year compared with the Zacks Computer & Technology sector’s growth of 48%.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.In the fourth quarter of 2023, Google Services revenues increased 12.5% year over year to $76.31 billion, accounting for 88.4% of total revenues.The strengthening Google Services segment will likely bolster the company’s overall top-line performance in the near term.The Zacks Consensus Estimate for first-quarter 2024 revenues is pegged at $65.88 billion, indicating growth of 13.5% year over year.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Walt Disney Company (DIS) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nRoku, Inc. (ROKU) : Free Stock Analysis Report\nPeloton Interactive, Inc. (PTON) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-06T17:00:00.000Z",
        "Title": "Alphabet’s Verily Hires Health Veteran as Chief Product Officer",
        "Author": "  Julia Love ",
        "Text": "(Bloomberg) -- Verily, Alphabet Inc.’s life sciences unit, hired veteran health technology executive Myoung Cha as chief product officer to help lead strategy as the company ramps up efforts to expand its business.\nMost Read from Bloomberg\nPentagon Chief Austin in Critical Care Unit at Walter Reed\nTrump’s NATO Remark Sparks Political Storm in World Capitals\nGermany’s Days as an Industrial Superpower Are Coming to an End\nTop Nigerian Banker Killed in California Helicopter Crash\nCha previously served as president and chief strategy officer at startup Carbon Health Technologies Inc. and also worked on health efforts at Apple Inc., Verily said Tuesday in a statement.\n“Myoung is a distinguished product leader whose proven ability to leverage integrated hardware, software, and clinical care supports our vision for driving precision health,” Verily Chief Executive Officer Stephen Gillett said in a statement. “His experience working and collaborating with some of the most esteemed companies in the health care sector will be a tremendous asset to Verily in our next phase of growth.”\nVerily, which captured the public imagination with efforts to develop glucose-detecting contact lenses, has in recent years focused more on its bottom line. In 2022, Verily raised $1 billion in new investments led by its parent company, Alphabet, and appointed Gillett as CEO, who succeeded founder Andy Conrad.\nOver a long career in health tech, Cha led development of applications for the Apple Watch and worked with Google on efforts to notify people of exposure to Covid-19.\n“What excites me about Verily is the unique opportunity we have to advance precision health with the company’s diverse combination of talent, technology, and capabilities,” Cha said in the statement.\nPreviously known as Google Life Sciences, Verily was a division of secretive technology lab X until it broke away as an independent subsidiary of Alphabet in 2015.\nMost Read from Bloomberg Businessweek\nOpenAI’s Secret Weapon Is Sam Altman’s 33-Year-Old Lieutenant\nIt’s Time to Talk About Those Taylor Swift Super Bowl Bets\nHow Jack Dorsey’s Plan to Get Elon Musk to Save Twitter Went South\nInside a Private Jet Club Where Everything Went Wrong\nSocial Media Platforms Are Done With News, But Gen Z Still Treats Them as a Go-To Source\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-03-01T22:19:00.000Z",
        "Title": "Apple, Microsoft, Amazon, Alphabet, and Nvidia Have All Invested in Voice-Recognition Software. Here's 1 Artificial Intelligence (AI) Stock That Could Go Parabolic.",
        "Author": "  Adam Spatacco, The Motley Fool ",
        "Text": "The euphoria surrounding artificial intelligence (AI) played a major in the Nasdaq Composite's 43% return last year. Indeed, investor enthusiasm for AI has carried over into 2024 -- helping fuel the S&P 500 to record levels.\nWhile each member of the \"Magnificent Seven\" is playing a role in AI development, several companies in this cohort also share a more specific interest in voice-recognition software. Let's break down the various moves megacap tech has made in speech-powered AI assistants, and assess one stock in particular that could be set for liftoff.\nWhether you realize it or not, you probably interact with voice-based assistants almost every day.\nApple acquired AI-assistant Siri back in 2010 and has since integrated the technology across its ecosystem of hardware devices. More recently, Cupertino bought the music recognition app Shazam for $400 million.\nBoth Alphabet and Amazon have also shown a keen interest in voice-recognition applications, as each company's smart home appliances leverage this technology. Moreover, Microsoft acquired conversational AI tool Nuance a couple of years ago for $20 billion -- the third-largest acquisition in the software giant's history.\nBut most recently, semiconductor manufacturer Nvidia revealed that it has built a small stake in voice-recognition software developer SoundHound AI (NASDAQ: SOUN). Following the news of Nvidia's investment, SoundHound AI stock rocketed higher -- the stock gained 347% in the month of February.\nI find this deal with Nvidia particularly delightful because in early January, I predicted that SoundHound AI may be a stock to keep your eyes on in 2024. My thesis primarily hinged on two ideas: voice-based software tools could become increasingly popular as use cases for AI continue to evolve, since voice controls can make AI tools easier to use. Furthermore, the market's appetite for acquisitions could rise this year.\nSince SoundHound AI's trailing-12-month revenue is only $46 million, the company is still quite small. But with cumulative subscriptions and bookings backlog of $661 million, it's clear that the demand for voice-powered AI is rising -- and it's not all coming from big tech.\nConsidering that industry research sees the market for voice-recognition technology reaching $50 billion by the end of the decade, it appears to be early innings for SoundHound AI. While the stock has some momentum pushing it higher right now, this little-known AI company could emerge as a big winner in the long run.\nShould you invest $1,000 in SoundHound AI right now?\nBefore you buy stock in SoundHound AI, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nApple, Microsoft, Amazon, Alphabet, and Nvidia Have All Invested in Voice-Recognition Software. Here's 1 Artificial Intelligence (AI) Stock That Could Go Parabolic. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-12T17:31:50.000Z",
        "Title": "Alphabet and Mueller Industries Are Balance-Sheet Powerhouses",
        "Author": "  John Dorfman ",
        "Text": "Many investors see only half the picture.\nThey are like a baseball scout who looks only for hitting ability, not fielding. They focus obsessively on a company's income statement (profit and loss), mostly ignoring the balance sheet (assets and liabilities).\nI believe the balance sheet is important, particularly now that we have exited a long period of ridiculously low interest rates. The costs of carrying a lot of debt increased risk of bankruptcy and decreased strategic flexibility have risen.\nOnce a year, I compile a list of Balance Sheet Powerhouses, companies that are rich in assets and don't have much debt. To make my Balance Sheet Powerhouses list, a company must:\nHave a market value of $5 billion or more.\nHave debt no more than 10% of the company's net worth.\nBe based in the United States.\nHave a current ratio (current assets divided by current liabilities) of 2.0 or more.\nHave positive earnings of 20 cents per share or more.\nThis year, 41 companies make the list, but many of their stocks are too expensive for my taste. I recommend three of them, starting with Mueller Industries Inc. (NYSE:MLI).\nMueller Industries\nMueller is new to this list because it only recently became large enough to qualify. When I think of Mueller, I think first of refrigerator coils, one of the products for which they are best known. But it also makes a variety of other copper, brass, aluminum and plastic products.\nMueller's debt is a mere 2% of the company's net worth. While many of the Powerhouse stocks sell for 25 to 50 times earnings, Mueller trades at only 13 times earnings. Its 10-year earnings growth rate is a highly creditable 23%.\nT. Rowe Price\nT. Rowe Price Group Inc. (NASDAQ:TROW), based in Baltimore, is one of the larger U.S. mutual-fund companies. Its stock has lost ground in recent years, as people flocked to index funds and ETFs, rather than the mutual funds T. Rowe Price is best known for.\nCall me Quixotic, but I believe that active fund management will come back to prominence in the next two to three years. In my view, the market can't and won't stay forever dominated by a few big growth stocks, the so-called Magnificent Seven. I expect old-fashioned stock picking to make a comeback.\nAlphabet\nMore expensive is Alphabet Inc. (NASDAQ:GOOGL), at 26 times earnings. I rarely pay that much, but I regard Alphabet as the most innovative company in the United States. It owns the Google search engine, You Tube video service, Waymo self-driving cars and Deep Mind, which deals in artificial intelligence.\nOver the past 10 years, Alphabet has increased its sales 20% a year and earnings at almost a 22% clip. The company has made the Powerhouse list 11 times.\nThose are all my recommendations today, but I also want to honor several companies that have been on the Balance Sheet Powerhouse list five times or more.\nReturning champions\nDolby Laboratories Inc. (NYSE:DLB) has been on the Powerhouse list 13 times, more than any other company. Based in San Francisco, it makes audio and surround sound equipment for homes, cars, and theatres. The stock is on the expensive side, at 41 times recent earnings.\nGentex Corp. (NASDAQ:GNTX), best known for making car rear-view mirrors, makes this list for a 12th time.\nEleven-time honorees are Alphabet and SEI Investments Co. (NASDAQ:SEIC), an investment consultant.\nThe only 10-time winner this year is Intuitive Surgical Inc. (NASDAQ:ISRG), which makes surgical instruments.\nOn the honor roll for an eighth time are Arista Networks Inc. (NYSE:ANET) and Cognizant Technology Solutions Corp. (NASDAQ:CTSH). Monster Beverage Co. (NASDAQ:MNST) is in for a seventh time.\nSix-timers are Epam Systems Inc. (NYSE:EPAM), First Solar Inc. (NASDAQ:FSLR) and Veeva Systems (NYSE:VEEV).\nFive times: Exelixis Inc. (NASDAQ:EXEL) and Vertex Pharmaceuticals Inc. (VRTX).\nPast record\nPrior to today, I've compiled the Balance Sheet Powerhouse list 19 times, starting in 2001. Each year, I find from one to five stocks on the list to recommend.\nThe average one-year return on my Powerhouse recommendations has been 13.2%, which compares favorably with 10.3% for the Standard & Poor's 500 Total Return Index.\nBear in mind that my column results are hypothetical and shouldn't be confused with results I obtain for clients. Also, past performance doesn't predict the future.\nTwelve of the 19 columns showed a profit, but only eight beat the index.\nMy picks a year ago, however, fared terribly. They were down 25.6% while the S&P returned 23.5%. The worst performer was Moderna Inc. (MRNA), which fell 49%.\nJohn Dorfman is chairman of Dorfman Value Investments in Boston, Massachusetts. His firm or clients may own or trade the stocks discussed here. He can be reached at jdorfman@dorfmanvalue.com.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-02-06T05:36:48.000Z",
        "Title": "Alphabet is seeking outside investment for its GFiber internet business",
        "Author": "  Jeffrey Dastin ",
        "Text": "By Jeffrey Dastin\nSAN FRANCISCO (Reuters) - Alphabet plans to seek external investment for GFiber, its business selling Wi-Fi and internet connectivity in parts of the United States, the company told Reuters on Monday, as it looks to ramp up its expansion to more cities.\nGFiber, owned by Google's parent company, competes with larger internet service providers including Comcast, Verizon Communications and AT&T.\nSince vowing 14 years ago that it would boost internet speeds 100-fold through fiber-optic cables, GFiber has expanded to 15 states starting with its 2012 launch in Kansas.\nIn the past six years, it has tripled its customer base, GFiber told Reuters, without specifying total users. It signed deals in 2023 that would bring its services to more than 25 additional cities.\nStill, the company faces competition from big incumbents and has yet to provide internet in large swaths of the U.S., including six of the 10 most populous cities including New York.\n\"This next step of raising external capital will enable them (GFiber) to scale their technical leadership, expand their reach, and provide better internet access to more communities,\" Ruth Porat, Alphabet's president and chief investment officer, told Reuters in a statement.\nAlphabet declined to comment on the amount of funds GFiber was looking to raise or the valuation it was seeking.\nGFiber has already hired an investment bank to start the process of selling equity in the company, according to a source close to Alphabet's efforts. The future goal is for GFiber to be independent from Alphabet, the source said on condition of anonymity.\nGFiber CEO Dinni Jain said in a statement: \"We are now ready to scale this much faster.\"\nOTHER BETS\nGFiber is one of Alphabet's so-called Other Bets, its collection of businesses other than Google that are at an earlier stage of research or commercialization. They include health company Verily and self-driving car business Waymo, which have both raised money from outside investors.\nIn 2023, the Other Bets collectively lost $4.1 billion on revenue of $1.5 billion, primarily generated by internet and healthcare-related services, according to Alphabet's annual report.\nPorat, who also serves as chief financial officer, told analysts last week that Alphabet aimed to \"sharpen our investment focus, while capturing the upside given compelling technology breakthroughs across the portfolio\" of Other Bets.\nOne such business, Alphabet's moonshot division known as X, was also looking for external capital to spin out more projects, she said at the time. Alphabet generally is working to revamp its cost base, Porat said.\nThe company, like others in the technology sector, has recently announced job cuts. It declined to comment on whether GFiber's fundraising effort had any relation to Alphabet's overall cost-efficiency program.\n(Reporting by Jeffrey Dastin in San Francisco; Editing by Jamie Freed)\n"
    },
    {
        "Date": "2024-02-21T14:00:23.000Z",
        "Title": "Is Most-Watched Stock Alphabet Inc. (GOOG) Worth Betting on Now?",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet Inc. (GOOG) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this company have returned -4.4%, compared to the Zacks S&P 500 composite's +3% change. During this period, the Zacks Internet - Services industry, which Alphabet Inc. falls in, has lost 2.5%. The key question now is: What could be the stock's future direction?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nEarnings Estimate Revisions\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Alphabet Inc. is expected to post earnings of $1.49 per share, indicating a change of +27.4% from the year-ago quarter. The Zacks Consensus Estimate has changed +1.8% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $6.77 points to a change of +16.7% from the prior year. Over the last 30 days, this estimate has changed +1.8%.\nFor the next fiscal year, the consensus earnings estimate of $7.76 indicates a change of +14.7% from what Alphabet Inc. is expected to report a year ago. Over the past month, the estimate has changed +0.8%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet Inc. is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Alphabet Inc. the consensus sales estimate for the current quarter of $65.95 billion indicates a year-over-year change of +13.6%. For the current and next fiscal years, $286.52 billion and $318.66 billion estimates indicate +11.7% and +11.2% changes, respectively.\nLast Reported Results and Surprise History\nAlphabet Inc. reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago.\nCompared to the Zacks Consensus Estimate of $70.81 billion, the reported revenues represent a surprise of +2.14%. The EPS surprise was +2.5%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet Inc. is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet Inc. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-02-03T00:39:07.000Z",
        "Title": "Why Major Tech Stocks Like Alphabet and Broadcom Flew Higher on Friday",
        "Author": "  Eric Volkman, The Motley Fool ",
        "Text": "The end of the trading week saw a notable bull run toward tech stocks. Buoyed by solid quarterly results from some of the sector's big players, investors plowed into a great many companies in the industry. This resulted in a broad rally throughout, lifting share prices in many tech segments.\nAlphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), for instance, saw both of its listed stocks creep up almost 1%, while semiconductor and other components specialist Broadcom (NASDAQ: AVGO) enjoyed a 2% gain. Content delivery network (CDN) and cybersecurity company Cloudflare (NYSE: NET) and cloud services provider Datadog (NASDAQ: DDOG) rose a respective 4% and nearly 6%.\nThe week was a banner one for tech stocks. On Thursday alone, Meta Platforms (owner of Facebook and Instagram) and Amazon both reported boffo, estimates-beating quarters. That breathed even more life into a resurgent sector that has been looking very robust so far this year.\nThe two tech bellwethers -- Meta in social media, and Amazon in both e-commerce and cloud computing with its Amazon Web Services (AWS) -- have previously posted quarters that were well better than expected. These felt a bit different, though, as Meta declared its first-ever dividend, and Amazon benefited from its customers purchasing an astounding 1 billion-plus items through its site during the Black Friday/Cyber Monday period alone.\nSo for a brief, shining moment, the tech sector as a whole could do no wrong. Users and clients are obviously hungry to use a very wide variety of services, no matter whether they're specialty cloud offerings, search enhancements, or content delivery network offerings to get their online videos playing more smoothly.\nAdding fuel to this happy bonfire was today's latest Labor Department release of the nation's monthly employment figures. Jobs continue to be added to the economy, with employers taking on 353,000 workers in the first month of 2024.\nAnd a revision to December numbers tacked on an extra 100,000 jobs. This is still a humming economy, and a humming economy needs good tech.\nCan the rally continue? I believe it surely can, and likely will. We're in the thick of earnings season, and there is still a host of notable tech stocks that are set to report their latest quarterly figures. We shouldn't be surprised to see even more winning days for the broader sector in the immediate future.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Alphabet wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n \n*Stock Advisor returns as of January 29, 2024\n \nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Eric Volkman has positions in Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Cloudflare, Datadog, and Meta Platforms. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy.\nWhy Major Tech Stocks Like Alphabet and Broadcom Flew Higher on Friday was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-09T10:10:00.000Z",
        "Title": "Meta Just Announced a Dividend. Could Alphabet Be Next?",
        "Author": "  Jeremy Bowman, The Motley Fool ",
        "Text": "Meta Platforms (NASDAQ: META) stunned investors on Thursday with a blowout fourth-quarter earnings report. The social media giant breezed past estimates on the top and bottom lines and offered better-than-expected guidance for the first quarter, forecasting another round of 25% year-over-year revenue growth. By the end of trading on Friday, the stock had jumped 20.3%, adding more than $200 billion in market cap. That's the biggest single-day market cap gain for an individual U.S. stock in history.\nOne reason for those gains is that Meta announced its first-ever dividend. Management said it would pay a $0.50 per share quarterly dividend on March 26 to shareholders of record on Feb. 22. That gives the stock a dividend yield of 0.4% at the current share price.\nThe dividend was a surprise since there had been little expectation that Meta would initiate a regular payout especially as the company was facing challenges just a few quarters ago with revenue and profits declining.\nOn Meta's earnings call, chief financial officer Susan Li explained the move, saying that returning capital to shareholders remains important to the company, and \"We believe our strong financial position and performance will enable us to invest in the business while also continuing to return capital to investors over time.\"\nLooking at Meta's finances, the decision seems like a no-brainer. Meta has $65 billion in cash and marketable securities, and it just finished a year when it generated $39.1 billion in net income and $44 billion in free cash flow.\nHistorically, the company has returned capital to shareholders through share buybacks, and it returned $20 billion that way in 2023. However, rewarding them with a dividend makes sense as it gives existing shareholders a way to benefit from that return without selling the stock. The dividend will cost the company approximately $5 billion a year.\nWith Meta initiating a dividend, it's only natural to ask which of the big tech stocks will be next, and one of Meta's peers seems like an obvious choice: Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL).\nIn many ways, Alphabet is like a larger version of Meta Platforms (formerly Facebook). The Google parent is the older of the two companies, and the two companies have been ranked No. 1 or No. 2 in digital advertising since the industry's early days.\nAlphabet also seems to have more cash than it knows what to do with. It finished 2023 with $111 billion in cash and marketable securities, more than it had in total liabilities. Last year, the company generated $73.8 billion in net income and $69.5 billion in free cash flow.\nThere's been no discussion of an Alphabet dividend, and it's not something that activist investors have demanded, but it is something the tech giant could clearly afford if it chose to pay one.\nIn addition to the direct cash distribution, there's another less obvious benefit to paying a dividend. For companies like Alphabet and Meta, which generate boatloads of cash each quarter, paying a dividend also acts as a guardrail on spending and a pledge to shareholders that they are getting some share of profits.\nIn the case of these two companies, it seems like they could use a guardrail. Besides their highly profitable advertising businesses, both companies lose billions on moonshot projects each year.\nAlphabet classifies these as \"other bets,\" which include its Waymo autonomous vehicle business; Verily life sciences business; and Google Fiber broadband business, among others. Meta's money-losing business is Reality Labs, its new segment focused on AI and the metaverse.\nGoogle is also notorious for over-hiring, overspending on projects, and being plagued by risk aversion. For example, the company has an internal term for developing technologies that it saves for later (\"pantry mode\"), which explains the company's cautiousness in AI.\nA commitment to returning cash to shareholders through dividends would not only reward investors, but it would also help give the company some needed discipline on expenses.\nIt's not surprising that Meta's decision to start paying a dividend came after its highly successful \"Year of Efficiency,\" and CEO Mark Zuckerberg's declaration that \"We operate better as a leaner company.\"\nThat realization dovetails with its decision to initiate a dividend as well.\nShould you invest $1,000 in Meta Platforms right now?\nBefore you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jeremy Bowman has positions in Meta Platforms. The Motley Fool has positions in and recommends Alphabet and Meta Platforms. The Motley Fool has a disclosure policy.\nMeta Just Announced a Dividend. Could Alphabet Be Next? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-23T12:00:14.000Z",
        "Title": "Why The 28% Return On Capital At Alphabet (NASDAQ:GOOGL) Should Have Your Attention",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "If we want to find a stock that could multiply over the long term, what are the underlying trends we should look for? Firstly, we'd want to identify a growing return on capital employed (ROCE) and then alongside that, an ever-increasing base of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. With that in mind, the ROCE of Alphabet (NASDAQ:GOOGL) looks great, so lets see what the trend can tell us.\nFor those that aren't sure what ROCE is, it measures the amount of pre-tax profits a company can generate from the capital employed in its business. To calculate this metric for Alphabet, this is the formula:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.28 = US$88b ÷ (US$402b - US$82b) (Based on the trailing twelve months to December 2023).\nTherefore, Alphabet has an ROCE of 28%. That's a fantastic return and not only that, it outpaces the average of 8.0% earned by companies in a similar industry.\n View our latest analysis for Alphabet \nIn the above chart we have measured Alphabet's prior ROCE against its prior performance, but the future is arguably more important. If you're interested, you can view the analysts predictions in our free analyst report for Alphabet .\nInvestors would be pleased with what's happening at Alphabet. The numbers show that in the last five years, the returns generated on capital employed have grown considerably to 28%. The company is effectively making more money per dollar of capital used, and it's worth noting that the amount of capital has increased too, by 62%. So we're very much inspired by what we're seeing at Alphabet thanks to its ability to profitably reinvest capital.\nTo sum it up, Alphabet has proven it can reinvest in the business and generate higher returns on that capital employed, which is terrific. And a remarkable 156% total return over the last five years tells us that investors are expecting more good things to come in the future. In light of that, we think it's worth looking further into this stock because if Alphabet can keep these trends up, it could have a bright future ahead.\nWhile Alphabet looks impressive, no company is worth an infinite price. The  intrinsic value infographic for GOOGL helps visualize whether it is currently trading for a fair price.\nAlphabet is not the only stock earning high returns. If you'd like to see more, check out our free list of companies earning high returns on equity with solid fundamentals.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-02-06T10:01:00.000Z",
        "Title": "Alphabet's AI Model Gemini Can Do a Lot. Here's What Could Be Most Valuable.",
        "Author": "  Adria Cimino, The Motley Fool ",
        "Text": "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has spent about eight years focusing on artificial intelligence (AI), a market forecast to soar in the double digits this decade. This technology may revolutionize everything from work to daily life, making it an area tech companies can't ignore.\nLate last year, Alphabet took a particularly big step forward in the area of AI. The technology giant introduced Gemini, its strongest AI model yet and one that could help the company progress across its businesses, from Google Search to cloud computing. In fact, Alphabet says it's integrating Gemini in all of its products and services. Gemini can indeed do a lot -- from powering features in the company's Pixel 8 Pro smartphone to offering developers a building platform.\nBut, for Alphabet, Gemini and the company's overall AI work may be most valuable in one particular area.\nAs mentioned above, Alphabet has more than one business. The company offers clients cloud computing services through Google Cloud and also sells hardware such as phones and watches. But Alphabet's biggest business of all -- and the one most people are probably familiar with -- is Google Search.\nGoogle holds a 91% share of the worldwide search market, leaving even its closest rival, Microsoft's Bing, in the dust with a share of less than 4%. This leadership isn't likely to end thanks to Alphabet's solid moat, or competitive advantage, which is its comfortable position in our daily routines. Proof of that is its entrance into our language -- when you don't know something, the common reflex is to say, \"I'll Google it.\"\nNow, let's get back to Gemini and where it could be most valuable for Alphabet -- and that's in the area of search. The company has made the smart decision to aggressively work to improve its search engine and not just ride those waves of success.\nAlphabet has started to experiment with Gemini in search, and the result is it's speeding up the company's Search Generative Experience (SGE). With Gemini on board, search latency has dropped 40% in the English language, and that means searches are considerably faster.\nThe tech giant has been developing SGE as a search platform using generative AI -- so that when you search for something, you're immediately served a general overview of the particular topic, along with links to find more in-depth information and different perspectives. All of this offers you the opportunity to gain a broader knowledge of the topic you're interested in and discover a wider range of content related to it.\nToday, Alphabet generates most of its revenue through Google advertising, with businesses aiming to sell their products or services to users as they use the search engine. In the most recent quarter, Google advertising represented 75% of total revenue.\nAI, by making searches faster and better, will keep users loyal, ensuring advertisers will keep coming back. Gemini is also directly helping advertisers build better ad campaigns through an AI-powered chat experience.\nOf course, this new AI model also may help Alphabet score wins across its businesses and lift revenue in both its cloud and hardware segments. But considering the company's leadership in search and the ad revenue linked to that, search is where Gemini truly could make its mark, becoming a key element to drive future revenue growth.\nWhat does this mean for investors? Alphabet has a solid track record of earnings increases and has displayed dominance in the search business and growth in its other businesses over time.\nAnd even in difficult economic environments, such as the past two years, revenue has gained.\nAt the same time, the shares trade for only 21x forward earnings estimates, down from 30 a year ago, a bargain considering the whole picture. And that's why today is a great time to buy Alphabet -- and benefit as Gemini makes the company's top business even better.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 5, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Adria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool has a disclosure policy.\nAlphabet's AI Model Gemini Can Do a Lot. Here's What Could Be Most Valuable. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-02-05T11:00:00.000Z",
        "Title": "Microsoft, Meta Platforms, Amazon, Apple, Alphabet, Tesla and Nvidia are part of Zacks Earnings Preview",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – February 5, 2024 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Microsoft MSFT, Meta Platforms META, Amazon AMZN, Apple AAPL, Alphabet GOOGL, Tesla TSLA and Nvidia NVDA.\nWe have seen some awe-inspiring results from Microsoft, Meta Platforms and Amazon in recent days that reconfirm their leadership position in this market.\nThese companies, along with their peers in the ‘Magnificent 7’ group of stocks – Apple, Alphabet, Tesla and Nvidia – led the market higher last year, and that momentum has continued this year.\nOther than Tesla, whose results disappointed the market once again and reflected the fourth quarter in a row of disappointing results, all of the other Mag 7 members that have reported came out with impressive growth numbers. The market wasn’t particularly impressed with the Alphabet and Apple reports, but they came out with Q4 earnings growth of +51.8% and +13.1%, respectively.\nTesla’s earnings were down -45.8% in Q3 on +3.5% higher revenues, as the EV-maker continued to grapple with weakening margins in an increasingly competitive EV market.\nUsing estimates for Nvidia, which will be coming out with its December-quarter results on February 21st, and actual results for the other six members of the group, total Q4 earnings for the group are expected to be up +48.7% from the same period last year on +14.5% higher revenues.\nPlease note that the Mag 7 companies currently account for 28.6% of the S&P 500 index’s total market capitalization and are expected to bring in 19.5% of the index’s total earnings in 2024. For 2023 Q4, the Mag 7 group has a bigger weightage, bringing in 23.1% of all S&P 500 earnings.\nGiven their enormous earnings power and growth profiles, it is hard to argue with the group’s market leadership. Importantly, analysts had been raising their estimates for the group even before the December-quarter results, with these numbers now adding to the positive revision momentum.\nBeyond these mega-cap players, total Q4 earnings for the Technology sector as a whole are expected to be up +24.2% from the same period last year on +8.1% higher revenues.\nThis week’s blockbuster Tech results has pushed the aggregate earnings growth picture for the S&P 500 index to +4.3% from last week’s +1.1% growth pace. Excluding the contribution from the Mag 7 stocks, Q4 earnings for the rest of the index would be down -4.2%.\nIncluding all the results that came out through Friday, February 2nd, we now have Q4 results from 230 S&P 500 members, or 46% of the index’s total membership.\nWe have more than 500 companies on deck to report results this week, including 106 S&P 500 members. This week’s line-up includes a who’s who of the index, including Disney, Elli Lilly, MacDonalds, DuPont, Caterpillar, Ford, Pepsi, Chipotle, Uber, PayPal, Expedia, and many others.\nTotal Q4 earnings for the 230 index members that have reported already are up +4.2% from the same period last year on +2.8% higher revenues, with 81.3% beating EPS estimates and 63.9% beating revenue estimates.\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>> Q4 Earnings: Tech Flexes Strong Growth \nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\nSee Stocks Free >>\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    }
]