[
    {
        "Date": "2024-03-13T13:00:10.000Z",
        "Title": "Is It Time To Consider Buying Alphabet Inc. (NASDAQ:GOOGL)?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Alphabet Inc. (NASDAQ:GOOGL) received a lot of attention from a substantial price movement on the NASDAQGS over the last few months, increasing to US$154 at one point, and dropping to the lows of US$129. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether Alphabet's current trading price of US$139 reflective of the actual value of the large-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at Alphabet’s outlook and value based on the most recent financial data to see if there are any catalysts for a price change.\n See our latest analysis for Alphabet \nGood news, investors! Alphabet is still a bargain right now. According to our valuation, the intrinsic value for the stock is $211.45, which is above what the market is valuing the company at the moment. This indicates a potential opportunity to buy low. However, given that Alphabet’s share is fairly volatile (i.e. its price movements are magnified relative to the rest of the market) this could mean the price can sink lower, giving us another chance to buy in the future. This is based on its high beta, which is a good indicator for share price volatility.\nFuture outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. With profit expected to grow by 48% over the next couple of years, the future seems bright for Alphabet. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.\nAre you a shareholder? Since GOOGL is currently undervalued, it may be a great time to increase your holdings in the stock. With an optimistic outlook on the horizon, it seems like this growth has not yet been fully factored into the share price. However, there are also other factors such as capital structure to consider, which could explain the current undervaluation.\nAre you a potential investor? If you’ve been keeping an eye on GOOGL for a while, now might be the time to enter the stock. Its prosperous future outlook isn’t fully reflected in the current share price yet, which means it’s not too late to buy GOOGL. But before you make any investment decisions, consider other factors such as the track record of its management team, in order to make a well-informed investment decision.\nSince timing is quite important when it comes to individual stock picking, it's worth taking a look at what those latest analysts forecasts are. At Simply Wall St, we have the analysts estimates which you can view by clicking here.\nIf you are no longer interested in Alphabet, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-11T13:58:00.000Z",
        "Title": "Is Alphabet Stock a Buy Now?",
        "Author": "  Neil Patel, The Motley Fool ",
        "Text": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) has long been a stock market winner. Shares have risen by 338% in the past 10 years. This performance outpaces both the S&P 500 and the Nasdaq Composite.\nBut at a market cap of nearly $1.7 trillion, you might be wondering if this \"Magnificent Seven\" stock is a smart buy today. Here is why I think it is.\nOne mark of a great business is its financial performance, particularly over several years. Here's where Alphabet absolutely shines.\nFor starters, growth has been impressive. In the last decade, the company's revenue and diluted earnings per share (EPS) increased at compound annual rates of 18.7% and 19.6%, respectively. Tackling massive -- and expanding -- end markets, while benefiting from scale advantages, helps.\nAnd looking ahead, it's easy to be optimistic that the double-digit gains will continue. Wall Street analysts' consensus estimates predict revenue will rise at an annualized pace of 10.6% over the next three years, with diluted EPS growing at a 15.1% yearly clip.\nAlphabet's finances are in tip-top shape. In the last three years, the company produced a whopping $285 billion of cumulative operating cash flow. That figure alone exceeds the market caps of the majority of public companies out there.. With more money than it knows what to do with, Alphabet has consistently bought back stock, reducing the outstanding share count by roughly 10% in the past five years.\nAs of Dec. 31, the company had a net cash position of $98 billion. This reduces financial risk by adding a huge buffer should economic conditions deteriorate. At the same time, Alphabet should still be able to invest aggressively in growth initiatives, while smaller rivals might have to play defense just to survive.\nAlphabet owns and operates some of the most widely used digital services on the face of the planet. CEO Sundar Pichai summed up this dominance when he commented in the Q2 2023 earnings press release: \"With fifteen products that each serve half a billion people, and six that serve over two billion each, we have so many opportunities to deliver on our mission.\"\nOf course, Google Search, which generated 56% of overall company revenue in the fourth quarter, remains Alphabet's crown jewel. It commands a 90%-plus share of the global search market, a figure that has remained steady even with the launch of ChatGPT in late 2022.\nThere's also Chrome (web browser), Android (mobile operating system), and Gmail (email service). All of these lead their respective product categories on a worldwide stage.\nBesides those popular internet properties that make Alphabet a leading tech titan, there are other significant value drivers that can't be ignored.\nYouTube, which the company acquired for $1.7 billion in 2006, generated $31.5 billion in sales in 2023, making it arguably one of the most successful acquisitions in corporate history. According to data from Nielsen, YouTube attracts the most TV viewing time of any streaming service in the U.S. -- even more than Netflix. And it benefits from powerful network effects.\nGoogle Cloud posted revenue growth of 26% in 2023, and it reported four straight quarters of positive operating income. Because the cloud market is set to continue expanding at a rapid clip in the years ahead due to enterprise and government clients moving to off-premises IT infrastructure, this segment will be propelled by a powerful tailwind. \nAnd with Waymo, Alphabet also has a top player in autonomous driving software. The self-driving segment increases Alphabet's optionality, because it could pay off over the long term.\nDriven by Q4 financial results that the market wasn't happy with, shares of Alphabet have fallen 12% since Jan. 30 (as of March 7). And the stock is currently 13% below its peak price. But I view this as an opportunity.\nShares are trading hands at a forward price-to-earnings ratio of 19.7. In my opinion, this looks like an absolute no-brainer buying decision for investors.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 8, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Neil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Netflix. The Motley Fool has a disclosure policy.\nIs Alphabet Stock a Buy Now? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-22T22:22:47.000Z",
        "Title": "Alphabet is set to pop 15% as Google is a clear winner in AI, Wedbush says",
        "Author": "  Jennifer Sor ",
        "Text": "Alphabet stock could see a big surge as Google is a \"clear winner\" in AI, according to Wedbush.\nAnalysts pointed to multiple advantages the Google parent has over other firms in the AI space.\nMore upside could lie ahead if Alphabet expands partnerships and issues more guidance on AI projects.\nAlphabet stock is primed for a big jump, as Google will emerge as a clear winner in the artificial intelligence race that's gripped Wall Street, Wedbush analysts said in a recent note.\nThe firm added Alphabet stock to its \"Best Ideas List\" and raised its price target on the Google parent from $160 to $175 per share. That implies a 15% upside from the stock's current levels, with Alphabet trading around $152 a share on Friday morning.\n\"We believe the perceived structural risks to Google Search are overstated and continue to view Alphabet as a net beneficiary of generative AI,\" analysts said in a note on Friday.\nThe new price target is largely because of Alphabet's \"multifaceted\" edge over other competitors in the AI race, Wedbush said, such as its wide breadth of available data to train AI models and its massive user base across its products, like Android, Search, and YouTube.\nThe company could also soon be collaborating with Apple to incorporate its Gemini AI into iPhones.\nShares of the tech titan have lagged the gains of other Magnificent Seven names like Amazon and Microsoft, which are up 18% and 14%, respectively year-to-date, and the stock has underperformed the wider Nasdaq which is up by about 11% for the year.\nHowever, sentiment over Alphabet's AI endeavors has improved, analysts said, citing more upbeat commentary on Google in recent months. Meanwhile, Alphabet shares are still up over 6% since the start of the year. That displays some resilience in the stock, despite controversy arising in March after Gemini was known to create historically inaccurate images.\nThe stock could see more upside catalysts in the future, Wedbush said, adding it was looking for the Google parent to issue more guidance on its business model for its Search Generative Experience, deeper \"cost reengineering\" to develop its AI projects, as well as more partnerships to develop AI models with other firms.\n\"We continue to view Alphabet as a secular winner within the digital advertising industry with broad exposure and durable market share of overall media spending,\" analysts added.\nWedbush has been bullish on Alphabet and the broader AI-fueled rally for months. AI is likely spawning a new 1995-style tech bull market, Wedbush analysts said in a previous note, predicting tech stocks could soar another 33% in 2024.\nRead the original article on Business Insider\n"
    },
    {
        "Date": "2024-03-03T16:30:00.000Z",
        "Title": "Alphabet Falls From 3rd- to 5th-Largest U.S. Company. Should You Buy, Sell, or Hold the Stock?",
        "Author": "  Keithen Drury, The Motley Fool ",
        "Text": "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) is better known by some of the brands it owns, like Google and YouTube. It's one of the largest tech companies and one of the members of the exclusive trillion-dollar market-cap club. However, thanks to other tech giants posting strong quarters, it has lost its place as the third-largest U.S. company behind Microsoft and Apple. Nvidia and Amazon have now passed it, although Amazon may fall beneath Alphabet on a day-to-day basis.\nSo, is there something wrong with the stock? Let's look at all sides of the analysis, then decide which camp is best.\nThe biggest factor in many big tech companies' success right now is artificial intelligence (AI). AI progress and optimism is why Nvidia has shot up so dramatically over the past year, and what propelled Microsoft to pass Apple as the world's largest company.\nFrom the start, Alphabet has appeared behind in the AI race. It lost to ChatGPT as the first to launch a usable generative AI product, and to Microsoft's Bing as the first search engine to integrate generative AI. Additionally, its generative AI engine, Gemini, has recently been subjected to bad press, as its image generation feature failed to depict accurate images of prompts.\nThe big problem is that if Alphabet's AI model is flawed, or shows a particular bias, it can affect its primary business: advertising. The Gemini model will become the basis of everything Alphabet does, and if it causes issues with Alphabet's advertising model, advertisers may look elsewhere to spend. Considering that 76% of Alphabet's total revenue comes from ads, this would be a big problem.\nAlphabet is well aware of the issues with its Gemini model. It apologized for the image generation issue and vowed to improve the platform. Additionally, just because the consumer-facing model does one thing doesn't mean that there isn't a different model being used internally to perform tasks like improving search results.\nThe Gemini model still scores better than many competitors in tasks like math and coding, making it a clear choice for many applications.\nWhile time will tell what Alphabet does, investors should be assured that the company isn't letting a generational investment opportunity slip by.\nBecause of Alphabet's various problems, there isn't much of a premium attached to the stock. Alphabet is trading for just 21 times earnings estimates, the same as the S&P 500.\nEssentially, the market is valuing Alphabet like an average company. While this assessment may be fair due to its lackluster performance in critical product development, if Alphabet hits its stride, the company will look incredibly undervalued.\nAs another side note, if Alphabet fetched the same premium as Microsoft (35 times forward earnings), its market cap would be $2.95 trillion -- making it the second-largest company in the world and only a bit behind Microsoft at $3.05 trillion.\nPerception is a big part of how stocks are valued in the market, and market sentiment about Alphabet isn't great right now.\nSo, which viewpoint makes the most sense?\nIn my opinion, the stock is a buy. The other big tech firms are expensively priced, and not doing so much better that they warrant those massive premiums. As a result, Alphabet is one of my top tech stocks to buy right now.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy.\nAlphabet Falls From 3rd- to 5th-Largest U.S. Company. Should You Buy, Sell, or Hold the Stock? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-19T07:49:00.000Z",
        "Title": "Prediction: Alphabet Stock Will Take Off Again... and Here's Why.",
        "Author": "  Howard Smith, The Motley Fool ",
        "Text": "There is an answer for investors who fear they missed out on the big rally in technology stocks. After strong 2023 returns, Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) stock has underperformed the tech-heavy Nasdaq Composite index so far this year.\nShares of Google's parent company are up about 1% in 2024 while the index has returned nearly 7%. But with businesses including the leading online search engine, a growing YouTube social media platform, and one of the top three cloud computing platforms, Alphabet stock could be ready to take off again.\nAlphabet still gets most of its revenue from advertising, and an online advertising slowdown has soured investors on the company's stock. Google advertising revenue declined by more than 10% in fourth quarter of 2023 year over year.\nBut Alphabet's cloud segment is growing and has increased its revenue share for the past several years. Google Cloud contributed nearly 11% of Alphabet's sales in 2023, compared to just 4.3% in 2018.\nInvestors seem to think it is falling behind in the race to monetize artificial intelligence (AI) solutions, though. The company famously muddled the introduction of its Gemini AI model. But even if Alphabet is losing the sprint for a successful generative AI offering, it could be a winner in the AI marathon. \nThat's because cloud users are integrating AI tools to modernize their businesses. The integration of AI will require more and more computing power. That's evident in the exploding revenue Nvidia has been reporting from sales of its H100 graphics processing units (GPUs). \nWhat's important for Alphabet, and specifically Google Cloud, is that AI is intensifying the adoption of cloud computing. Tim Potter, a principal at Deloitte Consulting, noted that \"Most AI solutions are either services offered directly by cloud hyperscalers or solutions built on top of a hyperscaler's cloud infrastructure.\"\nThat's good news for leading cloud providers like Alphabet and should help to meaningfully drive its business going forward. \nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 18, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Howard Smith has positions in Alphabet and Nvidia. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy.\nPrediction: Alphabet Stock Will Take Off Again... and Here's Why. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-07T15:04:57.000Z",
        "Title": "What Is Going on With Alphabet Stock?",
        "Author": "  Neil Rozenbaum, The Motley Fool ",
        "Text": "In this video, I'll talk about Google parent Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG), which seems to be constantly undervalued, and explain why that is and why investors should look past the noise.\n*Stock prices used were from the trading day of March 6, 2024. The video was published on March 7, 2024.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Neil Rozenbaum has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Neil is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\nWhat Is Going on With Alphabet Stock? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-27T11:45:00.000Z",
        "Title": "Where Will Alphabet Stock Be in 5 Years?",
        "Author": "  Keithen Drury, The Motley Fool ",
        "Text": "Of all of the \"Magnificent Seven\" stocks, the one getting the least respect right now is Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL). Alphabet has been plagued by many publicity blunders related to its generative artificial intelligence (AI) model, but these failures likely won't last forever.\nSo, where will Alphabet be five years down the road?\nAlphabet is the parent company of Google, Android, YouTube, and more. While these seem like varied businesses, they are all heavily focused on advertising. Advertising provides 76% of Alphabet's revenue, so excelling in this area is crucial. It's also why getting its AI model right is critical.\nAmong the ways Alphabet uses AI is to make better choices about which ads reach which people. If its results on that front are weak, advertisers may not feel that spending with Alphabet is critical for optimal performance and look elsewhere to spend their ad dollars. This hasn't happened yet -- Alphabet's ad revenue rose 11% year over year in Q4.\nAlso, Alphabet's generative AI product, Gemini, made its fair share of public blunders since its launch. From AI image generation issues to its generative AI model giving incorrect answers to questions, its rollout has been far from smooth.\nThe most important part of any AI model is data, and Alphabet is about to get a huge boost in its data quantity and quality. Apple is reportedly considering integrating Alphabet's Gemini model into its iPhones. This partnership would give Alphabet information on an important user base, making the ad space it sells more valuable.\nThis kind of information could make Alphabet's AI model a force to be reckoned with in five years. But the market is treating Alphabet like it's already doomed.\nUnlike many of its big-tech peers, Alphabet's stock is not trading at a premium valuation. It's valued at just under 22 times earnings, which is far from what others trade at.\nWith Microsoft and Apple trading at 37 and 26 times earnings, respectively, Alphabet looks fairly priced compared to the others.\nThis sets Alphabet up for a nice run, as its future growth isn't priced into its stock. With Wall Street analysts projecting 11% growth in the next two years, the stock is set up to provide investors with market-beating returns (greater than 10% per year).\nAnd that doesn't include the effects of stock buybacks.\nAlphabet has taken advantage of its cheap valuation by repurchasing its shares. In Q4 alone, it bought back $16.2 billion in stock. This reduced its outstanding share count by over 3%, which boosted its earnings per share.\nAdditionally, Alphabet's operating margin ticked up thanks to disciplined spending.\nAll of this combines to make it a company that can grow its earnings per share by a percentage in the mid-teens range -- a much faster pace than it's growing its revenues. This sets the stock up to potentially crush the market over the next five years.\nAs a result, I think Alphabet is a fantastic stock to buy right now, as it is well set up for the future if it gets its AI models right. Because of Alphabet's vast engineering resources, I don't think this will be much of a problem.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 25, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Keithen Drury has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nWhere Will Alphabet Stock Be in 5 Years? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-22T13:40:11.000Z",
        "Title": "Why Alphabet (GOOGL) is a Top Value Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "It doesn't matter your age or experience: taking full advantage of the stock market and investing with confidence are common goals for all investors.\nAchieving those goals is made easier with the Zacks Style Scores, a unique set of guidelines that rates stocks based on popular investing methodologies, namely value, growth, and momentum. The Style Scores can help you narrow down which stocks are better for your portfolio and which ones can beat the market over the long-term.\nWhy Investors Should Pay Attention to This Value Stock\nFinding good stocks at good prices, and discovering which companies are trading under their true value, are what value investors like to focus on. So, the Value Style Score takes into account ratios like P/E, PEG, Price/Sales, and Price/Cash Flow to highlight the most attractive and discounted stocks.\nAlphabet (GOOGL)\nAlphabet is one of the most innovative companies in the modern technological age. Over the last few years, the company has evolved from primarily being a search-engine provider to cloud computing, ad-based video and music streaming, autonomous vehicles, healthcare providers and others.\nGOOGL sits at a Zacks Rank #3 (Hold), holds a Value Style Score of B, and has a VGM Score of B. Compared to the Internet - Services industry's P/E of 26X, shares of Alphabet are trading at a forward P/E of 21.8X. GOOGL also has a PEG Ratio of 1.4, a Price/Cash Flow ratio of 21.4X, and a Price/Sales ratio of 6X.\nA company's earnings performance is important for value investors as well. For fiscal 2024, 11 analysts revised their earnings estimate higher in the last 60 days for GOOGL, while the Zacks Consensus Estimate has increased $0.00 to $6.77 per share. GOOGL also holds an average earnings surprise of 7.2%.\nWith strong valuation and earnings metrics, a good Zacks Rank, and top-tier Value and VGM Style Scores, investors should strongly think about adding GOOGL to their portfolios.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-14T10:15:00.000Z",
        "Title": "Where Will Alphabet Stock Be in 5 Years?",
        "Author": "  Harsh Chauhan, The Motley Fool ",
        "Text": "Technology stocks are off to a strong start in 2024, with the Nasdaq-100 Technology Sector index clocking 9.8% gains as of this writing. The same cannot be said about Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL), as shares of the technology giant are flat so far in 2024.\nAlphabet delivered solid results at the beginning of the year, but its ad revenue wasn't up to the market's expectations. Additionally, concerns were raised by investors about Alphabet's ability to compete in the generative artificial intelligence (AI) market after its chatbot Gemini ran into controversy.\nCan the company turn around negative investor perceptions and deliver solid returns to investors over the next five years? Let's find out.\nIn 2023, Alphabet reported total revenue of $307.4 billion, a 10% jump over the previous year in constant currency terms. That was a drop in growth from the 14% jump the company clocked in 2022. Analysts expect Alphabet's revenue growth to improve slightly in 2024, rising at an 11.4% rate to total $342.6 billion.\nHowever, as the following chart indicates, Alphabet's pace of growth is expected to decelerate slightly over the next couple of years.\nThere are a couple of reasons why that may be the case.\nFirst, the company's ad business is under threat from Meta Platforms (NASDAQ: META). Alphabet's Google Advertising revenue was up just 6% in 2023 to $237.8 billion. Meta Platforms, on the other hand, delivered a 16% jump in advertising revenue last year to $132 billion. It is worth noting that the digital ad market recorded 10.7% growth in 2023, according to eMarketer. So Meta's faster growth than the digital advertising market means that it is gaining share in this lucrative niche from Alphabet.\nMoreover, Alphabet's estimated revenue growth for 2024 means that it could keep losing share to Meta. That's because the digital ad market is forecast to grow 13.2% this year, and analysts predict a 17% increase in Meta's revenue in 2024.\nAlphabet's growth is also expected to stay mediocre because of the competition in its cloud computing business. Though Google Cloud revenue increased an impressive 26% year over year in the fourth quarter of 2023 to $9.2 billion, competitor Microsoft's Azure cloud increased 30% year over year in its corresponding quarter thanks to the growing adoption of its AI-focused cloud services.\nAll this indicates why investors seem to prefer other \"Magnificent Seven\" stocks this year instead of Alphabet. There is no doubt that Alphabet is trying to get its foot in the door of the generative AI market, with management explaining the company's AI-related efforts at length on the January earnings conference call, but the numbers indicate that its peers are using this technology in a better way to boost their financial performance.\nHowever, there is one reason why investors might still want to consider taking a chance on Alphabet and buying the stock right now for the long haul.\nThe rapid rise in the stock prices of Alphabet's Magnificent Seven peers means they trade at expensive valuations (see chart below).\nBuying Alphabet at this valuation could turn out to be a smart long-term move. We have seen that its cloud business is already growing at a healthy pace, and certain analysts believe that it could gain ground in the generative AI market as well. JPMorgan's Doug Anmuth, who has an overweight rating on Alphabet stock, predicts that the company could make a comeback in the generative AI space.\nThat wouldn't be surprising, as the company is aggressively adding generative AI tools into its advertising tools to drive greater returns for advertisers. So with the stock trading at 23 times trailing earnings and 20 times forward earnings -- a discount to the Nasdaq-100's earnings multiple of 32 (using the index as a proxy for tech stocks) -- investors are getting a good entry point.\nAnalysts predict Alphabet's earnings will increase at an annual rate of 19% for the next five years. Based on its 2023 earnings of $6.79 per share, the company's bottom line could increase to $13.84 per share in five years. If Alphabet's growth picks up by that time and the market rewards it with a higher earnings multiple, this tech stock could deliver impressive gains.\nEven if Alphabet is trading at 24 times forward earnings after five years, which is equivalent to its five-year average forward price-to-earnings ratio, its stock price could jump to $332 in five years. That would be a 138% increase from current levels, which is why it may be a good idea to buy Alphabet while it is still cheap.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, JPMorgan Chase, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nWhere Will Alphabet Stock Be in 5 Years? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-08T00:36:00.000Z",
        "Title": "1 Wall Street Analyst Thinks Alphabet Stock Is Going to $170. Is It a Buy Around $130?",
        "Author": "  Eric Volkman, The Motley Fool ",
        "Text": "As the seemingly eternal leader in internet search, Google parent Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) has made a great many investors richer over the course of its more than 25-year history. Lately, though, it hasn't been the most exciting stock, neither soaring higher nor crashing violently in price on the tech sector's gyrations.\nSome believe it's being unfairly ignored by the market, and the market is missing a chance to get a solid investment at a cheap price. Let's explore one analyst's bullish take on the company.\nAs February came to a close, Redburn-Atlantic's James Cordwell upped his price target on Alphabet's class A voting shares (the ones with the GOOGL ticker symbol). These should be worth $170 apiece, according to him, up from his previous level of $165. In making his change, Cordwell maintained his buy rating on the shares.\nThat makes for a potential gain of around 30% on both classes of Alphabet's stock, given that they're hovering around the $130 level these days and they trade at basically the same level.\nCordwell feels that Alphabet is priced more like a traditional blue chip stock in an unexciting industry than a leader dominating a corner of the tech sector. He wrote in a note that with \"Alphabet's forward P/E now just in line with that of the [S&P 500 index] sentiment has clearly turned negative regarding Google Search's competitive position and ongoing growth potential.\"\nIt can be tough for a company that's been so firmly established in its niche to win investor love.\nWith longevity, more people can take a business for granted and forget that it still might have powerful growth in front of it. Technological advances will make internet search more of a valuable resource, not less, and there's no meaningful competition to the powerhouse that is Alphabet. That makes Cordwell's latest take on the stock rather compelling and $130 looks like a cheap price for a company with a bright future.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy.\n1 Wall Street Analyst Thinks Alphabet Stock Is Going to $170. Is It a Buy Around $130? was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-10T10:12:00.000Z",
        "Title": "Better AI Stock: AMD vs. Alphabet",
        "Author": "  Dani Cook, The Motley Fool ",
        "Text": "Despite more than a year of seemingly nonstop coverage on the artificial intelligence (AI) market, Wall Street just can't get enough. The industry remains a high-growth area, with plenty of investment opportunities.\nData from Grand View Research shows the AI market hit nearly $200 billion last year and is projected to expand at a compound annual growth rate of 37% until at least 2030. That rate would see the segment achieve a valuation nearing $2 trillion by decade's end.\nSo despite the industry's meteoric rise over the last year, it seems to have barely scratched the surface of its potential. As a result, it's not too late to dedicate a portion of your holdings to AI and benefit from its growth for years.\nTwo exciting options are Advanced Micro Devices (NASDAQ: AMD) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL), with one expanding in the hardware side of the industry and the other investing in its AI software offerings.\nLet's examine these businesses more closely and determine whether you're better off investing in the budding AI market through AMD's or Alphabet's stock.\nShares in AMD have climbed 43% year to date. The company rallied investors by pivoting its business to AI as it seeks to claim a slice of the lucrative market.\nIn 2023, Nvidia stole much of the spotlight, as it snapped up an estimated 90% market share in AI graphics processing units (GPUs) while AMD was left playing catch-up. However, AMD shifted its focus over the last year and could make a big splash in the industry in 2024.\nLast December, the company unveiled its new MI300X AI GPU. The chip was designed to compete directly with Nvidia's offerings and already caught the attention of some of tech's most prominent players, signing on Microsoft and Meta Platforms as clients.\nAMD's earnings have yet to reflect its heavy investment in AI. However, its financials are moving in a positive direction. In its fourth quarter of 2023, AMD's revenue rose 10% year over year to $6 billion, beating analysts' expectations by about $60 million.\nThe company's AI-focused data center segment posted revenue growth of 38%. Meanwhile, improvements in the PC market boosted AMD's client segment by 65% year over year.\nIn addition to AI chips, AMD is diversifying its role in the market by expanding in AI PCs as it seeks to dominate its own area of the industry.\nIt's impossible to deny Alphabet's top spot in tech, with brands like Android, YouTube, and Google attracting billions of users worldwide. The popularity of these offerings has seen Alphabet snap up a leading 25% market share in the digital advertising market.\nHowever, over the last year, all eyes have been on the tech giant's expanding AI efforts. Toward the end of 2023, the company impressed by debuting Gemini, a large language model that looked likely to make Alphabet competitive against cloud rivals Microsoft and Amazon.\nYet the Google company's stock is down 7% in the last month after a disappointing launch for Gemini. Alphabet held a presentation for the new AI model recently, and Gemini gave inaccurate depictions of historical figures and failed to recognize key differences between other prominent figures. The blunders forced Alphabet to take its AI image services offline for now.\nIn spite of recent headwinds, Alphabet hit nearly $70 billion in free cash flow last year. The company has a mountain to climb to get its AI tech on track and keep up with competitors, but Alphabet is financially secure and has the funds to keep investing in its business.\nDespite having a slower start than their respective rivals in AI, AMD and Alphabet have promising prospects in the industry over the long term. However, for now, Alphabet's recent software fumbles make AMD's chip business feel more secure.\nMeanwhile, earnings per share (EPS) estimates suggest AMD might have more room to run over the next two years.\nThe chart shows AMD's earnings could reach just over $7 per share in the next two fiscal years, while Alphabet's may hit nearly $9 per share. On the surface, Alphabet looks like the clear winner.\nHowever, multiplying these figures by the companies' recent forward price-to-earnings ratios (AMD's 58 and Alphabet's 20) yields projected stock prices of $418 for AMD and $176 for Alphabet. Based on their current positions, these projections would see AMD's stock rise 98% and Alphabet's 30% by fiscal 2026.\nAlongside a more reliable role in AI, AMD's stock is a screaming buy over Alphabet this month.\nWhere to invest $1,000 right now\nWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.*\nThey just revealed what they believe are the 10 best stocks for investors to buy right now… and Advanced Micro Devices made the list -- but there are 9 other stocks you may be overlooking.\nSee the 10 stocks\n*Stock Advisor returns as of March 8, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBetter AI Stock: AMD vs. Alphabet was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-01T15:45:00.000Z",
        "Title": "Alphabet is on Sale: Will Buffett Buy Shares?",
        "Author": "  Tracey Ryniec ",
        "Text": "(0:30) - Should You Buy More of The Magnificent 7?\n(8:00) - If Warren Buffett Buys Apple, Should You Buy Too?\n(32:00) - Episode Roundup: AAPL, GOOGL, BRK.B\n Podcast@Zacks.com\n \nWelcome to Episode #360 of the Value Investor Podcast.\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nThere is a lot of angst on Wall Street about the stocks of Apple (AAPL) and Alphabet (GOOGL) this year. Both are off record highs set earlier in the year and neither one is performing like NVIDIA, up triple digits.\nBerkshire Hathaway (BRK.B)owns Apple shares. Warren Buffett bought a big position in the company in 2016 and considers it one of the four lynchpins of Berkshire Hathaway’s business.\nBuffett loves it so much, he gushes about Apple at nearly every Berkshire Hathaway annual meeting.\nBerkshire Hathaway Bought Apple on the Cheap\nIt may be hard to believe today, but Apple was out of favor in 2016 when Buffett dove in. It traded with a forward P/E as low as 10.6 that year. Apple’s 2024 forward P/E is 28. No one is calling Apple a value stock in 2024.\nApple also had a cheap P/S ratio in 2016. The high that year was 2.8 and the low was 2.3. Currently, Apple trades with a P/S ratio of 7.3. It’s not over 10, which is considered expensive, but 7.3 is above the current average of the S&P 500 at 4.2.\nApple also had an attractive P/B ratio in 2016. It’s high was 4.7 and low was 3.9 that year. A P/B under 3.0 usually indicates value. Currently, Apple’s P/B ratio is a sky-high 38.\nCriteria for Buffett and Berkshire Hathaway to Buy a Stock\nBuffett loves companies with great free cash flow and Alphabet has doubled its free cash flow since 2019. In 2023, it had annual free cash flow of $69.5 billion, up from $30.9 billion in 2019.\nBuffett also likes companies that are doing share buybacks and Alphabet announced a $70 billion buyback in April 2023.\nDoes Alphabet have a moat? Berkshire Hathaway looks for companies with competitive advantages of a “moat.”\nAlphabet’s advertising revenue has been a moat over the last two decades, although some are questioning whether AI might eat into it. But Alphabet also has YouTube, which recently posted its best quarter for ad revenue ever.\nBuffett also likes companies with great management who have been in a place for years. Alphabet fits that bill.\nWill Buffett Buy Shares of Alphabet for the Berkshire Hathaway Stock Portfolio? \nTune into this week’s podcast for Tracey’s analysis of Alphabet’s valuation. The stock is on sale. But is it cheap enough for Buffett to dive in?\n[In full disclosure, Tracey owns shares of GOOGL in her personal portfolio.]\n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-01T12:01:36.000Z",
        "Title": "Is Alphabet (NASDAQ:GOOGL) Using Too Much Debt?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "Some say volatility, rather than debt, is the best way to think about risk as an investor, but Warren Buffett famously said that 'Volatility is far from synonymous with risk.' When we think about how risky a company is, we always like to look at its use of debt, since debt overload can lead to ruin. As with many other companies Alphabet Inc. (NASDAQ:GOOGL) makes use of debt. But should shareholders be worried about its use of debt?\nDebt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy. Part and parcel of capitalism is the process of 'creative destruction' where failed businesses are mercilessly liquidated by their bankers. However, a more usual (but still expensive) situation is where a company must dilute shareholders at a cheap share price simply to get debt under control. Of course, plenty of companies use debt to fund growth, without any negative consequences. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n See our latest analysis for Alphabet \nThe chart below, which you can click on for greater detail, shows that Alphabet had US$12.9b in debt in December 2023; about the same as the year before. But it also has US$110.9b in cash to offset that, meaning it has US$98.0b net cash.\nThe latest balance sheet data shows that Alphabet had liabilities of US$81.8b due within a year, and liabilities of US$37.2b falling due after that. Offsetting this, it had US$110.9b in cash and US$48.0b in receivables that were due within 12 months. So it can boast US$39.9b more liquid assets than total liabilities.\nThis surplus suggests that Alphabet has a conservative balance sheet, and could probably eliminate its debt without much difficulty. Simply put, the fact that Alphabet has more cash than debt is arguably a good indication that it can manage its debt safely.\nAnd we also note warmly that Alphabet grew its EBIT by 18% last year, making its debt load easier to handle. There's no doubt that we learn most about debt from the balance sheet. But it is future earnings, more than anything, that will determine Alphabet's ability to maintain a healthy balance sheet going forward. So if you're focused on the future you can check out this free report showing analyst profit forecasts.\nBut our final consideration is also important, because a company cannot pay debt with paper profits; it needs cold hard cash. Alphabet may have net cash on the balance sheet, but it is still interesting to look at how well the business converts its earnings before interest and tax (EBIT) to free cash flow, because that will influence both its need for, and its capacity to manage debt. Over the last three years, Alphabet recorded free cash flow worth a fulsome 81% of its EBIT, which is stronger than we'd usually expect. That positions it well to pay down debt if desirable to do so.\nWhile it is always sensible to investigate a company's debt, in this case Alphabet has US$98.0b in net cash and a decent-looking balance sheet. The cherry on top was that in converted 81% of that EBIT to free cash flow, bringing in US$69b. So is Alphabet's debt a risk? It doesn't seem so to us. Over time, share prices tend to follow earnings per share, so if you're interested in Alphabet, you may well want to click here to check an interactive graph of its earnings per share history.\nIf, after all that, you're more interested in a fast growing company with a rock-solid balance sheet, then check out our list of net cash growth stocks without delay.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-21T07:40:15.000Z",
        "Title": "Is Alphabet (GOOG) Stock Trading at a Reasonable Valuation?",
        "Author": "  Soumya Eswaran ",
        "Text": "Ruane, Cunniff & Goldfarb, an investment adviser managing Sequoia Fund, released its Q4 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, the fund returned 13.31% compared to an 11.69% return for the S&P 500 Index. The fund generated a 27.83% return in 2023 compared to a 26.29% return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nSequoia Fund featured stocks like Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On March 20, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $149.68 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 3.00%, and its shares gained 40.86% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.855 trillion.\nSequoia Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:\n\"Shares in Alphabet Inc. (NASDAQ:GOOG) returned 58% last year, essentially double the return of the Index. Business performance was solid. Google Search and YouTube advertising continued to grow last year, with YouTube subscriptions growing nicely and enjoying a bump last fall as the NFL made the platform the exclusive home of NFL Sunday Ticket in the US in a deal signed through 2030. In the first quarter of 2023, Google Cloud achieved profitability for the first time. It stayed in the black over the balance of the year, as revenues grew to an annualized run-rate of over $33 billion. In Other Bets, Waymo's driverless fleet surpassed seven million fully autonomous miles driven while safety issues forced a key competitor out of the market. We expect Alphabet’s revenues and earnings per share to be up high-single digits in 2023.\nA laptop and phone open to Google's services in an everyday setting.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Alphabet Inc. (NASDAQ:GOOG) was held by 166 hedge fund portfolios, compared to 163 in the previous quarter, according to our database.\nWe discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Diamond Hill Capital's views on the company. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\nSuggested Articles:\n20 Most Food Insecure States in the US\n15 Money Mistakes to Avoid in Your 30s\n20 Countries with Most Personal Space\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-03-09T12:00:13.000Z",
        "Title": "Could The Market Be Wrong About Alphabet Inc. (NASDAQ:GOOGL) Given Its Attractive Financial Prospects?",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "With its stock down 7.2% over the past month, it is easy to disregard Alphabet (NASDAQ:GOOGL). However, a closer look at its sound financials might cause you to think again. Given that fundamentals usually drive long-term market outcomes, the company is worth looking at. Specifically, we decided to study Alphabet's  ROE in this article.\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. Simply put, it is used to assess the profitability of a company in relation to its equity capital.\n See our latest analysis for Alphabet \nThe formula for ROE is:\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\nSo, based on the above formula, the ROE for Alphabet is:\n26% = US$74b ÷ US$283b (Based on the trailing twelve months to December 2023).\nThe 'return' is the yearly profit. Another way to think of that is that for every $1 worth of equity, the company was able to earn $0.26 in profit.\nThus far, we have learned that ROE measures how efficiently a company is generating its profits. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes.\nFirstly, we acknowledge that Alphabet has a significantly high ROE. Second, a comparison with the average ROE reported by the industry of 8.7% also doesn't go unnoticed by us. This probably laid the groundwork for Alphabet's moderate 18% net income growth seen over the past five years.\nAs a next step, we compared Alphabet's net income growth with the industry, and pleasingly, we found that the growth seen by the company is higher than the average industry growth of 7.8%.\nEarnings growth is an important metric to consider when valuing a stock. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. Doing so will help them establish if the stock's future looks promising or ominous. Is GOOGL fairly valued? This infographic on the company's intrinsic value  has everything you need to know.\nAlphabet doesn't pay any dividend, meaning that all of its profits are being reinvested in the business, which explains the fair bit of earnings growth the company has seen.\nIn total, we are pretty happy with Alphabet's performance. Particularly, we like that the company is reinvesting heavily into its business, and at a high rate of return. Unsurprisingly, this has led to an impressive earnings growth. That being so, a study of the latest analyst forecasts show that the company is expected to see a slowdown in its future earnings growth. Are these analysts expectations based on the broad expectations for the industry, or on the company's fundamentals? Click here to be taken to our analyst's forecasts page for the company.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-13T15:36:00.000Z",
        "Title": "Alphabet (GOOGL) Aids Healthcare Offerings With Gen AI Tool",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL Google is leaving no stone unturned to bolster its healthcare offerings on the back of growing generative AI capabilities, which are presently acting as key growth catalysts for the company. Its shares have surged 47.4% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.2%.Recently, Google launched Vertex AI Search for Healthcare, a generative AI powered tool intended for the healthcare industry.The tool utilizes generative AI to assist clinicians in searching for information from patient notes, scanned documents and other clinical data. The tool's understanding of medical terminology and specific data points provides transparency and reduces hallucinations.Google's Vertex AI Search for Healthcare integrates with its other generative AI-powered healthcare tools like Health Data Engine and MedLM, enhancing data interoperability and providing a range of algorithms for healthcare use cases.Alphabet is expected to gain solid traction across clinicians, researchers and health and life science organizations on the back of its latest move.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nApart from Vertex AI Search for Healthcare, Alphabet launched MedLM, a family of generative AI models intended for the healthcare industry. These models offer medical documentation testing, drug development research and chatbot provider identification.The company also announced that the Healthcare Data Engine is now globally accessible, providing interoperable patient data and clinical insights in FHIR format, enhancing AI's effectiveness in the healthcare industry.Additionally, Google announced that it will be expanding its MedLM capabilities with MedLM for Chest X-rays to help with their classification for operational, screening and diagnostics use cases, and a Condition Summary feature to enhance task-specific API capabilities.All the above-mentioned endeavors will aid the company in capitalizing on growth opportunities present in the global generative AI in the healthcare market space. Per a Grand View Research report, global generative AI in the healthcare market is expected to witness a CAGR of 36.7% between 2023 and 2030.Moreover, expanding healthcare offerings will boost the company's portfolio strength, potentially enhancing its overall financial performance in the upcoming period.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%.\nThe latest efforts in the healthcare space will likely allow this Zacks Rank #3 (Hold) company to strengthen its competitive edge against rivals like Amazon AMZN, Microsoft MSFT and Oracle ORCL, which are also making substantial efforts to strengthen their footing in the healthcare sector by leveraging generative AI capabilities.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Recently, Amazon’s cloud computing arm, Amazon Web Services, expanded its collaboration with Philips to improve digital workflow integration and AI/ML capabilities in pathology labs and healthcare organizations.Amazon’s latest partnership will enhance digital pathology solutions, enabling labs to efficiently manage and analyze growing data, optimize workflows and integrate with existing healthcare systems for holistic patient care.Meanwhile, Microsoft partnered with Epic to deploy various technologies, such as clinical note summarization, medical coding suggestions and data exploration tools, leveraging its generative AI capabilities in the healthcare space.Further, Microsoft’s cloud business Azure introduced new capabilities to free up clinicians' information, including patient timelines and clinical report simplification using generative AI, enabling healthcare professionals to extract and organize unstructured data for better understanding.Oracle, on the other hand, recently enhanced its Health Data Intelligence suite, introducing a new generative AI service to boost care management efficiency. The suite enables healthcare stakeholders to use data for patient health improvement, care delivery and operational efficiency.Earlier, Oracle also introduced patient-facing tools, including generative AI answers, voice commands for appointment scheduling and chats with clinicians to remind patients about lab results.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-26T19:02:10.000Z",
        "Title": "Google’s founders didn’t market test Alphabet’s name before launching the now $1.9 trillion juggernaut. Here’s the advice Steve Jobs gave Larry Page",
        "Author": "  Sasha Rogelberg ",
        "Text": "Even from Google’s inception, cofounders Larry Page and Sergey Brin considered the company’s potential for astronomical growth. Named after “googol,” the term for the numeral 1 with 100 zeros behind it, Google, then just a search engine founded in 1998, would become as large as the internet would allow.\nThe company has far exceeded the parameters of just the internet. Valued at about $1.9 trillion, Alphabet Inc., Google’s parent company, ranks No. 1 on Fortune’s 2024 Most Innovative Companies list. Broken into three segments—Google Services, Google Cloud, and Other Bets—Alphabet’s reach spans from Android, Chrome, YouTube, and its Bard AI chatbot under its Services umbrella, to cloud computing under its Cloud umbrella, to private equity fund CapitalG, DeepMind AI research, and Waymo under its Other Bets umbrella. Google Services makes up 90% of the company’s revenue, Fortune calculated from Alphabet’s 2023 fourth-quarter earnings report.\nPage, the eighth-richest person in the world with a net worth of about $136 billion, according to the Bloomberg Billionaires Index, has certainly reaped the rewards of Alphabet’s success. With stints as CEO of Google from 1997 to 2001 and 2011 to 2015, and of Alphabet until 2019, Page remains a board member and shareholder of his company, effectively controlling it alongside cofounder Brin.\nTuesday is Page’s 51st birthday, and while he’s another year older and wiser, it was Apple cofounder Steve Jobs who imparted some prescient wisdom about the company’s future, which now boasts the sixth-largest market capitalization in the world.\nPage visited Jobs toward the end of Jobs’ life in 2011 to receive some frank advice from his mentor: “The main thing I stressed was focus,” Jobs said, according to Walter Isaacson, author of Jobs’ biography. “It’s now all over the map. What are the five products you want to focus on? Get rid of the rest, because they’re dragging you down. They’re turning you into Microsoft. They’re causing you to turn out products that are adequate but not great.”\n“He was right,” Page told Fortune CEO Alan Murray at Fortune’s Global Forum in 2015, just days after Alphabet’s October founding. “I mean, he did fine as well.”\nPage did listen to his advice at first, telling employees to focus on Android products and the now-defunct Google+. But the growth of Alphabet suggested the company was poised for bigger things, and more of them.\nAlphabet was designed as a container for Google’s future ventures, even its more esoteric ideas such as glucose-monitoring contact lenses. While Page conceded that Jobs was correct on some level, he also believed that Alphabet’s ventures were interconnected and that energy, telecommunications, and transportation all fit under its umbrella.\n“I always thought it was kind of stupid if you have this big company, and you can only do, like, five things,” Page said in a 2014 fireside chat with Khosla Ventures, taking a jab at Jobs.\nPage and Brin were so certain of Alphabet’s name and purpose that they didn’t even market test it.\n“I wanted to have a name that people would be proud to work for,” Page said. “But [I] actually didn’t want it to be too catchy because the idea really wasn’t to have a consumer brand in the way that Google is, but really a brand for companies to be part of.”\nAlphabet was a brand for its employees and investors, Page said. But he doesn’t take credit for the name.\n“I chose Google, so [Sergey] chose Alphabet.”\nThis story was originally featured on Fortune.com\n"
    },
    {
        "Date": "2024-03-21T15:20:00.000Z",
        "Title": "Alphabet (GOOGL) Boosts Healthcare Efforts With Latest AI Move",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL division Google revealed a few of its latest AI-backed efforts to deepen its penetration into the multi-trillion healthcare industry at its annual health event, which took place in New York City.Reportedly, a new AI feature powered by the company’s advanced AI model called Gemini is being developed by Google Research and Fitbit. The feature will help train Fitbit users on their personal health by leveraging data collected from their wristbands.Further, the search giant intends to provide AI-powered screenings for tuberculosis, lung cancer and breast cancer in India in collaboration with Apollo Radiology International. This initiative, which is currently subject to regulatory approvals, is meant to deliver 3 million free scans over the next 10 years.Google is also making efforts to enhance health information on its search engine and YouTube.\n \nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nThe latest initiatives are in sync with Alphabet’s aggressive efforts to revolutionize the healthcare industry with the help of AI.Apart from these endeavors, Google recently launched Vertex AI Search for Healthcare, a generative AI-powered tool intended for the healthcare industry. The tool utilizes generative AI to assist clinicians search for information from patient notes, scanned documents and other clinical data. The tool's understanding of medical terminology and specific data points provides transparency and reduces hallucinations.Further, the company’s launch of MedLM, a family of generative AI models designed for the healthcare industry, remains a major positive. These models offer medical documentation testing, drug development research and chatbot provider identification.Google intends to expand MedLM capabilities with MedLM for Chest X-rays to help with their classification for operational, screening and diagnostics use cases, and a Condition Summary feature to enhance task-specific API capabilities.The company also offers Healthcare Data Engine, which provides interoperable patient data and clinical insights in FHIR format.The above-mentioned endeavors will aid the company in capitalizing on the growing demand for generative AI in the healthcare industry.Per a Global Market Insights report, generative AI in the healthcare market is expected to reach $22.1 billion by 2032, witnessing a CAGR of 32.6% between 2024 and 2032.\nA Precedence Research Report shows that the market is expected to hit $21.74 billion by 2032, seeing a CAGR of 35.1% over 2023-2032.\nAlphabet, which currently carries a Zacks Rank #3 (Hold), has intensified the healthcare battle with its above-mentioned efforts for its peers like Amazon AMZN, Microsoft MSFT and Oracle ORCL, which are also making concerted efforts to expand their footprints in the promising healthcare space.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.In this regard, Amazon’s extended collaboration with Philips to improve digital workflow integration and AI/ML capabilities in pathology labs and healthcare organizations with the support of its cloud computing platform, Amazon Web Services, remains noteworthy.This partnership will enhance digital pathology solutions, enabling labs to efficiently manage and analyze growing data, optimize workflows and integrate with existing healthcare systems for holistic patient care.Meanwhile, Microsoft’s partnership with Epic, which is about developing and integrating generative AI into healthcare by combining the scale and power of Azure OpenAI Service with the latter’s electronic health record (EHR) software, is a positive.Microsoft Azure’s introduction of the latest capabilities to free up clinicians' information, including patient timelines and clinical report simplification using generative AI, enabling healthcare professionals to extract and organize unstructured data for better understanding, is noteworthy.Oracle recently enhanced its Health Data Intelligence suite by introducing a generative AI service to boost care management efficiency. The suite enables healthcare stakeholders to use data for patient health improvement, care delivery and operational efficiency.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-04-01T11:00:00.000Z",
        "Title": "Better AI Buy: Microsoft vs. Alphabet Stock",
        "Author": "  Jeremy Bowman and Anders Bylund, The Motley Fool ",
        "Text": "After the launch of ChatGPT, Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) emerged as top rivals, and that battle has persisted. Microsoft has aligned itself with ChatGPT parent OpenAI, while Alphabet has sought to challenge its leadership with products like Bard and later Gemini. So which artificial intelligence (AI) stock is the better buy?\nJeremy Bowman (Microsoft): The question of whether to build or buy is a common one in technology, and in generative AI, Microsoft and Alphabet have largely gone in different directions in this regard.\nMicrosoft has tied its fortunes to OpenAI, the ChatGPT parent, through a reported $13 billion investment, and that has enabled Microsoft to essentially use OpenAI's technology as its own. As a result, the tech giant has been able to implement OpenAI's technology in products like its Azure cloud infrastructure services, GitHub code repository, Office productivity suite, and Bing search engine.\nThose moves are already having an impact as Microsoft said that AI added 6 percentage points to Azure's growth in the most recent quarter.\nMicrosoft's diversification also acts as a competitive advantage here. Unlike Alphabet, which makes a majority of its revenue from search advertising, Microsoft has a wide array of products that span enterprise software, video games, cloud computing, social media, and more, and that gives it more opportunities to leverage the power of AI.\nMicrosoft has also been more aggressive in AI than Alphabet has. CEO Satya Nadella has apparently been planning for this moment for years, as Microsoft first invested in back in 2019.\nAlphabet has also been investing in AI for several years, but the company has been more hesitant to release new products, and when it has it hasn't always gone well. The initial presentation for Bard was sloppy and widely panned, and Gemini has been criticized for historical inaccuracies.\nMicrosoft shows no intention of slowing down in AI; it just hired Deepmind co-founder Mustafa Suleyman, who also co-founded the recently shuttered Inflection AI. Microsoft stock may be expensive, but it deserves to trade at a premium. It will be hard to catch the AI leader.\nAnders Bylund (Alphabet): I have nothing but respect for Microsoft, but Redmond's finest can't measure up to Alphabet's ultimate long-term planning.\nAlphabet's visionary approach and unwavering commitment to pushing the boundaries of innovation make it a compelling choice for investors seeking long-term growth. The company's core business -- online search and advertising under the Google banner -- dominates the search engine market. However, Alphabet's ambitions extend far beyond search, with the company consistently investing in cutting-edge technologies that have the potential to reshape entire industries.\nOne such area is artificial intelligence, where Alphabet's research and development efforts have produced groundbreaking advancements. From natural language processing to computer vision, Alphabet's AI technologies are being applied in diverse fields, from healthcare research to self-driving vehicles.\nMoreover, Alphabet's commitment to moonshot projects through its X division showcases its willingness to take calculated risks in pursuit of revolutionary innovations. Projects like Intrinsic, Alphabet's industrial robotics project, and Loon, which aims to provide internet access to remote areas via high-altitude balloons, exemplify the company's audacious vision and long-term thinking.\nLong story short, Alphabet is ready to roll with the punches as the tech market evolves. Furthermore, the stock is much more affordable than Microsoft, whose stock has soared on the wings of its deep OpenAI partnership. You can pick up Alphabet shares at the reasonable price of 6 times sales or 27 times free cash flow today. Double those numbers to get an estimate of Microsoft's ratios.\nIn my view, Microsoft's stock looks overdue for a correction while Alphabet is getting ready to run higher. That's an easy choice.\nWhere to invest $1,000 right now\nWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.*\nThey just revealed what they believe are the 10 best stocks for investors to buy right now… and Microsoft made the list -- but there are 9 other stocks you may be overlooking.\nSee the 10 stocks\n*Stock Advisor returns as of March 25, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Anders Bylund has positions in Alphabet. Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBetter AI Buy: Microsoft vs. Alphabet Stock was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-11T21:45:18.000Z",
        "Title": "Alphabet (GOOGL) Increases Despite Market Slip: Here's What You Need to Know",
        "Author": "  Zacks Equity Research ",
        "Text": "The most recent trading session ended with Alphabet (GOOGL) standing at $137.67, reflecting a +1.67% shift from the previouse trading day's closing. The stock exceeded the S&P 500, which registered a loss of 0.11% for the day. Elsewhere, the Dow saw an upswing of 0.12%, while the tech-heavy Nasdaq depreciated by 0.41%.\nPrior to today's trading, shares of the internet search leader had lost 9.12% over the past month. This has lagged the Computer and Technology sector's gain of 1.42% and the S&P 500's gain of 2.7% in that time.\nAnalysts and investors alike will be keeping a close eye on the performance of Alphabet in its upcoming earnings disclosure. In that report, analysts expect Alphabet to post earnings of $1.49 per share. This would mark year-over-year growth of 27.35%. Meanwhile, the latest consensus estimate predicts the revenue to be $65.95 billion, indicating a 13.58% increase compared to the same quarter of the previous year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $6.77 per share and revenue of $286.48 billion. These totals would mark changes of +16.72% and +11.68%, respectively, from last year.\nInvestors should also take note of any recent adjustments to analyst estimates for Alphabet. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Over the past month, there's been a 0.16% rise in the Zacks Consensus EPS estimate. At present, Alphabet boasts a Zacks Rank of #3 (Hold).\nInvestors should also note Alphabet's current valuation metrics, including its Forward P/E ratio of 19.99. This signifies a discount in comparison to the average Forward P/E of 29.07 for its industry.\nWe can also see that GOOGL currently has a PEG ratio of 1.25. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. By the end of yesterday's trading, the Internet - Services industry had an average PEG ratio of 2.25.\nThe Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 152, this industry ranks in the bottom 40% of all industries, numbering over 250.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-23T15:00:00.000Z",
        "Title": "2 Stocks More Magnificent Than Alphabet",
        "Author": "  Jason Hall and Jeff Santoro, The Motley Fool ",
        "Text": "In this video, Motley Fool contributors Jason Hall and Jeff Santoro discuss how Roku (NASDAQ: ROKU) and The Trade Desk (NASDAQ: TTD) compare to ad giant Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL).\n*Stock prices used were from the afternoon of March 20, 2024. The video was published on March 22, 2024.\nShould you invest $1,000 in Roku right now?\nBefore you buy stock in Roku, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Roku wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Jason Hall has positions in The Trade Desk. Jeff Santoro has positions in Roku and The Trade Desk. The Motley Fool has positions in and recommends Alphabet, Roku, and The Trade Desk. The Motley Fool has a disclosure policy. Jason Hall is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link, they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\n2 Stocks More Magnificent Than Alphabet was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-07T14:45:04.000Z",
        "Title": "Why Alphabet (GOOGL) is a Top Growth Stock for the Long-Term",
        "Author": "  Zacks Equity Research ",
        "Text": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\nWhy This 1 Growth Stock Should Be On Your Watchlist\nFor growth investors, a company's financial strength, overall health, and future outlook take precedence, so they'll want to zero in on the Growth Style Score. This Score examines things like projected and historical earnings, sales, and cash flow to find stocks that will generate sustainable growth over time.\nAlphabet (GOOGL)\nAlphabet is one of the most innovative companies in the modern technological age. Over the last few years, the company has evolved from primarily being a search-engine provider to cloud computing, ad-based video and music streaming, autonomous vehicles, healthcare providers and others.\nGOOGL sits at a Zacks Rank #3 (Hold), holds a Growth Style Score of B, and has a VGM Score of B. Earnings and sales are forecasted to increase 16.7% and 11.7% year-over-year, respectively.\n11 analysts revised their earnings estimate upwards in the last 60 days, and the Zacks Consensus Estimate has increased $0 to $6.77 per share for 2024. GOOGL boasts an average earnings surprise of 7.2%.\nAlphabet is also cash rich. The company has generated cash flow growth of 15.1%, and is expected to report cash flow expansion of 16.7% in 2024.\nInvestors should take the time to consider GOOGL for their portfolios due to its solid Zacks Rank rating, notable growth metrics, and impressive Growth and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-27T08:12:12.000Z",
        "Title": "Is Alphabet (GOOG) Trading at an Attractive Valuation?",
        "Author": "  Soumya Eswaran ",
        "Text": "Pershing Square Holdings, an investment holding company, released its fourth quarter 2023 investor letter. A copy of the same can be downloaded here. During the year, the fund generated a NAV performance of 26.7% versus 26.3% for the principal benchmark the S&P 500 index. In 2023, the portfolio companies performed exceptionally well, significantly increasing their stock prices. Portfolio companies sustained growth in revenue, profitability, and shareholder value despite two conflicts and a prolonged increase in interest rates. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nPershing Square Holdings featured stocks like Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On March 26, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $151.70 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was 10.38%, and its shares gained 48.87% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.878 trillion.\nPershing Square Holdings stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:\n\"In early 2023, we initiated an investment in Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, at a highly attractive valuation during a period when apprehension about the company's competitive positioning in AI overshadowed the high-quality nature of its business and strong growth prospects.\nA laptop and phone open to Google's services in an everyday setting.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Alphabet Inc. (NASDAQ:GOOG) was held by 166 hedge fund portfolios, compared to 163 in the previous quarter, according to our database.\nWe discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared Michael Burry’s top stock picks for 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n10 Best Stocks To Buy For Grandchildren\n27 Passive Income Ideas to Make Money & Build Wealth in 2024\n10 Stocks Receiving a Massive Vote of Approval From Wall Street Analysts\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-03-25T13:00:16.000Z",
        "Title": "Alphabet Inc. (GOOGL) is Attracting Investor Attention: Here is What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet (GOOGL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this internet search leader have returned +4.7%, compared to the Zacks S&P 500 composite's +3.1% change. During this period, the Zacks Internet - Services industry, which Alphabet falls in, has gained 4%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nAlphabet is expected to post earnings of $1.49 per share for the current quarter, representing a year-over-year change of +27.4%. Over the last 30 days, the Zacks Consensus Estimate has changed 0%.\nThe consensus earnings estimate of $6.77 for the current fiscal year indicates a year-over-year change of +16.7%. This estimate has remained unchanged over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $7.75 indicates a change of +14.5% from what Alphabet is expected to report a year ago. Over the past month, the estimate has changed -0.1%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Alphabet.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Alphabet, the consensus sales estimate for the current quarter of $65.95 billion indicates a year-over-year change of +13.6%. For the current and next fiscal years, $290.4 billion and $322.55 billion estimates indicate +13.2% and +11.1% changes, respectively.\nLast Reported Results and Surprise History\nAlphabet reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago.\nCompared to the Zacks Consensus Estimate of $70.77 billion, the reported revenues represent a surprise of +2.19%. The EPS surprise was +2.5%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-25T21:45:22.000Z",
        "Title": "Alphabet Inc. (GOOG) Declines More Than Market: Some Information for Investors",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet Inc. (GOOG) ended the recent trading session at $151.15, demonstrating a -0.41% swing from the preceding day's closing price. This change lagged the S&P 500's daily loss of 0.31%. Elsewhere, the Dow lost 0.41%, while the tech-heavy Nasdaq lost 0.27%.\nThe company's stock has climbed by 4.46% in the past month, exceeding the Computer and Technology sector's gain of 3.86% and the S&P 500's gain of 3.05%.\nAnalysts and investors alike will be keeping a close eye on the performance of Alphabet Inc. in its upcoming earnings disclosure. The company is predicted to post an EPS of $1.49, indicating a 27.35% growth compared to the equivalent quarter last year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $65.95 billion, up 13.58% from the year-ago period.\nGOOG's full-year Zacks Consensus Estimates are calling for earnings of $6.77 per share and revenue of $286.48 billion. These results would represent year-over-year changes of +16.72% and +11.68%, respectively.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Alphabet Inc. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.03% decrease. Alphabet Inc. currently has a Zacks Rank of #3 (Hold).\nIn the context of valuation, Alphabet Inc. is at present trading with a Forward P/E ratio of 22.41. This indicates a discount in contrast to its industry's Forward P/E of 25.97.\nMeanwhile, GOOG's PEG ratio is currently 1.4. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. The Internet - Services was holding an average PEG ratio of 2.21 at yesterday's closing price.\nThe Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 74, this industry ranks in the top 30% of all industries, numbering over 250.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-27T15:24:00.000Z",
        "Title": "Alphabet (GOOGL) Adds Verification Feature in Google Wallet",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL Google recently added a new “Verification settings” feature in Google Wallet for Android, enabling users to choose whether to verify their identity when using payment methods and passes.Notably, the new “Verification settings” feature leads to a \"Transit payments\" option that enables user identity verification before paying with a credit or debit card.Moreover, it also allows users to disable the default \"Verification required\" toggle on their default credit or debit card, allowing them to pay for transit without verification.Alphabet is expected to gain solid traction across Android users on the back of its latest move.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nApart from the Verification settings feature, Google now enables Google Wallet to import data from confirmation emails, automatically pulling movie tickets and travel boarding passes from Gmail accounts.Alphabet also announced Google Wallet updates to support open-loop payment systems, providing a dedicated page for recent activity and ride history, showing saved fare caps, connected payment methods and network-specific offerings.Additionally, the company has added 44 new banks and credit unions to Google Wallet’s list of over 3,000 banks and credit unions. The additions include local banks, credit unions, and prepaid debit cards.All the above-mentioned endeavors will likely aid Alphabet in capitalizing on growth opportunities present in the global digital wallet market. Per The Business Research Company report, the digital wallet market is expected to hit $47.7 billion in 2024 and reach $97.54 billion by 2033, witnessing a CAGR of 19.6% between 2024 and 2033.Moreover, growing Google Wallet efforts will further bolster its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have rallied 49.1% in the past year compared with the Zacks Computer & Technology sector’s growth of 47.9%.The strengthening Google Services segment is expected to aid its overall financial performance in the near term.The Zacks Consensus Estimate for 2024 total revenues stands at $290.4 billion, indicating year-over-year growth of 13.2%.\nGrowing Google Wallet efforts will aid Alphabet to compete well with some notable industry players like Microsoft MSFT and Apple AAPL, which are also making strong efforts to boost their presence in the booming digital wallet space.Microsoft is enjoying the growing momentum of its Edge Wallet with new feature updates.Microsoft’s Wallet app update to include the integration of a cryptocurrency wallet, providing real-time updates on cryptocurrency value fluctuations and logging transactions, remains noteworthy. The \"explore\" tab updates users on cryptocurrency news, while the \"assets\" tab displays NFTs.Meanwhile, Apple is riding on the success of its Wallet app on iPhone or Apple Watch, which securely stores various cards, IDs and other items, allowing users to carry more while minimizing their device's size.\nCurrently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is Badger Meter BMI, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Shares of Badger Meter have increased 32.7% in the past year. The long-term earnings growth rate for BMI is 12.27%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nBadger Meter, Inc. (BMI) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-11T21:45:18.000Z",
        "Title": "Alphabet Inc. (GOOG) Advances While Market Declines: Some Information for Investors",
        "Author": "  Zacks Equity Research ",
        "Text": "The most recent trading session ended with Alphabet Inc. (GOOG) standing at $138.94, reflecting a +1.94% shift from the previouse trading day's closing. The stock outperformed the S&P 500, which registered a daily loss of 0.11%. At the same time, the Dow added 0.12%, and the tech-heavy Nasdaq lost 0.41%.\nShares of the company witnessed a loss of 9.27% over the previous month, trailing the performance of the Computer and Technology sector with its gain of 1.42% and the S&P 500's gain of 2.7%.\nThe investment community will be paying close attention to the earnings performance of Alphabet Inc. in its upcoming release. On that day, Alphabet Inc. is projected to report earnings of $1.49 per share, which would represent year-over-year growth of 27.35%. At the same time, our most recent consensus estimate is projecting a revenue of $65.95 billion, reflecting a 13.58% rise from the equivalent quarter last year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $6.77 per share and revenue of $286.48 billion. These totals would mark changes of +16.72% and +11.68%, respectively, from last year.\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Alphabet Inc. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, there's been a 0.16% rise in the Zacks Consensus EPS estimate. Alphabet Inc. currently has a Zacks Rank of #3 (Hold).\nLooking at its valuation, Alphabet Inc. is holding a Forward P/E ratio of 20.12. This denotes a discount relative to the industry's average Forward P/E of 29.07.\nInvestors should also note that GOOG has a PEG ratio of 1.26 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Internet - Services industry had an average PEG ratio of 2.25 as trading concluded yesterday.\nThe Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 152, this industry ranks in the bottom 40% of all industries, numbering over 250.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-05T16:46:00.000Z",
        "Title": "Alphabet (GOOGL) Enhances Google Maps With New Feature",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet’s GOOGL Google is gaining strong momentum in the digital map space on the back of continuous enhancements in Google Maps.In this regard, the company announced a feature on Google Maps that shows entrances for buildings to some select users, addressing the issue of navigating to specific building portions on the map.This change is aimed at improving the user experience and ensuring accurate directions for businesses or locations.Alphabet is expected to gain solid traction across Android users on the back of this latest feature.\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\nApart from the latest introduction, Google added \"glanceable directions\" for Maps on Android and iOS, providing live ETAs and directions on the device's lock screen, using regular system notifications.Further, Google introduced wearable and navigation-related updates, including public transit directions in Google Maps for Wear OS, alongside driving, cycling and walking, and providing recommended routes and compass-guided map views.The company is also set to introduce additional features for its Maps application, which will allow users to delete place-related activity on Android, with location controls like Location History and Timeline status available.All the above-mentioned endeavors will enable the company to capitalize on growth opportunities present in the global digital map market. Per a Future Market Insights report, the global digital map market is expected to reach $73.1 billion by 2033, witnessing a CAGR of 14.8% between 2023 and 2033.Moreover, growing Google Maps efforts are in sync with Alphabet’s increasing focus on bolstering its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have surged 44.5% in the past year compared with the Zacks Computer & Technology sector’s growth of 46.8%.The strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.The Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%.\nAlphabet’s growing efforts to boost its Google Maps offerings will enable it to compete well against its peers like Apple AAPL and Microsoft MSFT, which are also making concerted efforts to boost its Maps offerings.Apple is enjoying the growing momentum of its Apple Maps offerings.Notably, Apple launched Apple Business Connect, a free tool enabling businesses to manage their location place cards and customize information for over a billion users on Apple Maps, including adding photos, logos and promotions.Meanwhile, Microsoft is riding on the success of Bing Maps with new feature updates.Microsoft introduced live traffic updates on Bing Maps, enabling users to plan their journeys more efficiently by providing real-time information about traffic conditions during commutes.\nCurrently, Alphabet carries a Zacks Rank #3 (Hold).A better-ranked stock in the broader technology sector is CrowdStrike CRWD, sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.Shares of CrowdStrike have gained 25.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 36.07%\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nCrowdStrike (CRWD) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-21T06:30:49.000Z",
        "Title": "Alphabet Inc CEO Sundar Pichai Sells 22,500 Shares",
        "Author": "  GuruFocus Research ",
        "Text": "Alphabet Inc (NASDAQ:GOOG), the parent company of Google and a multitude of other subsidiaries that span across various sectors including technology, life sciences, investment capital, and research, has reported an insider selling event. The CEO of Alphabet Inc, Sundar Pichai, sold 22,500 shares of the company on March 20, 2024, according to a recent SEC filing.The transaction was executed with the shares priced at $148.78 each, resulting in a total sale amount of $3,347,550. This sale has adjusted Sundar Pichai's total sold shares over the past year to 157,500, with no recorded purchases of Alphabet Inc stock in the same period.\nThe insider transaction history for Alphabet Inc reveals a pattern of insider selling, with 59 insider sells and no insider buys over the past year. This trend may be of interest to current and potential investors as they evaluate the stock's performance and insider confidence.Alphabet Inc's market cap stands at $1,854,615.16 billion as of the date of the insider sale. The company's price-earnings ratio is 25.81, which is above the industry median of 21.595 but below the company's historical median price-earnings ratio.\nRegarding valuation, Alphabet Inc's stock is currently trading at a price-to-GF-Value ratio of 0.99, with a GF Value of $149.68. This indicates that the stock is Fairly Valued based on GuruFocus's intrinsic value estimate. The GF Value is determined by considering historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from Morningstar analysts.Investors and analysts often monitor insider transactions as they can provide insights into an insider's perspective on the value and prospects of the company. While the reasons behind an insider's decision to sell shares can vary and may not necessarily reflect a negative outlook, the data provided offers a factual basis for market participants to interpret and incorporate into their investment decisions.\nWarning! GuruFocus has detected 5 Warning Signs with PI.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-06T14:42:08.000Z",
        "Title": "Alphabet’s AI Missteps Are Opportunity For One Fund Manager",
        "Author": "  Sagarika Jaisinghani and Subrat Patnaik ",
        "Text": "(Bloomberg) -- Concerns about Alphabet Inc.’s artificial intelligence missteps have weighed heavily on the Google-parent’s stock, but a Boston Partners fund manager believes this has created a golden opportunity for investors.\nMost Read from Bloomberg\nOne of the Most Infamous Trades on Wall Street Is Roaring Back\nChina Has Never Canceled This Many Shipments of US Wheat\nChinese Stocks Gain 20% From Lows, Fueling Market Bottom Calls\nBoeing Whistleblower Who Raised Safety Concerns Found Dead\nThe shares trade at “a low multiple for an extraordinary business,” David Cohen, who manages just over $30 billion as a portfolio manager for Boston Partners’ large cap value strategy, said in an interview in London. “We don’t think the upside from what the company can do with AI is priced into the equity.”\nAlphabet’s misfiring Gemini AI product has been viewed as a major setback for a firm known for its technological prowess, with the company last month pausing an image generation feature that drew criticism over inaccurate historical depictions of race. That sparked concerns that one of the world’s most valuable firms over the past decade is falling behind in AI, having been overtaken by Nvidia Corp. and Amazon.com Inc.\nCohen said the advantage for Alphabet — whose stock has dropped 5% this year compared with a 13% gain for the Bloomberg Magnificent 7 Index — is that its share price doesn’t reflect its capabilities in artificial intelligence. He believes the Gemini issues can be fixed relatively easily, and that this presents “a rare opportunity for fund managers looking for a value stock with massive growth potential.”\nTypically considered a growth bet and not commonly found in so-called value portfolios, Alphabet was the fourth-biggest holding in Cohen’s Robeco BP US Large Cap Equities fund as of Jan. 31, according to the latest fact sheet. The fund, which also counts JPMorgan Chase & Co., Walmart Inc., and Berkshire Hathaway Inc. as its top holdings, has returned nearly 17% in the past year, compared with a 10% gain in the benchmark Russell 1000 Value Index, according to data compiled by Bloomberg.\n“Don’t be quick to dismiss all of Big Tech as pure-play growth stocks,” Cohen said.\nOther tech behemoths have surged this year and, as a group, are trading at exalted valuations that are often prohibitive for value fund managers.\nAlphabet trades at 18 times forward earnings, according to data compiled by Bloomberg. That’s about 35% cheaper than that of the broader Magnificent Seven group, which also includes Nvidia, Apple Inc., Microsoft Corp., Facebook-parent Meta Platforms Inc., Tesla Inc. and Amazon.com, according to data compiled by Bloomberg. Alphabet shares rose higher on Wednesday.\nWhen it comes to Alphabet’s AI missteps, “we think this is a wakeup call for Google executives,” said Cohen. “The technical fix for Gemini doesn’t appear to be costly or particularly difficult. The long-term potential for Google in AI is still extremely strong.”\n--With assistance from Michael Msika.\n(Adds stock move in eighth paragraph.)\nMost Read from Bloomberg Businessweek\nAcademics Question ESG Studies That Helped Fuel Investing Boom\nLuxury Postnatal Retreats Draw Affluent Parents Around the US\nHow Apple Sank About $1 Billion a Year Into a Car It Never Built\nThe Battle to Unseat the Aeron, the World’s Most Coveted Office Chair\nPrimaries Show Candidates Can Win on TikTok But Lose at the Polls\n©2024 Bloomberg L.P.\n"
    },
    {
        "Date": "2024-03-13T03:42:52.000Z",
        "Title": "Here’s Why Diamond Hill Select Strategy Sold Alphabet (GOOG)",
        "Author": "  Soumya Eswaran ",
        "Text": "Diamond Hill Capital, an investment management company, released its “Select Strategy” fourth-quarter 2023 investor letter. A copy of the same can be downloaded here. In Q4, the portfolio rose strongly outperforming the Russell 3000 Index and adding to calendar-year outperformance. The strategy returned 18.06% (net) in Q4 compared to a 12.07% return for the index. For the calendar year, the strategy returned 30.60% compared to a 25.96% return for the index. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nDiamond Hill Select Strategy featured stocks like Alphabet Inc. (NASDAQ:GOOG) in the Q4 2023 investor letter. Headquartered in Mountain View, California, Alphabet Inc. (NASDAQ:GOOG) is a multinational technology company. On March 12, 2024, Alphabet Inc. (NASDAQ:GOOG) stock closed at $139.62 per share. One-month return of Alphabet Inc. (NASDAQ:GOOG) was -4.61%, and its shares gained 48.14% of their value over the last 52 weeks. Alphabet Inc. (NASDAQ:GOOG) has a market capitalization of $1.728 trillion.\nDiamond Hill Select Strategy stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:\n\"Other bottom contributors included Alphabet Inc. (NASDAQ:GOOG), Lancaster Colony Corp and Lear Corp. Media and technology company Alphabet has been under pressure as the company’s cloud business has slowed. Packaged food products manufacturer Lancaster Colony has faced a challenging pricing environment, which has weighed on volumes. We exited our positions in both Alphabet and Lancaster Colony in Q4 and redeployed our capital into more attractive opportunities.\"\nA laptop and phone open to Google's services in an everyday setting.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. At the end of the fourth quarter, Alphabet Inc. (NASDAQ:GOOG) was held by 166 hedge fund portfolios, compared to 163 in the previous quarter, according to our database.\nWe discussed Alphabet Inc. (NASDAQ:GOOG) in another article and shared the list of AI stocks picked by Wall Street for 2024. In addition, please check out our hedge fund investor letters Q4 2023 page for more investor letters from hedge funds and other leading investors.\n \nSuggested Articles:\n22 Best Canva Alternatives in 2024\n20 Largest Armed Forces in the World Ranked by Active Military Personnel\n25 Countries with the Most Beautiful Roads in the World\nDisclosure: None. This article is originally published at Insider Monkey.\n"
    },
    {
        "Date": "2024-03-01T22:19:00.000Z",
        "Title": "Apple, Microsoft, Amazon, Alphabet, and Nvidia Have All Invested in Voice-Recognition Software. Here's 1 Artificial Intelligence (AI) Stock That Could Go Parabolic.",
        "Author": "  Adam Spatacco, The Motley Fool ",
        "Text": "The euphoria surrounding artificial intelligence (AI) played a major in the Nasdaq Composite's 43% return last year. Indeed, investor enthusiasm for AI has carried over into 2024 -- helping fuel the S&P 500 to record levels.\nWhile each member of the \"Magnificent Seven\" is playing a role in AI development, several companies in this cohort also share a more specific interest in voice-recognition software. Let's break down the various moves megacap tech has made in speech-powered AI assistants, and assess one stock in particular that could be set for liftoff.\nWhether you realize it or not, you probably interact with voice-based assistants almost every day.\nApple acquired AI-assistant Siri back in 2010 and has since integrated the technology across its ecosystem of hardware devices. More recently, Cupertino bought the music recognition app Shazam for $400 million.\nBoth Alphabet and Amazon have also shown a keen interest in voice-recognition applications, as each company's smart home appliances leverage this technology. Moreover, Microsoft acquired conversational AI tool Nuance a couple of years ago for $20 billion -- the third-largest acquisition in the software giant's history.\nBut most recently, semiconductor manufacturer Nvidia revealed that it has built a small stake in voice-recognition software developer SoundHound AI (NASDAQ: SOUN). Following the news of Nvidia's investment, SoundHound AI stock rocketed higher -- the stock gained 347% in the month of February.\nI find this deal with Nvidia particularly delightful because in early January, I predicted that SoundHound AI may be a stock to keep your eyes on in 2024. My thesis primarily hinged on two ideas: voice-based software tools could become increasingly popular as use cases for AI continue to evolve, since voice controls can make AI tools easier to use. Furthermore, the market's appetite for acquisitions could rise this year.\nSince SoundHound AI's trailing-12-month revenue is only $46 million, the company is still quite small. But with cumulative subscriptions and bookings backlog of $661 million, it's clear that the demand for voice-powered AI is rising -- and it's not all coming from big tech.\nConsidering that industry research sees the market for voice-recognition technology reaching $50 billion by the end of the decade, it appears to be early innings for SoundHound AI. While the stock has some momentum pushing it higher right now, this little-known AI company could emerge as a big winner in the long run.\nShould you invest $1,000 in SoundHound AI right now?\nBefore you buy stock in SoundHound AI, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoundHound AI wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of February 26, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nApple, Microsoft, Amazon, Alphabet, and Nvidia Have All Invested in Voice-Recognition Software. Here's 1 Artificial Intelligence (AI) Stock That Could Go Parabolic. was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-22T09:50:00.000Z",
        "Title": "Billionaire David Tepper Is Selling Alphabet and Nvidia Hand Over Fist, but Is Buying These \"Magnificent Seven\" Stocks",
        "Author": "  Keith Speights, The Motley Fool ",
        "Text": "Billionaire David Tepper likes artificial intelligence (AI) stocks -- the bigger, the better. Pick a megacap AI stock, and there's a pretty good chance that it's in the portfolio of his hedge fund, Appaloosa Management.\nTepper isn't as big of a fan of some of these stocks as he is of others, though. The successful hedge fund manager has been selling shares of Nvidia (NASDAQ: NVDA) and Google parent Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) hand over fist, but he has been buying two other \"Magnificent Seven\" stocks.\nIn the fourth quarter of 2023, Tepper slashed Appaloosa's stake in Nvidia by nearly 23%. While the GPU maker still ranks as the hedge fund's fourth-largest holding, Tepper clearly isn't as bullish about it as he once was.\nWhy would the billionaire sell such a big chunk of his position in Nvidia? The most likely answer is its valuation. Nvidia's share price skyrocketed by nearly 240% last year. Tepper could have been concerned, as quite a few other investors were, that the stock's valuation was becoming frothy.\nAppaloosa also reduced its stake in Alphabet by more than 16%. Again, Tepper hasn't thrown in the towel on the tech giant. Alphabet remains the seventh-largest position in his hedge fund.\nValuation probably wasn't the overriding factor behind the decision to sell some of the stake in Alphabet. It's possible, though, that Tepper might have been concerned that Alphabet's revenue from Google Search could be threatened by the development of AI-powered virtual assistants.\nSo which Magnificent Seven stocks is Tepper more enthusiastic about? He added to Appaloosa's stakes in two of them.\nAmazon (NASDAQ: AMZN) already ranked as Appaloosa's third-biggest holding. In Q4, the hedge fund added another 200,000 shares, increasing its stake by more than 5%.\nIt's not hard to think of reasons why Tepper might have decided to invest more heavily in the e-commerce and cloud services leader. Its profitability has been improving significantly, and Tepper could expect this trend to continue in 2024.\nHe also remains a fan of Microsoft (NASDAQ: MSFT). The technology giant held the No. 2 spot in Appaloosa's portfolio going into Q4. During the quarter, Tepper bought an additional 65,000 shares of Microsoft -- enough to boost the hedge fund's stake by nearly 4%.\nMicrosoft continues to fire on all cylinders. The company's integration of OpenAI's GPT-4 model throughout its product lineup appears to be paying off handsomely. Customers are flocking to Microsoft's Azure cloud platform and the AI tools that it offers. Microsoft's acquisition of Activision Blizzard also puts it in a stronger position in the gaming market.\nWere these buy-and-sell transactions of Magnificent Seven stocks smart moves on Tepper's part? So far, the verdict is mixed.\nBoth stocks that Appaloosa sold have risen since the end of Q4. Nvidia has soared by nearly 80%, while Alphabet is up close to 6%. Adding to his fund's stakes in Amazon and Microsoft, though, has paid off: Each has jumped by a double-digit percentage thus far in 2024.\nI wouldn't be surprised if the valuations of Nvidia and Microsoft eventually catch up with them. However, any sell-off of those stocks would likely only be temporary.\nMy view is that Tepper -- and other investors -- would be wise to scoop up more shares of all four of these Magnificent Seven stocks on pullbacks. I expect that AI will serve as a major long-term tailwind for each of them.\nShould you invest $1,000 in Amazon right now?\nBefore you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 21, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nBillionaire David Tepper Is Selling Alphabet and Nvidia Hand Over Fist, but Is Buying These \"Magnificent Seven\" Stocks was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-13T13:00:15.000Z",
        "Title": "Alphabet Inc. (GOOGL) Is a Trending Stock: Facts to Know Before Betting on It",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet (GOOGL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this internet search leader have returned -4.6% over the past month versus the Zacks S&P 500 composite's +3.2% change. The Zacks Internet - Services industry, to which Alphabet belongs, has lost 5.7% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nAlphabet is expected to post earnings of $1.49 per share for the current quarter, representing a year-over-year change of +27.4%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.6%.\nThe consensus earnings estimate of $6.77 for the current fiscal year indicates a year-over-year change of +16.7%. This estimate has changed +0.2% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $7.75 indicates a change of +14.5% from what Alphabet is expected to report a year ago. Over the past month, the estimate has changed -0.3%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nRevenue Growth Forecast\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Alphabet, the consensus sales estimate for the current quarter of $65.95 billion indicates a year-over-year change of +13.6%. For the current and next fiscal years, $286.48 billion and $318.3 billion estimates indicate +11.7% and +11.1% changes, respectively.\nLast Reported Results and Surprise History\nAlphabet reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago.\nCompared to the Zacks Consensus Estimate of $70.77 billion, the reported revenues represent a surprise of +2.19%. The EPS surprise was +2.5%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-21T11:00:29.000Z",
        "Title": "Alphabet's (NASDAQ:GOOGL) 20% CAGR outpaced the company's earnings growth over the same five-year period",
        "Author": "  editorial-team@simplywallst.com (Simply Wall St) ",
        "Text": "When you buy a stock there is always a possibility that it could drop 100%. But on the bright side, you can make far more than 100% on a really good stock. For example, the Alphabet Inc. (NASDAQ:GOOGL) share price has soared 153% in the last half decade. Most would be very happy with that. It's even up 6.4% in the last week.\nOn the back of a solid 7-day performance, let's check what role the company's fundamentals have played in driving long term shareholder returns.\n See our latest analysis for Alphabet \nIn his essay The Superinvestors of Graham-and-Doddsville Warren Buffett described how share prices do not always rationally reflect the value of a business. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nDuring five years of share price growth, Alphabet achieved compound earnings per share (EPS) growth of 22% per year. This EPS growth is reasonably close to the 20% average annual increase in the share price. Therefore one could conclude that sentiment towards the shares hasn't morphed very much. Indeed, it would appear the share price is reacting to the EPS.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nWe know that Alphabet has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Alphabet will grow revenue in the future.\nIt's nice to see that Alphabet shareholders have received a total shareholder return of 44% over the last year. That's better than the annualised return of 20% over half a decade, implying that the company is doing better recently. Given the share price momentum remains strong, it might be worth taking a closer look at the stock, lest you miss an opportunity. Before forming an opinion on Alphabet you might want to consider these 3 valuation metrics.\nIf you like to buy stocks alongside management, then you might just love this free list of companies. (Hint: insiders have been buying them).\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n"
    },
    {
        "Date": "2024-03-14T16:01:00.000Z",
        "Title": "Top Analyst Reports for Alphabet, McDonald's & RTX",
        "Author": "  Sheraz Mian ",
        "Text": "Thursday, March 14, 2024The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Alphabet Inc. (GOOGL), McDonald's Corporation (MCD) and RTX Corporation (RTX). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Shares of Alphabet have gained +51.2% over the past year, in-line with the Zacks Tech sector’s gain of +51.5%, but significantly better than the S&P 500 index's +31.9% gain. The company’s robust cloud division is aiding substantial revenue growth. Expanding data centers will continue to bolster its presence in the cloud space. Further, major updates in its search segment are enhancing the search results.Moreover, Google’s mobile search is gaining solid momentum. Additionally, strong focus on bolstering generative AI capabilities should aid business growth in the near term. Alphabet’s deepening focus on wearables category remains a tailwind.Alphabet’s strong efforts to gain foothold in the healthcare industry are other positives. Also, its expanding presence in the autonomous driving space is contributing well. However, sluggish Network advertisement business is a negative. Increasing litigation issues and expenses remain concerns.(You can read the full research report on Alphabet here >>>)McDonald's shares have gained +8.6% over the past year against the Zacks Retail - Restaurants industry’s gain of +11.6%. The company is likely to benefit from strong comps performance, marketing campaigns and a loyalty program. During fourth-quarter 2023, McDonald's U.K. solidified its position as a go-to destination for quality food at exceptional value, thus, boosting customer loyalty.McDonald's is also increasing its focus on menu innovation, as it believes that the strengthening of the core menu and solid marketing are likely to pave the way for additional growth in the upcoming periods. Also, the focus on Accelerating the Arches strategy bodes well.Earnings estimates for 2024 have increased in the past 30 days, depicting analysts’ optimism about the stock’s growth potential. Yet, macroeconomic challenges and commodity and wage inflation are primary headwinds.(You can read the full research report on McDonald’s here >>>)Shares of RTX have outperformed the Zacks Aerospace - Defense industry over the past six months (+21.1% vs. +12.2%). The company continues to receive ample orders from the Pentagon and its foreign allies for its wide range of combat-proven defense products.A steadily recovering commercial air traffic, both domestic and international, is expected to bolster commercial OEM as well as commercial aftermarket sales for the company. RTX holds a solid financial position which should enable it to make successful share repurchase.However, the appreciating U.S. dollar has been burdening airlines, which may hurt the stock. Also, as rising crude price tends to put cost pressure on airlines, operating results of commercial OEM producers like RTX may be impacted. The company might also be affected if China enforces its announced sanctions against RTX’s missile and defense unit.(You can read the full research report on RTX here >>>)Other noteworthy reports we are featuring today include The Progressive Corporation (PGR), Southern Copper Corporation (SCCO) and Phillips 66 (PSX).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nAlphabet (GOOGL) Benefits From Cloud & Search Initiatives\nSolid Comps Growth Aids McDonald's (MCD), High Costs Hurt\nOrder Growth Continues to Aid RTX, Amid Jet Fuel Price Hike\nFeatured Reports\nProgressive's (PGR) Solid Policies in Force Aid, Cat Loss AilPer the Zacks analyst, Progressive is set to grow on, solid policies in force, competitive rates and leadership position. However, cat loss exposure inducing underwriting volatility ails.\nExpansion Actions to Drive Southern Copper (SCCO), Costs AilThe Zacks analyst believes Southern Copper is poised well to gain from its industry-leading copper reserves and expansion actions. However, higher labor costs will hurt margins.\nPhillips 66 (PSX) to Gain From Higher Distillate Fuel DemandPhillips 66 is well-poised to benefit from higher distillate fuel demand amid changes in the marine fuel sulfur limits. Yet, its rising costs of producing refined products concerns the Zacks analyst.\nStrong Demand & Acquisitions Aid Fortive's (FTV) PerformancePer the Zacks analyst, strong demand trends and acquisitions is driving Fortive's performance. Softness in Precision Technologies' segment coupled with leveraged balance sheet is concerning.\nStrong Demand for Key Drugs Drive BioMarin's (BMRN) ToplineWhile BioMarin's (BMRN) key drugs like Vimzim and Naglazyme have been driving sales, the Zacks Analyst is encouraged by rapid uptake for new drug, Voxzogo which has opened up a new sales opportunity.\nRobust Marketplace Activities & Services Benefit Etsy (ETSY)Per the Zacks analyst, Etsy is benefitting from accelerating marketplace and service revenues, driven by solid momentum across buyers and sellers.\nGlobal Clients Aid FTI Consulting (FCN) Despite High CostsPer the Zacks analyst, FTI Consulting's strong international operations make it an excellent partner for global clients, generating continued revenue growth. Rising investment costs are concerning.\nNew Upgrades\nIron Mountain (IRM) Gains From Data Center & Storage DemandPer the Zacks analyst, strong cash flows from the storage and records management businesses, data-center business expansion and healthy balance sheet are likely to support Iron Mountain's performance.\nDaVita (DVA) Rides on its Patient-Centric Business ModelThe Zacks analyst is upbeat about DaVita's patient-centric care model that leverages its platform of kidney care services and steady expansion in the international markets.\nInfrastructure Investments, Clean Assets Aid NiSource (NI)Per the Zacks analyst, NiSource' investment of around $16 billion through 2028, will strengthen its infrastructure, and adding more clean assets in generation portfolio will drive its performance.\nNew Downgrades\nHigh Input Costs & Supply-Chain Issues to Hurt Lindsay (LNN)The Zacks analyst is concerned that higher input costs, labor shortage, increased transportation costs and supply-chain headwinds will hurt Lindsay's results in the near term.\nHanesbrands (HBI) Remains Troubled by Soft Activewear UnitPer the Zacks analyst, Hanesbrands is hurt by soft Activewear unit. In Q4, Activewear sales fell 24.1% on tough apparel market dynamics, including soft consumer demand and cautious retailer orders.\nReduced Visitation & Weather Woes Hurt Vail Resorts (MTN)Per the Zacks analyst, Vail Resorts's is likely to be hurt by reduced visitation levels and weather-related operational disruptions. Also, interest rate fluctuations pose concern.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\nThe Progressive Corporation (PGR) : Free Stock Analysis Report\nSouthern Copper Corporation (SCCO) : Free Stock Analysis Report\nPhillips 66 (PSX) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nRTX Corporation (RTX) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-18T12:00:18.000Z",
        "Title": "Beyond Market Price: Uncovering Alphabet Inc's Intrinsic Value",
        "Author": "  GuruFocus Research ",
        "Text": "In this article, we will take a look into Alphabet Inc's (NASDAQ:GOOGL) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\nWarning! GuruFocus has detected 7 Warning Sign with MA.\nAs of 2024-03-18, Alphabet Inc's intrinsic value as calculated by the Discounted Earnings model is $185.66. It's currently trading at a price of $141.24. Therefore, the margin of safety based on the DCF model is 23.93%. The company is modestly undervalued.\nThe GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Alphabet Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\nTerm\nValue\nExplanation\nEPS without NRI\n$5.94\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.31%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 21.80% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\nGrowth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n102.56\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n106.93\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n185.66\nGuruFocus also provides the calculation using the traditional approach of free cash flow. Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $166.94. This valuation indicates that the Alphabet Inc is modestly undervalued, accompanied by a margin of safety of 15.39%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page.\nPlease note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nUsing the GuruFocus All-in-One Screener, you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies, focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-05T22:45:19.000Z",
        "Title": "Alphabet Inc. (GOOG) Stock Moves -0.31%: What You Should Know",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet Inc. (GOOG) closed the most recent trading day at $133.78, moving -0.31% from the previous trading session. This change was narrower than the S&P 500's daily loss of 1.02%. On the other hand, the Dow registered a loss of 1.04%, and the technology-centric Nasdaq decreased by 1.65%.\nThe company's stock has dropped by 7.4% in the past month, falling short of the Computer and Technology sector's gain of 3.72% and the S&P 500's gain of 3.64%.\nThe investment community will be paying close attention to the earnings performance of Alphabet Inc. in its upcoming release. On that day, Alphabet Inc. is projected to report earnings of $1.49 per share, which would represent year-over-year growth of 27.35%. Meanwhile, the latest consensus estimate predicts the revenue to be $65.95 billion, indicating a 13.58% increase compared to the same quarter of the previous year.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $6.77 per share and a revenue of $286.48 billion, representing changes of +16.72% and +11.68%, respectively, from the prior year.\nAny recent changes to analyst estimates for Alphabet Inc. should also be noted by investors. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.12% increase. Alphabet Inc. presently features a Zacks Rank of #3 (Hold).\nValuation is also important, so investors should note that Alphabet Inc. has a Forward P/E ratio of 19.81 right now. This indicates a discount in contrast to its industry's Forward P/E of 26.57.\nIt is also worth noting that GOOG currently has a PEG ratio of 1.24. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. Internet - Services stocks are, on average, holding a PEG ratio of 2.24 based on yesterday's closing prices.\nThe Internet - Services industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 141, this industry ranks in the bottom 45% of all industries, numbering over 250.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-04T14:00:15.000Z",
        "Title": "Is Trending Stock Alphabet Inc. (GOOG) a Buy Now?",
        "Author": "  Zacks Equity Research ",
        "Text": "Alphabet Inc. (GOOG) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nOver the past month, shares of this company have returned -3.8%, compared to the Zacks S&P 500 composite's +4.8% change. During this period, the Zacks Internet - Services industry, which Alphabet Inc. falls in, has lost 1.7%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Alphabet Inc. is expected to post earnings of $1.49 per share, indicating a change of +27.4% from the year-ago quarter. The Zacks Consensus Estimate has changed +1.7% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $6.78 points to a change of +16.9% from the prior year. Over the last 30 days, this estimate has changed +0.8%.\nFor the next fiscal year, the consensus earnings estimate of $7.76 indicates a change of +14.6% from what Alphabet Inc. is expected to report a year ago. Over the past month, the estimate has changed +0.2%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet Inc. is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nIn the case of Alphabet Inc. the consensus sales estimate of $65.95 billion for the current quarter points to a year-over-year change of +13.6%. The $286.52 billion and $318.66 billion estimates for the current and next fiscal years indicate changes of +11.7% and +11.2%, respectively.\nLast Reported Results and Surprise History\nAlphabet Inc. reported revenues of $72.32 billion in the last reported quarter, representing a year-over-year change of +14.6%. EPS of $1.64 for the same period compares with $1.05 a year ago.\nCompared to the Zacks Consensus Estimate of $70.81 billion, the reported revenues represent a surprise of +2.14%. The EPS surprise was +2.5%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet Inc. is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet Inc. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-16T13:00:00.000Z",
        "Title": "4 Reasons Why Alphabet Is My Top Stock to Buy Now",
        "Author": "  Parkev Tatevosian, CFA, The Motley Fool ",
        "Text": "Fool.com contributor Parkev Tatevosian highlights four reasons why Google parent company Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) is his top-rated stock to buy now.\n*Stock prices used were the afternoon prices of March 13, 2024. The video was published on March 15, 2024.\nShould you invest $1,000 in Alphabet right now?\nBefore you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Parkev Tatevosian, CFA has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet. The Motley Fool has a disclosure policy. Parkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool.\n4 Reasons Why Alphabet Is My Top Stock to Buy Now was originally published by The Motley Fool\n"
    },
    {
        "Date": "2024-03-07T04:53:41.000Z",
        "Title": "Alphabet Inc (GOOG) CEO Sundar Pichai Sells 22,500 Shares",
        "Author": "  GuruFocus Research ",
        "Text": "Alphabet Inc (NASDAQ:GOOG), the parent company of Google, is a global technology leader focused on improving the ways people connect with information. The company's business encompasses a wide array of products and services, including search, advertising, operating systems and platforms, enterprise, and hardware products.According to a recent SEC Filing, the CEO of Alphabet Inc, Sundar Pichai, sold 22,500 shares of the company on March 6, 2024. The transaction was executed at an average price of $132.7 per share, resulting in a total value of $2,985,750.Over the past year, the insider has sold a total of 135,000 shares of Alphabet Inc and has not made any share purchases. The insider transaction history for Alphabet Inc reveals a pattern of 56 insider sells and zero insider buys over the same timeframe.\nThe market capitalization of Alphabet Inc stood at $1,640.206 billion on the day of the insider's recent sale. The stock's price-earnings ratio was recorded at 22.85, which is above the industry median of 21.33 but below the company's historical median price-earnings ratio.\nAlphabet Inc's shares were trading at $132.7, with a GuruFocus Value of $148.99, indicating a price-to-GF-Value ratio of 0.89. This suggests that the stock is modestly undervalued according to the GF Value, which is determined by historical trading multiples, a GuruFocus adjustment factor based on past returns and growth, and future business performance estimates from Morningstar analysts.\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\nThis article first appeared on GuruFocus.\n"
    },
    {
        "Date": "2024-03-04T09:04:00.000Z",
        "Title": "Zacks Value Investor Highlights: Apple, Alphabet and Berkshire Hathaway",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 4, 2024 – Zacks Value Investor is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here: https://www.zacks.com/stock/news/2234701/alphabet-is-on-sale-will-buffett-buy-shares\nWelcome to Episode #360 of the Value Investor Podcast.\n(0:30) - Should You Buy More of The Magnificent 7?\n(8:00) - If Warren Buffett Buys Apple, Should You Buy Too?\n(32:00) - Episode Roundup: AAPL, GOOGL, BRK.B\n Podcast@Zacks.com\n Every week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nThere is a lot of angst on Wall Street about the stocks of Apple AAPL and Alphabet GOOGL this year. Both are off record highs set earlier in the year and neither one is performing like NVIDIA, up triple digits.\nBerkshire Hathaway (BRK.B) owns Apple shares. Warren Buffett bought a big position in the company in 2016 and considers it one of the four linchpins of Berkshire Hathaway’s business.\nBuffett loves it so much, he gushes about Apple at nearly every Berkshire Hathaway annual meeting.\nIt may be hard to believe today, but Apple was out of favor in 2016 when Buffett dove in. It traded with a forward P/E as low as 10.6 that year. Apple’s 2024 forward P/E is 28. No one is calling Apple a value stock in 2024.\nApple also had a cheap P/S ratio in 2016. The high that year was 2.8 and the low was 2.3. Currently, Apple trades with a P/S ratio of 7.3. It’s not over 10, which is considered expensive, but 7.3 is above the current average of the S&P 500 at 4.2.\nApple also had an attractive P/B ratio in 2016. It’s high was 4.7 and low was 3.9 that year. A P/B under 3.0 usually indicates value. Currently, Apple’s P/B ratio is a sky-high 38.\nBuffett loves companies with great free cash flow and Alphabet has doubled its free cash flow since 2019. In 2023, it had annual free cash flow of $69.5 billion, up from $30.9 billion in 2019.\nBuffett also likes companies that are doing share buybacks and Alphabet announced a $70 billion buyback in April 2023.\nDoes Alphabet have a moat? Berkshire Hathaway looks for companies with competitive advantages of a “moat.”\nAlphabet’s advertising revenue has been a moat over the last two decades, although some are questioning whether AI might eat into it. But Alphabet also has YouTube, which recently posted its best quarter for ad revenue ever.\nBuffett also likes companies with great management who have been in a place for years. Alphabet fits that bill.\nTune into this week’s podcast for Tracey’s analysis of Alphabet’s valuation. The stock is on sale. But is it cheap enough for Buffett to dive in?\n[In full disclosure, Tracey owns shares of GOOGL in her personal portfolio.]\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nTracey Ryniec is the Value Stock Strategist for Zacks.com. She is also the Editor of the Insider Trader and Value Investor services. You can follow her on twitter at @TraceyRyniec and she also hosts the Zacks Market Edge Podcast on iTunes.\nZacks.com is a property of Zacks Investment Research, Inc., which was formed in 1978. The later formation of the Zacks Rank, a proprietary stock picking system; continues to outperform the market by nearly a 3 to 1 margin. The best way to unlock the profitable stock recommendations and market insights of Zacks Investment Research is through our free daily email newsletter; Profit from the Pros.  In short, it's your steady flow of Profitable ideas GUARANTEED to be worth your time!  Click here for your free subscription to Profit from the Pros.\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com/performance\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-07T08:50:00.000Z",
        "Title": "Zacks Investment Ideas feature highlights: Microsoft, Alphabet, Nasdaq 100 ETF and CBIZ",
        "Author": "  Zacks Equity Research ",
        "Text": "Chicago, IL – March 7, 2024 – Today, Zacks Investment Ideas feature highlights Microsoft MSFT, Alphabet GOOGL, Nasdaq 100 ETF QQQ and CBIZ CBZ.\nMany similarities exist between the internet boom of the late 1990s and the AI revolution that is taking place today, including blistering growth, soaring stock prices, and lots of hype. However, significant differences exist as well. For example, Wall Street and the biggest AI winners thus far are already proven companies with massive cash hoards and well-established businesses like Microsoft and Alphabet.\nAt the same time, the AI buildout has buoyed the stock prices of these companies and led to robust earnings, it’s difficult to move the needle on a multi-trillion-dollar business like GOOGL or MSFT. Furthermore, many of these companies have broad and diverse businesses that stretch beyond AI.\nSeveral data points suggest that the AI boom is in its 1995 moment rather than its 1999 moment. For instance, stock valuations are relatively inexpensive (at least compared to 99’), and the Nasdaq 100 ETF is just now breaking out to all-time highs. Still, the most significant divergence between then and now is the IPO market. In 2023, there were 154 IPOs on the U.S. stock market. Conversely, in 1999, a staggering 473 IPOs went public. Quite the difference!\nIPOs, or Initial Public Offerings, serve as the lifeblood of the stock market by infusing it with new, publicly traded companies. These offerings provide opportunities for investors to buy shares in promising, often innovative enterprises, fostering market growth. In the late 1990s, the IPOs provided the most significant gains because many were agile, had blistering growth expectations, and were pure plays in the space.\nObviously, investors cannot change the fact that there are few pure-play AI avenues on Wall Street. Presently, they can invest in the aforementioned dominant big tech juggernauts.\nNevertheless, the best investors prepare for and study non-public companies ahead of time. They watch early-stage innovators early so that they fully understand the industry and can pounce when the opportunity comes.\nAn example of an AI start-up worth watching is Propense.ai. Today, Propense.ai announced a successful seed funding round. The Miami-based company combines AI technology with data science, user psychology, human behavior, and industry insights to anticipate client needs. Propense.ai streamlines the sales experience for accounting and legal professionals by providing them with highly probable cross-selling recommendations for existing customers, making it the first platform of its kind to maximize revenue opportunities for professional services firms.\nIn recent comments, Propense.ai CEO and Co-Founder Timothy Keith said,\n“The most successful professional service firms are actively engaged in adding service offerings to help their clients, but often struggle with educating their teams on when to offer new services. Propense.ai solves this challenge, elevating client satisfaction while also driving revenue. Behavior is one of the most difficult factors to change in the workplace, especially when sales professionals are expected to cross-sell services they don’t understand nearly as well as their core lines of business. That’s where Propense.ai and its revenue automation capabilities come into play. Using generative AI, accounting and legal professionals can propel new revenue by anticipating and supporting their client’s needs ahead of time.”\nThe best ideas are ones that solve issues. Propense.ai is an example of a company that solves the issue of employee education while adding efficiency and revenue growth. Though the company is still young, it already counts public companies such as public consulting juggernaut CBIZ as clients.\nWhile the AI buildout is in motion, Wall Street and the AI industry have yet to experience the IPO frenzy that took place in the mid-to-late 1990s. Though many private AI start-ups still need to be bigger to enter public markets, I expect that will change in the coming years. In the interim, investors should take the time to investigate and study up-and-coming AI companies such as Propense.ai to educate themselves about the industry and prepare for the eventual influx of IPOs. These IPOs will likely provide the best opportunities because of their industry tailwind, high-growth potential, and asymmetric investment potential.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nCBIZ, Inc. (CBZ) : Free Stock Analysis Report\nInvesco QQQ (QQQ): ETF Research Reports\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\n"
    },
    {
        "Date": "2024-03-15T10:00:00.000Z",
        "Title": "1 Unstoppable Stock That Could Join Nvidia, Apple, Microsoft, Amazon, Alphabet, and Meta in the $1 Trillion Club",
        "Author": "  Anthony Di Pizio, The Motley Fool ",
        "Text": "Artificial intelligence (AI) minted its first $1 trillion company last year when Nvidia stock rose 239% on the back of incredible demand for its AI data center chips. Nvidia is now worth more than $2.2 trillion, making it the third-largest company in the world behind Microsoft and Apple. Amazon, Meta Platforms, and Alphabet (Google's parent company) are also members of the $1 trillion club, and each company is working on AI in its own unique way.\nBut I think AI could soon propel Oracle (NYSE: ORCL) to a $1 trillion valuation, too. It operates industry-leading AI data center infrastructure, and the company is building capacity at a record pace because it simply can't keep up with demand. As of this writing, Oracle is valued at $350 billion, so investors who buy the stock today will see roughly a 185% gain if the company joins the $1 trillion club.\nFounded in 1977, Oracle is one of America's oldest technology companies. It developed revolutionary database management software back then, before helping its business customers prepare for the internet age in the late 1990s and early 2000s. The company created Oracle Cloud Infrastructure (OCI) in 2016 and has since delivered hundreds of digital services to those businesses to migrate their operations online.\nNow, using Nvidia's latest graphics processing units (GPUs), Oracle is focused on delivering the best data center infrastructure for AI workloads. Three months ago, Oracle told investors it was expanding 66 of its existing data center regions and building 100 more to meet demand.\nChairman Larry Ellison says Oracle's GPU cluster technology allows businesses to develop generative AI models twice as fast and for half the cost of other cloud providers. As a result, demand for its latest Gen2 Cloud capacity is skyrocketing. Oracle is able to keep costs down because its data centers rely on automation, which means there is little difference in operating costs between running 10 data centers and running 100. That also enables the company to build and scale them quickly.\nIn a conference call with investors for the fiscal 2024 third quarter (ended Feb. 29), CEO Safra Catz said Oracle has at least 40 new AI bookings worth more than $1 billion each that haven't even come online yet. In other words, they are waiting for additional infrastructure to be built.\nOracle generated $13.3 billion in total revenue during Q3, representing a year-over-year increase of 7%. While that sounds like a sluggish growth rate, revenue for OCI surged 49% to $1.8 billion, and revenue for Gen2 Cloud specifically (within OCI) grew by 53%.\nWhile OCI only accounts for 13.5% of Oracle's total revenue right now, those growth rates will ensure it becomes a much larger piece of the pie in the near future.\nOracle's total AI bookings across its business topped a record $80 billion in Q3, marking a 29% increase from the year-ago period. As you can see, bookings grew four times faster than the company's revenue during the quarter, which is evidence of the enormous demand for computing capacity the company is struggling to fill.\nAt the bottom line, Oracle's Q3 earnings per share jumped 25% to $0.85, which also outpaced revenue growth. It was thanks, in part, to careful cost management, with operating expenses increasing just 4% year over year. But it was also thanks to a substantial increase in gross profit margin on the infrastructure side, which is a natural consequence of scale. Oracle expects continued improvement as more of its new data centers come online.\nAI is the main point of focus for Oracle at the moment, but there's another opportunity worth mentioning. The company now has two Oracle Alloy data center regions online, which organizations can use to deliver their own cloud services to their customers -- without having to manage the infrastructure.\nOracle has planned five more Alloy data center regions, meaning capacity could soon triple. It's just another example of this company's long-standing commitment to innovation.\nAccording to Wall Street, Oracle is on track to generate $53.4 billion in revenue in fiscal 2024 (ending May 31), placing its stock at a price-to-sales (P/S) ratio of 6.6. That falls between the valuations of other cloud giants, like Amazon (P/S ratio of 3.1) and Microsoft (P/S ratio of 13.2).\nAssuming Oracle's P/S ratio remains constant, the company would have to generate $151.5 billion in annual revenue to justify a $1 trillion valuation. It could get there within a decade if its revenue grows by 11% annually.\nWhile Oracle is growing more slowly on a quarterly basis right now, its revenue increased by 22% last fiscal year. Plus, Ellison believes OCI revenue will increase by more than 50% for years to come, which could drive an acceleration in the company's top line overall as the segment grows larger.\nRemember, Oracle is in the process of more than doubling its data center footprint, and its bookings just soared by 29% in a single quarter. Bookings are expected to convert into revenue eventually, implying revenue growth will likely accelerate in the near future.\nAI is the greatest financial opportunity Oracle has ever pursued, and I think it's the company's ticket to a $1 trillion valuation within the next 10 years.\nShould you invest $1,000 in Oracle right now?\nBefore you buy stock in Oracle, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Oracle wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\nSee the 10 stocks\n*Stock Advisor returns as of March 11, 2024\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n1 Unstoppable Stock That Could Join Nvidia, Apple, Microsoft, Amazon, Alphabet, and Meta in the $1 Trillion Club was originally published by The Motley Fool\n"
    }
]